[
    {    
        "label": "北京市",
        "value": "110000",
        "country": "china",
        "lon": 116.39564503788,
        "lat": 39.92998577808,
        "children": [
            {
                "label": "市辖区",
                "value": "110100",
                "provinceCode": "110000",
                "lon": 116.39564503788,
                "lat": 39.92998577808,
                "children": [
                    {
                        "label": "东城区",
                        "value": "110101",
                        "cityCode": "110100",
                        "provinceCode": "110000",
                        "lon": 116.42188470126,
                        "lat": 39.938574012986
                    },
                    {
                        "label": "西城区",
                        "value": "110102",
                        "cityCode": "110100",
                        "provinceCode": "110000",
                        "lon": 116.37319010402,
                        "lat": 39.934280143709
                    },
                    {
                        "label": "朝阳区",
                        "value": "110105",
                        "cityCode": "110100",
                        "provinceCode": "110000",
                        "lon": 116.52169489108,
                        "lat": 39.958953166407
                    },
                    {
                        "label": "丰台区",
                        "value": "110106",
                        "cityCode": "110100",
                        "provinceCode": "110000",
                        "lon": 116.25837033547,
                        "lat": 39.841937852205
                    },
                    {
                        "label": "石景山区",
                        "value": "110107",
                        "cityCode": "110100",
                        "provinceCode": "110000",
                        "lon": 116.18455581037,
                        "lat": 39.938866544646
                    },
                    {
                        "label": "海淀区",
                        "value": "110108",
                        "cityCode": "110100",
                        "provinceCode": "110000",
                        "lon": 116.23967780102,
                        "lat": 40.033162045078
                    },
                    {
                        "label": "门头沟区",
                        "value": "110109",
                        "cityCode": "110100",
                        "provinceCode": "110000",
                        "lon": 115.79579538125,
                        "lat": 40.000893031476
                    },
                    {
                        "label": "房山区",
                        "value": "110111",
                        "cityCode": "110100",
                        "provinceCode": "110000",
                        "lon": 115.8628363129,
                        "lat": 39.726752620796
                    },
                    {
                        "label": "通州区",
                        "value": "110112",
                        "cityCode": "110100",
                        "provinceCode": "110000",
                        "lon": 116.74007918068,
                        "lat": 39.809814883851
                    },
                    {
                        "label": "顺义区",
                        "value": "110113",
                        "cityCode": "110100",
                        "provinceCode": "110000",
                        "lon": 116.72822904528,
                        "lat": 40.154951470441
                    },
                    {
                        "label": "昌平区",
                        "value": "110114",
                        "cityCode": "110100",
                        "provinceCode": "110000",
                        "lon": 116.21645635689,
                        "lat": 40.221723549832
                    },
                    {
                        "label": "大兴区",
                        "value": "110115",
                        "cityCode": "110100",
                        "provinceCode": "110000",
                        "lon": 116.42519459738,
                        "lat": 39.652790118364
                    },
                    {
                        "label": "怀柔区",
                        "value": "110116",
                        "cityCode": "110100",
                        "provinceCode": "110000",
                        "lon": 116.59340835643,
                        "lat": 40.638139340311
                    },
                    {
                        "label": "平谷区",
                        "value": "110117",
                        "cityCode": "110100",
                        "provinceCode": "110000",
                        "lon": 117.15043344819,
                        "lat": 40.215925453896
                    },
                    {
                        "label": "密云区",
                        "value": "110118",
                        "cityCode": "110100",
                        "provinceCode": "110000",
                        "lon": 117.09666568438,
                        "lat": 40.517334853846
                    },
                    {
                        "label": "延庆区",
                        "value": "110119",
                        "cityCode": "110100",
                        "provinceCode": "110000",
                        "lon": 116.1618831398,
                        "lat": 40.535475747111
                    }
                ]
            }
        ]
       
    },
    {
        "country": "china",
        "lon": 117.21081309155,
        "lat": 39.14392990331,
        "children": [
            {
                "label": "市辖区",
                "value": "120100",
                "provinceCode": "120000",
                "lon": 117.21081309155,
                "lat": 39.14392990331,
                "children": [
                    {
                        "label": "和平区",
                        "value": "120101",
                        "cityCode": "120100",
                        "provinceCode": "120000",
                        "lon": 117.20281365403,
                        "lat": 39.124808844703
                    },
                    {
                        "label": "河东区",
                        "value": "120102",
                        "cityCode": "120100",
                        "provinceCode": "120000",
                        "lon": 117.26169316527,
                        "lat": 39.126625684666
                    },
                    {
                        "label": "河西区",
                        "value": "120103",
                        "cityCode": "120100",
                        "provinceCode": "120000",
                        "lon": 117.23616545062,
                        "lat": 39.084493739615
                    },
                    {
                        "label": "南开区",
                        "value": "120104",
                        "cityCode": "120100",
                        "provinceCode": "120000",
                        "lon": 117.16272794945,
                        "lat": 39.116987285522
                    },
                    {
                        "label": "河北区",
                        "value": "120105",
                        "cityCode": "120100",
                        "provinceCode": "120000",
                        "lon": 117.22029676508,
                        "lat": 39.173148933924
                    },
                    {
                        "label": "红桥区",
                        "value": "120106",
                        "cityCode": "120100",
                        "provinceCode": "120000",
                        "lon": 117.16221680792,
                        "lat": 39.170621331225
                    },
                    {
                        "label": "东丽区",
                        "value": "120110",
                        "cityCode": "120100",
                        "provinceCode": "120000",
                        "lon": 117.41478234325,
                        "lat": 39.139604642775
                    },
                    {
                        "label": "西青区",
                        "value": "120111",
                        "cityCode": "120100",
                        "provinceCode": "120000",
                        "lon": 117.12620134665,
                        "lat": 39.035064611485
                    },
                    {
                        "label": "津南区",
                        "value": "120112",
                        "cityCode": "120100",
                        "provinceCode": "120000",
                        "lon": 117.39290995972,
                        "lat": 38.969790532725
                    },
                    {
                        "label": "北辰区",
                        "value": "120113",
                        "cityCode": "120100",
                        "provinceCode": "120000",
                        "lon": 117.18060609828,
                        "lat": 39.259130625979
                    },
                    {
                        "label": "武清区",
                        "value": "120114",
                        "cityCode": "120100",
                        "provinceCode": "120000",
                        "lon": 117.03457791373,
                        "lat": 39.457042575494
                    },
                    {
                        "label": "宝坻区",
                        "value": "120115",
                        "cityCode": "120100",
                        "provinceCode": "120000",
                        "lon": 117.41142059078,
                        "lat": 39.615544004133
                    },
                    {
                        "label": "滨海新区",
                        "value": "120116",
                        "cityCode": "120100",
                        "provinceCode": "120000",
                        "lon": 117.64628627057,
                        "lat": 39.059176638035
                    },
                    {
                        "label": "宁河区",
                        "value": "120117",
                        "cityCode": "120100",
                        "provinceCode": "120000",
                        "lon": 117.6312358292,
                        "lat": 39.390421570053
                    },
                    {
                        "label": "静海区",
                        "value": "120118",
                        "cityCode": "120100",
                        "provinceCode": "120000",
                        "lon": 116.98682530718,
                        "lat": 38.837510804607
                    },
                    {
                        "label": "蓟州区",
                        "value": "120119",
                        "cityCode": "120100",
                        "provinceCode": "120000",
                        "lon": 117.47034191571,
                        "lat": 40.009456311951
                    }
                ]
            }
        ],
        "label": "天津市",
        "value": "120000"
    },
    {
        "country": "china",
        "lon": 115.66143362422,
        "lat": 38.613839749251,
        "children": [
            {
                "label": "石家庄市",
                "value": "130100",
                "provinceCode": "130000",
                "lon": 114.52208184421,
                "lat": 38.048958314615,
                "children": [
                    {
                        "label": "长安区",
                        "value": "130102",
                        "cityCode": "130100",
                        "provinceCode": "130000",
                        "lon": 114.59262155387,
                        "lat": 38.076874795787
                    },
                    {
                        "label": "桥西区",
                        "value": "130104",
                        "cityCode": "130100",
                        "provinceCode": "130000",
                        "lon": 114.43813995532,
                        "lat": 38.033364550068
                    },
                    {
                        "label": "新华区",
                        "value": "130105",
                        "cityCode": "130100",
                        "provinceCode": "130000",
                        "lon": 114.45350142869,
                        "lat": 38.117218640478
                    },
                    {
                        "label": "井陉矿区",
                        "value": "130107",
                        "cityCode": "130100",
                        "provinceCode": "130000",
                        "lon": 114.05074376291,
                        "lat": 38.08109756116
                    },
                    {
                        "label": "裕华区",
                        "value": "130108",
                        "cityCode": "130100",
                        "provinceCode": "130000",
                        "lon": 114.58638255261,
                        "lat": 38.014621045712
                    },
                    {
                        "label": "藁城区",
                        "value": "130109",
                        "cityCode": "130100",
                        "provinceCode": "130000",
                        "lon": 114.82809608578,
                        "lat": 38.089490113945
                    },
                    {
                        "label": "鹿泉区",
                        "value": "130110",
                        "cityCode": "130100",
                        "provinceCode": "130000",
                        "lon": 114.35731900345,
                        "lat": 38.089969323509
                    },
                    {
                        "label": "栾城区",
                        "value": "130111",
                        "cityCode": "130100",
                        "provinceCode": "130000",
                        "lon": 114.64775310253,
                        "lat": 37.91328595181
                    },
                    {
                        "label": "井陉县",
                        "value": "130121",
                        "cityCode": "130100",
                        "provinceCode": "130000",
                        "lon": 114.07795206335,
                        "lat": 38.000890815811
                    },
                    {
                        "label": "正定县",
                        "value": "130123",
                        "cityCode": "130100",
                        "provinceCode": "130000",
                        "lon": 114.57020132348,
                        "lat": 38.227072535479
                    },
                    {
                        "label": "行唐县",
                        "value": "130125",
                        "cityCode": "130100",
                        "provinceCode": "130000",
                        "lon": 114.45743612437,
                        "lat": 38.546695301387
                    },
                    {
                        "label": "灵寿县",
                        "value": "130126",
                        "cityCode": "130100",
                        "provinceCode": "130000",
                        "lon": 114.18781898137,
                        "lat": 38.510935985414
                    },
                    {
                        "label": "高邑县",
                        "value": "130127",
                        "cityCode": "130100",
                        "provinceCode": "130000",
                        "lon": 114.6073846934,
                        "lat": 37.622650870757
                    },
                    {
                        "label": "深泽县",
                        "value": "130128",
                        "cityCode": "130100",
                        "provinceCode": "130000",
                        "lon": 115.23310242793,
                        "lat": 38.194680827355
                    },
                    {
                        "label": "赞皇县",
                        "value": "130129",
                        "cityCode": "130100",
                        "provinceCode": "130000",
                        "lon": 114.28955340433,
                        "lat": 37.628132452966
                    },
                    {
                        "label": "无极县",
                        "value": "130130",
                        "cityCode": "130100",
                        "provinceCode": "130000",
                        "lon": 114.95113960113,
                        "lat": 38.1832860202
                    },
                    {
                        "label": "平山县",
                        "value": "130131",
                        "cityCode": "130100",
                        "provinceCode": "130000",
                        "lon": 113.87242852701,
                        "lat": 38.408762191725
                    },
                    {
                        "label": "元氏县",
                        "value": "130132",
                        "cityCode": "130100",
                        "provinceCode": "130000",
                        "lon": 114.42836015628,
                        "lat": 37.807352641009
                    },
                    {
                        "label": "赵县",
                        "value": "130133",
                        "cityCode": "130100",
                        "provinceCode": "130000",
                        "lon": 114.83493823756,
                        "lat": 37.769612448365
                    },
                    {
                        "label": "辛集市",
                        "value": "130181",
                        "cityCode": "130100",
                        "provinceCode": "130000",
                        "lon": 115.29874950521,
                        "lat": 37.924121876409
                    },
                    {
                        "label": "晋州市",
                        "value": "130183",
                        "cityCode": "130100",
                        "provinceCode": "130000",
                        "lon": 115.09173828064,
                        "lat": 37.991145102246
                    },
                    {
                        "label": "新乐市",
                        "value": "130184",
                        "cityCode": "130100",
                        "provinceCode": "130000",
                        "lon": 114.76227076683,
                        "lat": 38.377578025839
                    }
                ]
            },
            {
                "label": "唐山市",
                "value": "130200",
                "provinceCode": "130000",
                "lon": 118.18345059773,
                "lat": 39.650530922537,
                "children": [
                    {
                        "label": "路南区",
                        "value": "130202",
                        "cityCode": "130200",
                        "provinceCode": "130000",
                        "lon": 118.20604028639,
                        "lat": 39.612986996735
                    },
                    {
                        "label": "路北区",
                        "value": "130203",
                        "cityCode": "130200",
                        "provinceCode": "130000",
                        "lon": 118.18506997308,
                        "lat": 39.657845680029
                    },
                    {
                        "label": "古冶区",
                        "value": "130204",
                        "cityCode": "130200",
                        "provinceCode": "130000",
                        "lon": 118.46223153818,
                        "lat": 39.723044780378
                    },
                    {
                        "label": "开平区",
                        "value": "130205",
                        "cityCode": "130200",
                        "provinceCode": "130000",
                        "lon": 118.25784790075,
                        "lat": 39.692123420846
                    },
                    {
                        "label": "丰南区",
                        "value": "130207",
                        "cityCode": "130200",
                        "provinceCode": "130000",
                        "lon": 118.08584709899,
                        "lat": 39.384662748593
                    },
                    {
                        "label": "丰润区",
                        "value": "130208",
                        "cityCode": "130200",
                        "provinceCode": "130000",
                        "lon": 118.05949036617,
                        "lat": 39.789909410339
                    },
                    {
                        "label": "曹妃甸区",
                        "value": "130209",
                        "cityCode": "130200",
                        "provinceCode": "130000",
                        "lon": 118.41596118319,
                        "lat": 39.266037841072
                    },
                    {
                        "label": "滦南县",
                        "value": "130224",
                        "cityCode": "130200",
                        "provinceCode": "130000",
                        "lon": 118.54938466456,
                        "lat": 39.360738899901
                    },
                    {
                        "label": "乐亭县",
                        "value": "130225",
                        "cityCode": "130200",
                        "provinceCode": "130000",
                        "lon": 118.93994305703,
                        "lat": 39.357228891896
                    },
                    {
                        "label": "迁西县",
                        "value": "130227",
                        "cityCode": "130200",
                        "provinceCode": "130000",
                        "lon": 118.37138905434,
                        "lat": 40.238507660812
                    },
                    {
                        "label": "玉田县",
                        "value": "130229",
                        "cityCode": "130200",
                        "provinceCode": "130000",
                        "lon": 117.7347526449,
                        "lat": 39.818843355788
                    },
                    {
                        "label": "遵化市",
                        "value": "130281",
                        "cityCode": "130200",
                        "provinceCode": "130000",
                        "lon": 117.95763912762,
                        "lat": 40.137901064021
                    },
                    {
                        "label": "迁安市",
                        "value": "130283",
                        "cityCode": "130200",
                        "provinceCode": "130000",
                        "lon": 118.68695461732,
                        "lat": 40.04044251326
                    }
                ]
            },
            {
                "label": "秦皇岛市",
                "value": "130300",
                "provinceCode": "130000",
                "lon": 119.60436761612,
                "lat": 39.945461565898,
                "children": [
                    {
                        "label": "海港区",
                        "value": "130302",
                        "cityCode": "130300",
                        "provinceCode": "130000",
                        "lon": 119.57761724583,
                        "lat": 39.988779577117
                    },
                    {
                        "label": "山海关区",
                        "value": "130303",
                        "cityCode": "130300",
                        "provinceCode": "130000",
                        "lon": 119.7136155797,
                        "lat": 40.032899628101
                    },
                    {
                        "label": "北戴河区",
                        "value": "130304",
                        "cityCode": "130300",
                        "provinceCode": "130000",
                        "lon": 119.47932079421,
                        "lat": 39.854292584187
                    },
                    {
                        "label": "抚宁区",
                        "value": "130306",
                        "cityCode": "130300",
                        "provinceCode": "130000",
                        "lon": 119.34003537992,
                        "lat": 39.910857115367
                    },
                    {
                        "label": "青龙满族自治县",
                        "value": "130321",
                        "cityCode": "130300",
                        "provinceCode": "130000",
                        "lon": 119.13758245072,
                        "lat": 40.353650308648
                    },
                    {
                        "label": "昌黎县",
                        "value": "130322",
                        "cityCode": "130300",
                        "provinceCode": "130000",
                        "lon": 119.09462149738,
                        "lat": 39.638021164728
                    },
                    {
                        "label": "卢龙县",
                        "value": "130324",
                        "cityCode": "130300",
                        "provinceCode": "130000",
                        "lon": 118.98556414609,
                        "lat": 39.920978455186
                    }
                ]
            },
            {
                "label": "邯郸市",
                "value": "130400",
                "provinceCode": "130000",
                "lon": 114.48269393234,
                "lat": 36.609307928471,
                "children": [
                    {
                        "label": "邯山区",
                        "value": "130402",
                        "cityCode": "130400",
                        "provinceCode": "130000",
                        "lon": 114.46928986668,
                        "lat": 36.536153078937
                    },
                    {
                        "label": "丛台区",
                        "value": "130403",
                        "cityCode": "130400",
                        "provinceCode": "130000",
                        "lon": 114.51106763052,
                        "lat": 36.637214815152
                    },
                    {
                        "label": "复兴区",
                        "value": "130404",
                        "cityCode": "130400",
                        "provinceCode": "130000",
                        "lon": 114.44809470749,
                        "lat": 36.610368592227
                    },
                    {
                        "label": "峰峰矿区",
                        "value": "130406",
                        "cityCode": "130400",
                        "provinceCode": "130000",
                        "lon": 114.19042164993,
                        "lat": 36.474684997423
                    },
                    {
                        "label": "临漳县",
                        "value": "130423",
                        "cityCode": "130400",
                        "provinceCode": "130000",
                        "lon": 114.58694416944,
                        "lat": 36.266141946474
                    },
                    {
                        "label": "成安县",
                        "value": "130424",
                        "cityCode": "130400",
                        "provinceCode": "130000",
                        "lon": 114.70477468285,
                        "lat": 36.428150647186
                    },
                    {
                        "label": "大名县",
                        "value": "130425",
                        "cityCode": "130400",
                        "provinceCode": "130000",
                        "lon": 115.24863464404,
                        "lat": 36.309543770756
                    },
                    {
                        "label": "涉县",
                        "value": "130426",
                        "cityCode": "130400",
                        "provinceCode": "130000",
                        "lon": 113.74291352234,
                        "lat": 36.598104535573
                    },
                    {
                        "label": "磁县",
                        "value": "130427",
                        "cityCode": "130400",
                        "provinceCode": "130000",
                        "lon": 114.25510074085,
                        "lat": 36.406730602547
                    },
                    {
                        "label": "邱县",
                        "value": "130430",
                        "cityCode": "130400",
                        "provinceCode": "130000",
                        "lon": 115.20670231619,
                        "lat": 36.797269787143
                    },
                    {
                        "label": "鸡泽县",
                        "value": "130431",
                        "cityCode": "130400",
                        "provinceCode": "130000",
                        "lon": 114.86956581384,
                        "lat": 36.873677489817
                    },
                    {
                        "label": "广平县",
                        "value": "130432",
                        "cityCode": "130400",
                        "provinceCode": "130000",
                        "lon": 115.02087402114,
                        "lat": 36.51192631393
                    },
                    {
                        "label": "馆陶县",
                        "value": "130433",
                        "cityCode": "130400",
                        "provinceCode": "130000",
                        "lon": 115.29915662582,
                        "lat": 36.618537005781
                    },
                    {
                        "label": "魏县",
                        "value": "130434",
                        "cityCode": "130400",
                        "provinceCode": "130000",
                        "lon": 114.93600011898,
                        "lat": 36.250567761095
                    },
                    {
                        "label": "曲周县",
                        "value": "130435",
                        "cityCode": "130400",
                        "provinceCode": "130000",
                        "lon": 115.03853247193,
                        "lat": 36.752651265719
                    },
                    {
                        "label": "武安市",
                        "value": "130481",
                        "cityCode": "130400",
                        "provinceCode": "130000",
                        "lon": 114.05833396936,
                        "lat": 36.748995476597
                    }
                ]
            },
            {
                "label": "邢台市",
                "value": "130500",
                "provinceCode": "130000",
                "lon": 114.52048681294,
                "lat": 37.069531196912,
                "children": [
                    {
                        "label": "桥东区",
                        "value": "130502",
                        "cityCode": "130500",
                        "provinceCode": "130000",
                        "lon": 114.52129744384,
                        "lat": 37.059046252073
                    },
                    {
                        "label": "桥西区",
                        "value": "130503",
                        "cityCode": "130500",
                        "provinceCode": "130000",
                        "lon": 114.43813995532,
                        "lat": 38.033364550068
                    },
                    {
                        "label": "邢台县",
                        "value": "130521",
                        "cityCode": "130500",
                        "provinceCode": "130000",
                        "lon": 114.16774440241,
                        "lat": 37.152421699275
                    },
                    {
                        "label": "临城县",
                        "value": "130522",
                        "cityCode": "130500",
                        "provinceCode": "130000",
                        "lon": 114.38466503755,
                        "lat": 37.463137591617
                    },
                    {
                        "label": "内丘县",
                        "value": "130523",
                        "cityCode": "130500",
                        "provinceCode": "130000",
                        "lon": 114.30459575437,
                        "lat": 37.314224311167
                    },
                    {
                        "label": "柏乡县",
                        "value": "130524",
                        "cityCode": "130500",
                        "provinceCode": "130000",
                        "lon": 114.70742434434,
                        "lat": 37.517418414338
                    },
                    {
                        "label": "隆尧县",
                        "value": "130525",
                        "cityCode": "130500",
                        "provinceCode": "130000",
                        "lon": 114.79291584707,
                        "lat": 37.36468808358
                    },
                    {
                        "label": "任县",
                        "value": "130526",
                        "cityCode": "130500",
                        "provinceCode": "130000",
                        "lon": 114.7699671597,
                        "lat": 37.174630101755
                    },
                    {
                        "label": "南和县",
                        "value": "130527",
                        "cityCode": "130500",
                        "provinceCode": "130000",
                        "lon": 114.75308935883,
                        "lat": 37.016963874379
                    },
                    {
                        "label": "宁晋县",
                        "value": "130528",
                        "cityCode": "130500",
                        "provinceCode": "130000",
                        "lon": 115.02167843721,
                        "lat": 37.612086758173
                    },
                    {
                        "label": "巨鹿县",
                        "value": "130529",
                        "cityCode": "130500",
                        "provinceCode": "130000",
                        "lon": 115.05888578855,
                        "lat": 37.278679297084
                    },
                    {
                        "label": "新河县",
                        "value": "130530",
                        "cityCode": "130500",
                        "provinceCode": "130000",
                        "lon": 115.25720361984,
                        "lat": 37.499362567334
                    },
                    {
                        "label": "广宗县",
                        "value": "130531",
                        "cityCode": "130500",
                        "provinceCode": "130000",
                        "lon": 115.19817308929,
                        "lat": 37.083548692406
                    },
                    {
                        "label": "平乡县",
                        "value": "130532",
                        "cityCode": "130500",
                        "provinceCode": "130000",
                        "lon": 115.00481854709,
                        "lat": 37.056110207564
                    },
                    {
                        "label": "威县",
                        "value": "130533",
                        "cityCode": "130500",
                        "provinceCode": "130000",
                        "lon": 115.38772530687,
                        "lat": 37.078394650565
                    },
                    {
                        "label": "清河县",
                        "value": "130534",
                        "cityCode": "130500",
                        "provinceCode": "130000",
                        "lon": 115.69158951605,
                        "lat": 37.040529913617
                    },
                    {
                        "label": "临西县",
                        "value": "130535",
                        "cityCode": "130500",
                        "provinceCode": "130000",
                        "lon": 115.52844117588,
                        "lat": 36.858027353556
                    },
                    {
                        "label": "南宫市",
                        "value": "130581",
                        "cityCode": "130500",
                        "provinceCode": "130000",
                        "lon": 115.47940958601,
                        "lat": 37.286427413275
                    },
                    {
                        "label": "沙河市",
                        "value": "130582",
                        "cityCode": "130500",
                        "provinceCode": "130000",
                        "lon": 114.28309250179,
                        "lat": 36.938635459346
                    }
                ]
            },
            {
                "label": "保定市",
                "value": "130600",
                "provinceCode": "130000",
                "lon": 115.49481016908,
                "lat": 38.886564548027,
                "children": [
                    {
                        "label": "竞秀区",
                        "value": "130602",
                        "cityCode": "130600",
                        "provinceCode": "130000",
                        "lon": 115.4337718341,
                        "lat": 38.896799171923
                    },
                    {
                        "label": "莲池区",
                        "value": "130606",
                        "cityCode": "130600",
                        "provinceCode": "130000",
                        "lon": 115.52517138526,
                        "lat": 38.878869183082
                    },
                    {
                        "label": "满城区",
                        "value": "130607",
                        "cityCode": "130600",
                        "provinceCode": "130000",
                        "lon": 115.22854614305,
                        "lat": 38.936509575446
                    },
                    {
                        "label": "清苑区",
                        "value": "130608",
                        "cityCode": "130600",
                        "provinceCode": "130000",
                        "lon": 115.50474549359,
                        "lat": 38.746793898598
                    },
                    {
                        "label": "徐水区",
                        "value": "130609",
                        "cityCode": "130600",
                        "provinceCode": "130000",
                        "lon": 115.56341421452,
                        "lat": 39.030072064834
                    },
                    {
                        "label": "涞水县",
                        "value": "130623",
                        "cityCode": "130600",
                        "provinceCode": "130000",
                        "lon": 115.44462792481,
                        "lat": 39.616117563205
                    },
                    {
                        "label": "阜平县",
                        "value": "130624",
                        "cityCode": "130600",
                        "provinceCode": "130000",
                        "lon": 114.16421062387,
                        "lat": 38.894806411217
                    },
                    {
                        "label": "定兴县",
                        "value": "130626",
                        "cityCode": "130600",
                        "provinceCode": "130000",
                        "lon": 115.75504588838,
                        "lat": 39.211518314259
                    },
                    {
                        "label": "唐县",
                        "value": "130627",
                        "cityCode": "130600",
                        "provinceCode": "130000",
                        "lon": 114.80609127315,
                        "lat": 38.904521131249
                    },
                    {
                        "label": "高阳县",
                        "value": "130628",
                        "cityCode": "130600",
                        "provinceCode": "130000",
                        "lon": 115.83844188387,
                        "lat": 38.673020900262
                    },
                    {
                        "label": "容城县",
                        "value": "130629",
                        "cityCode": "130600",
                        "provinceCode": "130000",
                        "lon": 115.90877891487,
                        "lat": 39.057813549536
                    },
                    {
                        "label": "涞源县",
                        "value": "130630",
                        "cityCode": "130600",
                        "provinceCode": "130000",
                        "lon": 114.73045121001,
                        "lat": 39.366936787031
                    },
                    {
                        "label": "望都县",
                        "value": "130631",
                        "cityCode": "130600",
                        "provinceCode": "130000",
                        "lon": 115.17834559654,
                        "lat": 38.679014979104
                    },
                    {
                        "label": "安新县",
                        "value": "130632",
                        "cityCode": "130600",
                        "provinceCode": "130000",
                        "lon": 115.88673101005,
                        "lat": 38.8782552166
                    },
                    {
                        "label": "易县",
                        "value": "130633",
                        "cityCode": "130600",
                        "provinceCode": "130000",
                        "lon": 115.25402170203,
                        "lat": 39.317566051144
                    },
                    {
                        "label": "曲阳县",
                        "value": "130634",
                        "cityCode": "130600",
                        "provinceCode": "130000",
                        "lon": 114.66066397519,
                        "lat": 38.706612214921
                    },
                    {
                        "label": "蠡县",
                        "value": "130635",
                        "cityCode": "130600",
                        "provinceCode": "130000",
                        "lon": 115.66928195753,
                        "lat": 38.528232136022
                    },
                    {
                        "label": "顺平县",
                        "value": "130636",
                        "cityCode": "130600",
                        "provinceCode": "130000",
                        "lon": 115.07398905469,
                        "lat": 38.927951375985
                    },
                    {
                        "label": "博野县",
                        "value": "130637",
                        "cityCode": "130600",
                        "provinceCode": "130000",
                        "lon": 115.48778569396,
                        "lat": 38.459123140672
                    },
                    {
                        "label": "雄县",
                        "value": "130638",
                        "cityCode": "130600",
                        "provinceCode": "130000",
                        "lon": 116.18329894846,
                        "lat": 39.042786858077
                    },
                    {
                        "label": "涿州市",
                        "value": "130681",
                        "cityCode": "130600",
                        "provinceCode": "130000",
                        "lon": 115.99905364071,
                        "lat": 39.482481810572
                    },
                    {
                        "label": "定州市",
                        "value": "130682",
                        "cityCode": "130600",
                        "provinceCode": "130000",
                        "lon": 115.05740695232,
                        "lat": 38.465839158048
                    },
                    {
                        "label": "安国市",
                        "value": "130683",
                        "cityCode": "130600",
                        "provinceCode": "130000",
                        "lon": 115.33482671534,
                        "lat": 38.393739990352
                    },
                    {
                        "label": "高碑店市",
                        "value": "130684",
                        "cityCode": "130600",
                        "provinceCode": "130000",
                        "lon": 116.04093362477,
                        "lat": 39.265087764832
                    }
                ]
            },
            {
                "label": "张家口市",
                "value": "130700",
                "provinceCode": "130000",
                "lon": 114.89378153033,
                "lat": 40.811188491103,
                "children": [
                    {
                        "label": "桥东区",
                        "value": "130702",
                        "cityCode": "130700",
                        "provinceCode": "130000",
                        "lon": 114.52129744384,
                        "lat": 37.059046252073
                    },
                    {
                        "label": "桥西区",
                        "value": "130703",
                        "cityCode": "130700",
                        "provinceCode": "130000",
                        "lon": 114.43813995532,
                        "lat": 38.033364550068
                    },
                    {
                        "label": "宣化区",
                        "value": "130705",
                        "cityCode": "130700",
                        "provinceCode": "130000",
                        "lon": 115.25847218771,
                        "lat": 40.632394360149
                    },
                    {
                        "label": "下花园区",
                        "value": "130706",
                        "cityCode": "130700",
                        "provinceCode": "130000",
                        "lon": 115.35049833098,
                        "lat": 40.568836928653
                    },
                    {
                        "label": "万全区",
                        "value": "130708",
                        "cityCode": "130700",
                        "provinceCode": "130000",
                        "lon": 114.60159442219,
                        "lat": 40.854322579125
                    },
                    {
                        "label": "崇礼区",
                        "value": "130709",
                        "cityCode": "130700",
                        "provinceCode": "130000",
                        "lon": 115.18918281511,
                        "lat": 41.041738952718
                    },
                    {
                        "label": "张北县",
                        "value": "130722",
                        "cityCode": "130700",
                        "provinceCode": "130000",
                        "lon": 114.77289736584,
                        "lat": 41.293640752346
                    },
                    {
                        "label": "康保县",
                        "value": "130723",
                        "cityCode": "130700",
                        "provinceCode": "130000",
                        "lon": 114.60653573475,
                        "lat": 41.784595269099
                    },
                    {
                        "label": "沽源县",
                        "value": "130724",
                        "cityCode": "130700",
                        "provinceCode": "130000",
                        "lon": 115.63609164922,
                        "lat": 41.580403842568
                    },
                    {
                        "label": "尚义县",
                        "value": "130725",
                        "cityCode": "130700",
                        "provinceCode": "130000",
                        "lon": 114.15252831523,
                        "lat": 41.132634994489
                    },
                    {
                        "label": "蔚县",
                        "value": "130726",
                        "cityCode": "130700",
                        "provinceCode": "130000",
                        "lon": 114.71253718704,
                        "lat": 39.879353147831
                    },
                    {
                        "label": "阳原县",
                        "value": "130727",
                        "cityCode": "130700",
                        "provinceCode": "130000",
                        "lon": 114.39439590667,
                        "lat": 40.138642120211
                    },
                    {
                        "label": "怀安县",
                        "value": "130728",
                        "cityCode": "130700",
                        "provinceCode": "130000",
                        "lon": 114.50260736695,
                        "lat": 40.559533575131
                    },
                    {
                        "label": "怀来县",
                        "value": "130730",
                        "cityCode": "130700",
                        "provinceCode": "130000",
                        "lon": 115.63406061974,
                        "lat": 40.34798364385
                    },
                    {
                        "label": "涿鹿县",
                        "value": "130731",
                        "cityCode": "130700",
                        "provinceCode": "130000",
                        "lon": 115.22392517513,
                        "lat": 40.101875913481
                    },
                    {
                        "label": "赤城县",
                        "value": "130732",
                        "cityCode": "130700",
                        "provinceCode": "130000",
                        "lon": 115.89222267195,
                        "lat": 40.956026259537
                    }
                ]
            },
            {
                "label": "承德市",
                "value": "130800",
                "provinceCode": "130000",
                "lon": 117.93382245584,
                "lat": 40.992521052457,
                "children": [
                    {
                        "label": "双桥区",
                        "value": "130802",
                        "cityCode": "130800",
                        "provinceCode": "130000",
                        "lon": 117.94835524238,
                        "lat": 40.971406352197
                    },
                    {
                        "label": "双滦区",
                        "value": "130803",
                        "cityCode": "130800",
                        "provinceCode": "130000",
                        "lon": 117.80933581725,
                        "lat": 41.051453160703
                    },
                    {
                        "label": "鹰手营子矿区",
                        "value": "130804",
                        "cityCode": "130800",
                        "provinceCode": "130000",
                        "lon": 117.67942626427,
                        "lat": 40.531760281234
                    },
                    {
                        "label": "承德县",
                        "value": "130821",
                        "cityCode": "130800",
                        "provinceCode": "130000",
                        "lon": 118.12571829805,
                        "lat": 40.9732421823
                    },
                    {
                        "label": "兴隆县",
                        "value": "130822",
                        "cityCode": "130800",
                        "provinceCode": "130000",
                        "lon": 117.72613599005,
                        "lat": 40.458141686295
                    },
                    {
                        "label": "滦平县",
                        "value": "130824",
                        "cityCode": "130800",
                        "provinceCode": "130000",
                        "lon": 117.36956340989,
                        "lat": 40.924820741761
                    },
                    {
                        "label": "隆化县",
                        "value": "130825",
                        "cityCode": "130800",
                        "provinceCode": "130000",
                        "lon": 117.56992967905,
                        "lat": 41.517994972231
                    },
                    {
                        "label": "丰宁满族自治县",
                        "value": "130826",
                        "cityCode": "130800",
                        "provinceCode": "130000",
                        "lon": 116.62379481268,
                        "lat": 41.425684335184
                    },
                    {
                        "label": "宽城满族自治县",
                        "value": "130827",
                        "cityCode": "130800",
                        "provinceCode": "130000",
                        "lon": 118.63588822017,
                        "lat": 40.578090378096
                    },
                    {
                        "label": "围场满族蒙古族自治县",
                        "value": "130828",
                        "cityCode": "130800",
                        "provinceCode": "130000",
                        "lon": 117.54702150524,
                        "lat": 42.108024565862
                    }
                ]
            },
            {
                "label": "沧州市",
                "value": "130900",
                "provinceCode": "130000",
                "lon": 116.86380647644,
                "lat": 38.297615350326,
                "children": [
                    {
                        "label": "新华区",
                        "value": "130902",
                        "cityCode": "130900",
                        "provinceCode": "130000",
                        "lon": 114.45350142869,
                        "lat": 38.117218640478
                    },
                    {
                        "label": "运河区",
                        "value": "130903",
                        "cityCode": "130900",
                        "provinceCode": "130000",
                        "lon": 116.84485357764,
                        "lat": 38.314446124596
                    },
                    {
                        "label": "沧县",
                        "value": "130921",
                        "cityCode": "130900",
                        "provinceCode": "130000",
                        "lon": 116.86271383128,
                        "lat": 38.302138696207
                    },
                    {
                        "label": "青县",
                        "value": "130922",
                        "cityCode": "130900",
                        "provinceCode": "130000",
                        "lon": 116.85123400252,
                        "lat": 38.565778328556
                    },
                    {
                        "label": "东光县",
                        "value": "130923",
                        "cityCode": "130900",
                        "provinceCode": "130000",
                        "lon": 116.67783233648,
                        "lat": 37.887451603688
                    },
                    {
                        "label": "海兴县",
                        "value": "130924",
                        "cityCode": "130900",
                        "provinceCode": "130000",
                        "lon": 117.56726425888,
                        "lat": 38.142470216907
                    },
                    {
                        "label": "盐山县",
                        "value": "130925",
                        "cityCode": "130900",
                        "provinceCode": "130000",
                        "lon": 117.26693989632,
                        "lat": 37.960369724102
                    },
                    {
                        "label": "肃宁县",
                        "value": "130926",
                        "cityCode": "130900",
                        "provinceCode": "130000",
                        "lon": 115.88581610558,
                        "lat": 38.422207122829
                    },
                    {
                        "label": "南皮县",
                        "value": "130927",
                        "cityCode": "130900",
                        "provinceCode": "130000",
                        "lon": 116.8658497774,
                        "lat": 38.023185702825
                    },
                    {
                        "label": "吴桥县",
                        "value": "130928",
                        "cityCode": "130900",
                        "provinceCode": "130000",
                        "lon": 116.5080334073,
                        "lat": 37.661863472094
                    },
                    {
                        "label": "献县",
                        "value": "130929",
                        "cityCode": "130900",
                        "provinceCode": "130000",
                        "lon": 116.17550530237,
                        "lat": 38.242725840471
                    },
                    {
                        "label": "孟村回族自治县",
                        "value": "130930",
                        "cityCode": "130900",
                        "provinceCode": "130000",
                        "lon": 117.15953838544,
                        "lat": 38.091264713342
                    },
                    {
                        "label": "泊头市",
                        "value": "130981",
                        "cityCode": "130900",
                        "provinceCode": "130000",
                        "lon": 116.38923597745,
                        "lat": 38.090278710884
                    },
                    {
                        "label": "任丘市",
                        "value": "130982",
                        "cityCode": "130900",
                        "provinceCode": "130000",
                        "lon": 116.16321405193,
                        "lat": 38.74110464111
                    },
                    {
                        "label": "黄骅市",
                        "value": "130983",
                        "cityCode": "130900",
                        "provinceCode": "130000",
                        "lon": 117.40021701974,
                        "lat": 38.401521845487
                    },
                    {
                        "label": "河间市",
                        "value": "130984",
                        "cityCode": "130900",
                        "provinceCode": "130000",
                        "lon": 116.27159283893,
                        "lat": 38.483721432479
                    }
                ]
            },
            {
                "label": "廊坊市",
                "value": "131000",
                "provinceCode": "130000",
                "lon": 116.70360222264,
                "lat": 39.518610625085,
                "children": [
                    {
                        "label": "安次区",
                        "value": "131002",
                        "cityCode": "131000",
                        "provinceCode": "130000",
                        "lon": 116.79612310881,
                        "lat": 39.345312180639
                    },
                    {
                        "label": "广阳区",
                        "value": "131003",
                        "cityCode": "131000",
                        "provinceCode": "130000",
                        "lon": 116.69423648939,
                        "lat": 39.533685537455
                    },
                    {
                        "label": "固安县",
                        "value": "131022",
                        "cityCode": "131000",
                        "provinceCode": "130000",
                        "lon": 116.28967015726,
                        "lat": 39.351105940994
                    },
                    {
                        "label": "永清县",
                        "value": "131023",
                        "cityCode": "131000",
                        "provinceCode": "130000",
                        "lon": 116.5605569701,
                        "lat": 39.302836430211
                    },
                    {
                        "label": "香河县",
                        "value": "131024",
                        "cityCode": "131000",
                        "provinceCode": "130000",
                        "lon": 117.05130555355,
                        "lat": 39.743100032865
                    },
                    {
                        "label": "大城县",
                        "value": "131025",
                        "cityCode": "131000",
                        "provinceCode": "130000",
                        "lon": 116.58863867606,
                        "lat": 38.668802703656
                    },
                    {
                        "label": "文安县",
                        "value": "131026",
                        "cityCode": "131000",
                        "provinceCode": "130000",
                        "lon": 116.49481687118,
                        "lat": 38.911390482572
                    },
                    {
                        "label": "大厂回族自治县",
                        "value": "131028",
                        "cityCode": "131000",
                        "provinceCode": "130000",
                        "lon": 116.95507644864,
                        "lat": 39.89531635509
                    },
                    {
                        "label": "霸州市",
                        "value": "131081",
                        "cityCode": "131000",
                        "provinceCode": "130000",
                        "lon": 116.57430598976,
                        "lat": 39.109320079055
                    },
                    {
                        "label": "三河市",
                        "value": "131082",
                        "cityCode": "131000",
                        "provinceCode": "130000",
                        "lon": 117.02128418409,
                        "lat": 39.96742764877
                    }
                ]
            },
            {
                "label": "衡水市",
                "value": "131100",
                "provinceCode": "130000",
                "lon": 115.68622865291,
                "lat": 37.746929045857,
                "children": [
                    {
                        "label": "桃城区",
                        "value": "131102",
                        "cityCode": "131100",
                        "provinceCode": "130000",
                        "lon": 115.66665700012,
                        "lat": 37.72421788608
                    },
                    {
                        "label": "冀州区",
                        "value": "131103",
                        "cityCode": "131100",
                        "provinceCode": "130000",
                        "lon": 115.44750567041,
                        "lat": 37.53643502058
                    },
                    {
                        "label": "枣强县",
                        "value": "131121",
                        "cityCode": "131100",
                        "provinceCode": "130000",
                        "lon": 115.75767748261,
                        "lat": 37.461024106054
                    },
                    {
                        "label": "武邑县",
                        "value": "131122",
                        "cityCode": "131100",
                        "provinceCode": "130000",
                        "lon": 115.94450660708,
                        "lat": 37.827678592246
                    },
                    {
                        "label": "武强县",
                        "value": "131123",
                        "cityCode": "131100",
                        "provinceCode": "130000",
                        "lon": 115.920118282,
                        "lat": 38.050513034027
                    },
                    {
                        "label": "饶阳县",
                        "value": "131124",
                        "cityCode": "131100",
                        "provinceCode": "130000",
                        "lon": 115.74000746168,
                        "lat": 38.223059241042
                    },
                    {
                        "label": "安平县",
                        "value": "131125",
                        "cityCode": "131100",
                        "provinceCode": "130000",
                        "lon": 115.49041582246,
                        "lat": 38.243195869487
                    },
                    {
                        "label": "故城县",
                        "value": "131126",
                        "cityCode": "131100",
                        "provinceCode": "130000",
                        "lon": 115.97805666289,
                        "lat": 37.356997906367
                    },
                    {
                        "label": "景县",
                        "value": "131127",
                        "cityCode": "131100",
                        "provinceCode": "130000",
                        "lon": 116.20013356506,
                        "lat": 37.668477471141
                    },
                    {
                        "label": "阜城县",
                        "value": "131128",
                        "cityCode": "131100",
                        "provinceCode": "130000",
                        "lon": 116.32842518537,
                        "lat": 37.912309213617
                    },
                    {
                        "label": "深州市",
                        "value": "131182",
                        "cityCode": "131100",
                        "provinceCode": "130000",
                        "lon": 115.58669880842,
                        "lat": 37.957012862702
                    }
                ]
            }
        ],
        "label": "河北省",
        "value": "130000"
    },
    {
        "country": "china",
        "lon": 112.51549586384,
        "lat": 37.866565990509,
        "children": [
            {
                "label": "太原市",
                "value": "140100",
                "provinceCode": "140000",
                "lon": 112.55086358906,
                "lat": 37.890277053968,
                "children": [
                    {
                        "label": "小店区",
                        "value": "140105",
                        "cityCode": "140100",
                        "provinceCode": "140000",
                        "lon": 112.57740860671,
                        "lat": 37.753527970896
                    },
                    {
                        "label": "迎泽区",
                        "value": "140106",
                        "cityCode": "140100",
                        "provinceCode": "140000",
                        "lon": 112.66320298122,
                        "lat": 37.865737302061
                    },
                    {
                        "label": "杏花岭区",
                        "value": "140107",
                        "cityCode": "140100",
                        "provinceCode": "140000",
                        "lon": 112.62983632135,
                        "lat": 37.915556056965
                    },
                    {
                        "label": "尖草坪区",
                        "value": "140108",
                        "cityCode": "140100",
                        "provinceCode": "140000",
                        "lon": 112.48843997984,
                        "lat": 37.972757839535
                    },
                    {
                        "label": "万柏林区",
                        "value": "140109",
                        "cityCode": "140100",
                        "provinceCode": "140000",
                        "lon": 112.40285697662,
                        "lat": 37.894693447581
                    },
                    {
                        "label": "晋源区",
                        "value": "140110",
                        "cityCode": "140100",
                        "provinceCode": "140000",
                        "lon": 112.48158725626,
                        "lat": 37.748674917003
                    },
                    {
                        "label": "清徐县",
                        "value": "140121",
                        "cityCode": "140100",
                        "provinceCode": "140000",
                        "lon": 112.38708511797,
                        "lat": 37.59324244737
                    },
                    {
                        "label": "阳曲县",
                        "value": "140122",
                        "cityCode": "140100",
                        "provinceCode": "140000",
                        "lon": 112.67265853687,
                        "lat": 38.158246373698
                    },
                    {
                        "label": "娄烦县",
                        "value": "140123",
                        "cityCode": "140100",
                        "provinceCode": "140000",
                        "lon": 111.797820928,
                        "lat": 38.034584043133
                    },
                    {
                        "label": "古交市",
                        "value": "140181",
                        "cityCode": "140100",
                        "provinceCode": "140000",
                        "lon": 112.1077390237,
                        "lat": 37.90517928255
                    }
                ]
            },
            {
                "label": "大同市",
                "value": "140200",
                "provinceCode": "140000",
                "lon": 113.29050867308,
                "lat": 40.113744499705,
                "children": [
                    {
                        "label": "新荣区",
                        "value": "140212",
                        "cityCode": "140200",
                        "provinceCode": "140000",
                        "lon": 113.23689411719,
                        "lat": 40.267127127574
                    },
                    {
                        "label": "阳高县",
                        "value": "140221",
                        "cityCode": "140200",
                        "provinceCode": "140000",
                        "lon": 113.82318140606,
                        "lat": 40.222311526135
                    },
                    {
                        "label": "天镇县",
                        "value": "140222",
                        "cityCode": "140200",
                        "provinceCode": "140000",
                        "lon": 114.16812988719,
                        "lat": 40.403528534338
                    },
                    {
                        "label": "广灵县",
                        "value": "140223",
                        "cityCode": "140200",
                        "provinceCode": "140000",
                        "lon": 114.16170176527,
                        "lat": 39.76899447952
                    },
                    {
                        "label": "灵丘县",
                        "value": "140224",
                        "cityCode": "140200",
                        "provinceCode": "140000",
                        "lon": 114.21309517425,
                        "lat": 39.377267777348
                    },
                    {
                        "label": "浑源县",
                        "value": "140225",
                        "cityCode": "140200",
                        "provinceCode": "140000",
                        "lon": 113.71075899599,
                        "lat": 39.634162361299
                    },
                    {
                        "label": "左云县",
                        "value": "140226",
                        "cityCode": "140200",
                        "provinceCode": "140000",
                        "lon": 112.77785639076,
                        "lat": 40.000737963069
                    }
                ]
            },
            {
                "label": "阳泉市",
                "value": "140300",
                "provinceCode": "140000",
                "lon": 113.56923760163,
                "lat": 37.869529493223,
                "children": [
                    {
                        "label": "城区",
                        "value": "140302",
                        "cityCode": "140300",
                        "provinceCode": "140000",
                        "lon": 113.29696587275,
                        "lat": 40.102542866559
                    },
                    {
                        "label": "矿区",
                        "value": "140303",
                        "cityCode": "140300",
                        "provinceCode": "140000",
                        "lon": 113.0470017583,
                        "lat": 40.036495634995
                    },
                    {
                        "label": "郊区",
                        "value": "140311",
                        "cityCode": "140300",
                        "provinceCode": "140000",
                        "lon": 113.56808615363,
                        "lat": 37.911503911114
                    },
                    {
                        "label": "平定县",
                        "value": "140321",
                        "cityCode": "140300",
                        "provinceCode": "140000",
                        "lon": 113.76897794042,
                        "lat": 37.8492714173
                    },
                    {
                        "label": "盂县",
                        "value": "140322",
                        "cityCode": "140300",
                        "provinceCode": "140000",
                        "lon": 113.36096660369,
                        "lat": 38.229385734147
                    }
                ]
            },
            {
                "label": "长治市",
                "value": "140400",
                "provinceCode": "140000",
                "lon": 113.12029208573,
                "lat": 36.201664385743,
                "children": [
                    {
                        "label": "襄垣县",
                        "value": "140423",
                        "cityCode": "140400",
                        "provinceCode": "140000",
                        "lon": 112.98897348398,
                        "lat": 36.580200785754
                    },
                    {
                        "label": "平顺县",
                        "value": "140425",
                        "cityCode": "140400",
                        "provinceCode": "140000",
                        "lon": 113.53368897635,
                        "lat": 36.221794153091
                    },
                    {
                        "label": "黎城县",
                        "value": "140426",
                        "cityCode": "140400",
                        "provinceCode": "140000",
                        "lon": 113.39685159379,
                        "lat": 36.619367610278
                    },
                    {
                        "label": "壶关县",
                        "value": "140427",
                        "cityCode": "140400",
                        "provinceCode": "140000",
                        "lon": 113.37199790438,
                        "lat": 35.99265193372
                    },
                    {
                        "label": "长子县",
                        "value": "140428",
                        "cityCode": "140400",
                        "provinceCode": "140000",
                        "lon": 112.80225403294,
                        "lat": 36.110999402019
                    },
                    {
                        "label": "武乡县",
                        "value": "140429",
                        "cityCode": "140400",
                        "provinceCode": "140000",
                        "lon": 112.96751985958,
                        "lat": 36.888322821209
                    },
                    {
                        "label": "沁县",
                        "value": "140430",
                        "cityCode": "140400",
                        "provinceCode": "140000",
                        "lon": 112.65221013617,
                        "lat": 36.70738347605
                    },
                    {
                        "label": "沁源县",
                        "value": "140431",
                        "cityCode": "140400",
                        "provinceCode": "140000",
                        "lon": 112.29009399197,
                        "lat": 36.701566639488
                    }
                ]
            },
            {
                "label": "晋城市",
                "value": "140500",
                "provinceCode": "140000",
                "lon": 112.86733275751,
                "lat": 35.499834467226,
                "children": [
                    {
                        "label": "城区",
                        "value": "140502",
                        "cityCode": "140500",
                        "provinceCode": "140000",
                        "lon": 113.29696587275,
                        "lat": 40.102542866559
                    },
                    {
                        "label": "沁水县",
                        "value": "140521",
                        "cityCode": "140500",
                        "provinceCode": "140000",
                        "lon": 112.37742990987,
                        "lat": 35.751489118151
                    },
                    {
                        "label": "阳城县",
                        "value": "140522",
                        "cityCode": "140500",
                        "provinceCode": "140000",
                        "lon": 112.36152699508,
                        "lat": 35.426540841161
                    },
                    {
                        "label": "陵川县",
                        "value": "140524",
                        "cityCode": "140500",
                        "provinceCode": "140000",
                        "lon": 113.34338659863,
                        "lat": 35.690743897919
                    },
                    {
                        "label": "泽州县",
                        "value": "140525",
                        "cityCode": "140500",
                        "provinceCode": "140000",
                        "lon": 112.87098535033,
                        "lat": 35.475851325496
                    },
                    {
                        "label": "高平市",
                        "value": "140581",
                        "cityCode": "140500",
                        "provinceCode": "140000",
                        "lon": 112.93511535362,
                        "lat": 35.809742457991
                    }
                ]
            },
            {
                "label": "朔州市",
                "value": "140600",
                "provinceCode": "140000",
                "lon": 112.47992772666,
                "lat": 39.337671966221,
                "children": [
                    {
                        "label": "朔城区",
                        "value": "140602",
                        "cityCode": "140600",
                        "provinceCode": "140000",
                        "lon": 112.5562001526,
                        "lat": 39.243272437238
                    },
                    {
                        "label": "平鲁区",
                        "value": "140603",
                        "cityCode": "140600",
                        "provinceCode": "140000",
                        "lon": 112.30434987236,
                        "lat": 39.640007394398
                    },
                    {
                        "label": "山阴县",
                        "value": "140621",
                        "cityCode": "140600",
                        "provinceCode": "140000",
                        "lon": 112.78680490549,
                        "lat": 39.521049673137
                    },
                    {
                        "label": "应县",
                        "value": "140622",
                        "cityCode": "140600",
                        "provinceCode": "140000",
                        "lon": 113.26059286958,
                        "lat": 39.509316043686
                    },
                    {
                        "label": "右玉县",
                        "value": "140623",
                        "cityCode": "140600",
                        "provinceCode": "140000",
                        "lon": 112.42167745341,
                        "lat": 40.008135706467
                    }
                ]
            },
            {
                "label": "晋中市",
                "value": "140700",
                "provinceCode": "140000",
                "lon": 112.73851439992,
                "lat": 37.693361526798,
                "children": [
                    {
                        "label": "榆次区",
                        "value": "140702",
                        "cityCode": "140700",
                        "provinceCode": "140000",
                        "lon": 112.84373652716,
                        "lat": 37.650824689054
                    },
                    {
                        "label": "榆社县",
                        "value": "140721",
                        "cityCode": "140700",
                        "provinceCode": "140000",
                        "lon": 112.95418082333,
                        "lat": 37.140049981591
                    },
                    {
                        "label": "左权县",
                        "value": "140722",
                        "cityCode": "140700",
                        "provinceCode": "140000",
                        "lon": 113.47453786444,
                        "lat": 37.03279458538
                    },
                    {
                        "label": "和顺县",
                        "value": "140723",
                        "cityCode": "140700",
                        "provinceCode": "140000",
                        "lon": 113.47493445138,
                        "lat": 37.348373699108
                    },
                    {
                        "label": "昔阳县",
                        "value": "140724",
                        "cityCode": "140700",
                        "provinceCode": "140000",
                        "lon": 113.76210572071,
                        "lat": 37.563418385072
                    },
                    {
                        "label": "寿阳县",
                        "value": "140725",
                        "cityCode": "140700",
                        "provinceCode": "140000",
                        "lon": 113.14161086395,
                        "lat": 37.825118914407
                    },
                    {
                        "label": "太谷县",
                        "value": "140726",
                        "cityCode": "140700",
                        "provinceCode": "140000",
                        "lon": 112.73643253249,
                        "lat": 37.407696414459
                    },
                    {
                        "label": "祁县",
                        "value": "140727",
                        "cityCode": "140700",
                        "provinceCode": "140000",
                        "lon": 112.46906595172,
                        "lat": 37.292198086629
                    },
                    {
                        "label": "平遥县",
                        "value": "140728",
                        "cityCode": "140700",
                        "provinceCode": "140000",
                        "lon": 112.26549326017,
                        "lat": 37.148089778462
                    },
                    {
                        "label": "灵石县",
                        "value": "140729",
                        "cityCode": "140700",
                        "provinceCode": "140000",
                        "lon": 111.73550355035,
                        "lat": 36.834487193362
                    },
                    {
                        "label": "介休市",
                        "value": "140781",
                        "cityCode": "140700",
                        "provinceCode": "140000",
                        "lon": 111.99518801957,
                        "lat": 37.02547627594
                    }
                ]
            },
            {
                "label": "运城市",
                "value": "140800",
                "provinceCode": "140000",
                "lon": 111.00685365308,
                "lat": 35.038859479812,
                "children": [
                    {
                        "label": "盐湖区",
                        "value": "140802",
                        "cityCode": "140800",
                        "provinceCode": "140000",
                        "lon": 110.96193094165,
                        "lat": 35.063676878932
                    },
                    {
                        "label": "临猗县",
                        "value": "140821",
                        "cityCode": "140800",
                        "provinceCode": "140000",
                        "lon": 110.62589540589,
                        "lat": 35.149379501121
                    },
                    {
                        "label": "万荣县",
                        "value": "140822",
                        "cityCode": "140800",
                        "provinceCode": "140000",
                        "lon": 110.71553950499,
                        "lat": 35.388134013652
                    },
                    {
                        "label": "闻喜县",
                        "value": "140823",
                        "cityCode": "140800",
                        "provinceCode": "140000",
                        "lon": 111.31928675078,
                        "lat": 35.373753157
                    },
                    {
                        "label": "稷山县",
                        "value": "140824",
                        "cityCode": "140800",
                        "provinceCode": "140000",
                        "lon": 110.96512183757,
                        "lat": 35.59826692411
                    },
                    {
                        "label": "新绛县",
                        "value": "140825",
                        "cityCode": "140800",
                        "provinceCode": "140000",
                        "lon": 111.17287529232,
                        "lat": 35.631582540507
                    },
                    {
                        "label": "绛县",
                        "value": "140826",
                        "cityCode": "140800",
                        "provinceCode": "140000",
                        "lon": 111.64482039841,
                        "lat": 35.498578532808
                    },
                    {
                        "label": "垣曲县",
                        "value": "140827",
                        "cityCode": "140800",
                        "provinceCode": "140000",
                        "lon": 111.82478688142,
                        "lat": 35.221584155393
                    },
                    {
                        "label": "夏县",
                        "value": "140828",
                        "cityCode": "140800",
                        "provinceCode": "140000",
                        "lon": 111.35838628885,
                        "lat": 35.126679510784
                    },
                    {
                        "label": "平陆县",
                        "value": "140829",
                        "cityCode": "140800",
                        "provinceCode": "140000",
                        "lon": 111.25110932094,
                        "lat": 34.888645774448
                    },
                    {
                        "label": "芮城县",
                        "value": "140830",
                        "cityCode": "140800",
                        "provinceCode": "140000",
                        "lon": 110.61649553806,
                        "lat": 34.709534760447
                    },
                    {
                        "label": "永济市",
                        "value": "140881",
                        "cityCode": "140800",
                        "provinceCode": "140000",
                        "lon": 110.48894872131,
                        "lat": 34.894671510755
                    },
                    {
                        "label": "河津市",
                        "value": "140882",
                        "cityCode": "140800",
                        "provinceCode": "140000",
                        "lon": 110.70853926353,
                        "lat": 35.631891049091
                    }
                ]
            },
            {
                "label": "忻州市",
                "value": "140900",
                "provinceCode": "140000",
                "lon": 112.72793882881,
                "lat": 38.461030572959,
                "children": [
                    {
                        "label": "忻府区",
                        "value": "140902",
                        "cityCode": "140900",
                        "provinceCode": "140000",
                        "lon": 112.60520013418,
                        "lat": 38.437831964453
                    },
                    {
                        "label": "定襄县",
                        "value": "140921",
                        "cityCode": "140900",
                        "provinceCode": "140000",
                        "lon": 113.03558876456,
                        "lat": 38.516749763878
                    },
                    {
                        "label": "五台县",
                        "value": "140922",
                        "cityCode": "140900",
                        "provinceCode": "140000",
                        "lon": 113.44210404535,
                        "lat": 38.778174001492
                    },
                    {
                        "label": "代县",
                        "value": "140923",
                        "cityCode": "140900",
                        "provinceCode": "140000",
                        "lon": 113.05058168825,
                        "lat": 39.093197224067
                    },
                    {
                        "label": "繁峙县",
                        "value": "140924",
                        "cityCode": "140900",
                        "provinceCode": "140000",
                        "lon": 113.596213567,
                        "lat": 39.204756994709
                    },
                    {
                        "label": "宁武县",
                        "value": "140925",
                        "cityCode": "140900",
                        "provinceCode": "140000",
                        "lon": 112.19389583349,
                        "lat": 38.821889666345
                    },
                    {
                        "label": "静乐县",
                        "value": "140926",
                        "cityCode": "140900",
                        "provinceCode": "140000",
                        "lon": 112.06499425223,
                        "lat": 38.400067154102
                    },
                    {
                        "label": "神池县",
                        "value": "140927",
                        "cityCode": "140900",
                        "provinceCode": "140000",
                        "lon": 112.00991986754,
                        "lat": 39.173053445654
                    },
                    {
                        "label": "五寨县",
                        "value": "140928",
                        "cityCode": "140900",
                        "provinceCode": "140000",
                        "lon": 111.74475714392,
                        "lat": 39.008730857984
                    },
                    {
                        "label": "岢岚县",
                        "value": "140929",
                        "cityCode": "140900",
                        "provinceCode": "140000",
                        "lon": 111.54356839151,
                        "lat": 38.73795692606
                    },
                    {
                        "label": "河曲县",
                        "value": "140930",
                        "cityCode": "140900",
                        "provinceCode": "140000",
                        "lon": 111.3598292601,
                        "lat": 39.206439528631
                    },
                    {
                        "label": "保德县",
                        "value": "140931",
                        "cityCode": "140900",
                        "provinceCode": "140000",
                        "lon": 111.14283481361,
                        "lat": 38.887135247044
                    },
                    {
                        "label": "偏关县",
                        "value": "140932",
                        "cityCode": "140900",
                        "provinceCode": "140000",
                        "lon": 111.67190327635,
                        "lat": 39.464649232881
                    },
                    {
                        "label": "原平市",
                        "value": "140981",
                        "cityCode": "140900",
                        "provinceCode": "140000",
                        "lon": 112.68212831914,
                        "lat": 38.838876172747
                    }
                ]
            },
            {
                "label": "临汾市",
                "value": "141000",
                "provinceCode": "140000",
                "lon": 111.53878759641,
                "lat": 36.099745443585,
                "children": [
                    {
                        "label": "尧都区",
                        "value": "141002",
                        "cityCode": "141000",
                        "provinceCode": "140000",
                        "lon": 111.47466486211,
                        "lat": 36.125936912419
                    },
                    {
                        "label": "曲沃县",
                        "value": "141021",
                        "cityCode": "141000",
                        "provinceCode": "140000",
                        "lon": 111.52704105623,
                        "lat": 35.704200978944
                    },
                    {
                        "label": "翼城县",
                        "value": "141022",
                        "cityCode": "141000",
                        "provinceCode": "140000",
                        "lon": 111.83920947478,
                        "lat": 35.695397582179
                    },
                    {
                        "label": "襄汾县",
                        "value": "141023",
                        "cityCode": "141000",
                        "provinceCode": "140000",
                        "lon": 111.38595309536,
                        "lat": 35.874204029953
                    },
                    {
                        "label": "洪洞县",
                        "value": "141024",
                        "cityCode": "141000",
                        "provinceCode": "140000",
                        "lon": 111.65937789135,
                        "lat": 36.325514180326
                    },
                    {
                        "label": "古县",
                        "value": "141025",
                        "cityCode": "141000",
                        "provinceCode": "140000",
                        "lon": 112.01124254119,
                        "lat": 36.303822531038
                    },
                    {
                        "label": "安泽县",
                        "value": "141026",
                        "cityCode": "141000",
                        "provinceCode": "140000",
                        "lon": 112.30790366347,
                        "lat": 36.164295531066
                    },
                    {
                        "label": "浮山县",
                        "value": "141027",
                        "cityCode": "141000",
                        "provinceCode": "140000",
                        "lon": 111.92840887398,
                        "lat": 35.945830766006
                    },
                    {
                        "label": "吉县",
                        "value": "141028",
                        "cityCode": "141000",
                        "provinceCode": "140000",
                        "lon": 110.7281619704,
                        "lat": 36.158677317484
                    },
                    {
                        "label": "乡宁县",
                        "value": "141029",
                        "cityCode": "141000",
                        "provinceCode": "140000",
                        "lon": 110.94412841404,
                        "lat": 35.925119179378
                    },
                    {
                        "label": "大宁县",
                        "value": "141030",
                        "cityCode": "141000",
                        "provinceCode": "140000",
                        "lon": 110.71080544253,
                        "lat": 36.432636300532
                    },
                    {
                        "label": "隰县",
                        "value": "141031",
                        "cityCode": "141000",
                        "provinceCode": "140000",
                        "lon": 111.00996531617,
                        "lat": 36.711950508392
                    },
                    {
                        "label": "永和县",
                        "value": "141032",
                        "cityCode": "141000",
                        "provinceCode": "140000",
                        "lon": 110.61789818355,
                        "lat": 36.737137367462
                    },
                    {
                        "label": "蒲县",
                        "value": "141033",
                        "cityCode": "141000",
                        "provinceCode": "140000",
                        "lon": 111.16235867375,
                        "lat": 36.424599698879
                    },
                    {
                        "label": "汾西县",
                        "value": "141034",
                        "cityCode": "141000",
                        "provinceCode": "140000",
                        "lon": 111.48314834543,
                        "lat": 36.642781389504
                    },
                    {
                        "label": "侯马市",
                        "value": "141081",
                        "cityCode": "141000",
                        "provinceCode": "140000",
                        "lon": 111.37150924676,
                        "lat": 35.62178548788
                    },
                    {
                        "label": "霍州市",
                        "value": "141082",
                        "cityCode": "141000",
                        "provinceCode": "140000",
                        "lon": 111.8308356262,
                        "lat": 36.599677829115
                    }
                ]
            },
            {
                "label": "吕梁市",
                "value": "141100",
                "provinceCode": "140000",
                "lon": 111.14315660235,
                "lat": 37.527316096963,
                "children": [
                    {
                        "label": "离石区",
                        "value": "141102",
                        "cityCode": "141100",
                        "provinceCode": "140000",
                        "lon": 111.31314199347,
                        "lat": 37.552339254903
                    },
                    {
                        "label": "文水县",
                        "value": "141121",
                        "cityCode": "141100",
                        "provinceCode": "140000",
                        "lon": 111.96499464978,
                        "lat": 37.459705909704
                    },
                    {
                        "label": "交城县",
                        "value": "141122",
                        "cityCode": "141100",
                        "provinceCode": "140000",
                        "lon": 111.81992715422,
                        "lat": 37.68704558482
                    },
                    {
                        "label": "兴县",
                        "value": "141123",
                        "cityCode": "141100",
                        "provinceCode": "140000",
                        "lon": 111.0693110824,
                        "lat": 38.392262583946
                    },
                    {
                        "label": "临县",
                        "value": "141124",
                        "cityCode": "141100",
                        "provinceCode": "140000",
                        "lon": 110.90114744504,
                        "lat": 37.962867394138
                    },
                    {
                        "label": "柳林县",
                        "value": "141125",
                        "cityCode": "141100",
                        "provinceCode": "140000",
                        "lon": 110.87692675415,
                        "lat": 37.403754146298
                    },
                    {
                        "label": "石楼县",
                        "value": "141126",
                        "cityCode": "141100",
                        "provinceCode": "140000",
                        "lon": 110.75347868183,
                        "lat": 37.035145108626
                    },
                    {
                        "label": "岚县",
                        "value": "141127",
                        "cityCode": "141100",
                        "provinceCode": "140000",
                        "lon": 111.60664055968,
                        "lat": 38.343813372012
                    },
                    {
                        "label": "方山县",
                        "value": "141128",
                        "cityCode": "141100",
                        "provinceCode": "140000",
                        "lon": 111.33797892211,
                        "lat": 37.886687741974
                    },
                    {
                        "label": "中阳县",
                        "value": "141129",
                        "cityCode": "141100",
                        "provinceCode": "140000",
                        "lon": 111.18590350772,
                        "lat": 37.266317510804
                    },
                    {
                        "label": "交口县",
                        "value": "141130",
                        "cityCode": "141100",
                        "provinceCode": "140000",
                        "lon": 111.31592365888,
                        "lat": 36.957718536996
                    },
                    {
                        "label": "孝义市",
                        "value": "141181",
                        "cityCode": "141100",
                        "provinceCode": "140000",
                        "lon": 111.63764576631,
                        "lat": 37.118132778217
                    },
                    {
                        "label": "汾阳市",
                        "value": "141182",
                        "cityCode": "141100",
                        "provinceCode": "140000",
                        "lon": 111.74599591288,
                        "lat": 37.316764309106
                    }
                ]
            }
        ],
        "label": "山西省",
        "value": "140000"
    },
    {
        "country": "china",
        "lon": 114.41586754817,
        "lat": 43.468238221949,
        "children": [
            {
                "label": "呼和浩特市",
                "value": "150100",
                "provinceCode": "150000",
                "lon": 111.66035052005,
                "lat": 40.828318873082,
                "children": [
                    {
                        "label": "新城区",
                        "value": "150102",
                        "cityCode": "150100",
                        "provinceCode": "150000",
                        "lon": 111.79132678714,
                        "lat": 40.929360778776
                    },
                    {
                        "label": "回民区",
                        "value": "150103",
                        "cityCode": "150100",
                        "provinceCode": "150000",
                        "lon": 111.5968855951,
                        "lat": 40.838894763788
                    },
                    {
                        "label": "玉泉区",
                        "value": "150104",
                        "cityCode": "150100",
                        "provinceCode": "150000",
                        "lon": 111.65855345988,
                        "lat": 40.747386672042
                    },
                    {
                        "label": "赛罕区",
                        "value": "150105",
                        "cityCode": "150100",
                        "provinceCode": "150000",
                        "lon": 111.87633478501,
                        "lat": 40.788864152356
                    },
                    {
                        "label": "土默特左旗",
                        "value": "150121",
                        "cityCode": "150100",
                        "provinceCode": "150000",
                        "lon": 111.23470409261,
                        "lat": 40.689987016139
                    },
                    {
                        "label": "托克托县",
                        "value": "150122",
                        "cityCode": "150100",
                        "provinceCode": "150000",
                        "lon": 111.31970020313,
                        "lat": 40.361083978494
                    },
                    {
                        "label": "和林格尔县",
                        "value": "150123",
                        "cityCode": "150100",
                        "provinceCode": "150000",
                        "lon": 111.90169267122,
                        "lat": 40.333868442059
                    },
                    {
                        "label": "清水河县",
                        "value": "150124",
                        "cityCode": "150100",
                        "provinceCode": "150000",
                        "lon": 111.70623630691,
                        "lat": 39.889117744685
                    },
                    {
                        "label": "武川县",
                        "value": "150125",
                        "cityCode": "150100",
                        "provinceCode": "150000",
                        "lon": 111.17957193814,
                        "lat": 41.1162043874
                    }
                ]
            },
            {
                "label": "包头市",
                "value": "150200",
                "provinceCode": "150000",
                "lon": 109.84623853249,
                "lat": 40.647119425709,
                "children": [
                    {
                        "label": "东河区",
                        "value": "150202",
                        "cityCode": "150200",
                        "provinceCode": "150000",
                        "lon": 110.07014136051,
                        "lat": 40.589124487996
                    },
                    {
                        "label": "昆都仑区",
                        "value": "150203",
                        "cityCode": "150200",
                        "provinceCode": "150000",
                        "lon": 109.80683355282,
                        "lat": 40.658057498224
                    },
                    {
                        "label": "青山区",
                        "value": "150204",
                        "cityCode": "150200",
                        "provinceCode": "150000",
                        "lon": 109.90367483934,
                        "lat": 40.658777959476
                    },
                    {
                        "label": "石拐区",
                        "value": "150205",
                        "cityCode": "150200",
                        "provinceCode": "150000",
                        "lon": 110.29921474522,
                        "lat": 40.716464297272
                    },
                    {
                        "label": "白云鄂博矿区",
                        "value": "150206",
                        "cityCode": "150200",
                        "provinceCode": "150000",
                        "lon": 109.98916893149,
                        "lat": 41.789992502326
                    },
                    {
                        "label": "九原区",
                        "value": "150207",
                        "cityCode": "150200",
                        "provinceCode": "150000",
                        "lon": 109.9491974592,
                        "lat": 40.627202278275
                    },
                    {
                        "label": "土默特右旗",
                        "value": "150221",
                        "cityCode": "150200",
                        "provinceCode": "150000",
                        "lon": 110.69325794788,
                        "lat": 40.527995764374
                    },
                    {
                        "label": "固阳县",
                        "value": "150222",
                        "cityCode": "150200",
                        "provinceCode": "150000",
                        "lon": 110.16759209358,
                        "lat": 41.104725412274
                    },
                    {
                        "label": "达尔罕茂明安联合旗",
                        "value": "150223",
                        "cityCode": "150200",
                        "provinceCode": "150000",
                        "lon": 110.28618869999,
                        "lat": 41.943507148267
                    }
                ]
            },
            {
                "label": "乌海市",
                "value": "150300",
                "provinceCode": "150000",
                "lon": 106.83199909716,
                "lat": 39.683177006785,
                "children": [
                    {
                        "label": "海勃湾区",
                        "value": "150302",
                        "cityCode": "150300",
                        "provinceCode": "150000",
                        "lon": 106.86148184332,
                        "lat": 39.734833651275
                    },
                    {
                        "label": "海南区",
                        "value": "150303",
                        "cityCode": "150300",
                        "provinceCode": "150000",
                        "lon": 106.92539717866,
                        "lat": 39.296209479392
                    },
                    {
                        "label": "乌达区",
                        "value": "150304",
                        "cityCode": "150300",
                        "provinceCode": "150000",
                        "lon": 106.72585891133,
                        "lat": 39.535877701433
                    }
                ]
            },
            {
                "label": "赤峰市",
                "value": "150400",
                "provinceCode": "150000",
                "lon": 118.93076119217,
                "lat": 42.297112320317,
                "children": [
                    {
                        "label": "红山区",
                        "value": "150402",
                        "cityCode": "150400",
                        "provinceCode": "150000",
                        "lon": 118.99810293421,
                        "lat": 42.286232134079
                    },
                    {
                        "label": "元宝山区",
                        "value": "150403",
                        "cityCode": "150400",
                        "provinceCode": "150000",
                        "lon": 119.2681694129,
                        "lat": 42.184130648802
                    },
                    {
                        "label": "松山区",
                        "value": "150404",
                        "cityCode": "150400",
                        "provinceCode": "150000",
                        "lon": 118.75710571166,
                        "lat": 42.268753015289
                    },
                    {
                        "label": "阿鲁科尔沁旗",
                        "value": "150421",
                        "cityCode": "150400",
                        "provinceCode": "150000",
                        "lon": 120.05324069384,
                        "lat": 44.195956597411
                    },
                    {
                        "label": "巴林左旗",
                        "value": "150422",
                        "cityCode": "150400",
                        "provinceCode": "150000",
                        "lon": 119.28076636509,
                        "lat": 44.203430813088
                    },
                    {
                        "label": "巴林右旗",
                        "value": "150423",
                        "cityCode": "150400",
                        "provinceCode": "150000",
                        "lon": 118.9460897431,
                        "lat": 43.684786631454
                    },
                    {
                        "label": "林西县",
                        "value": "150424",
                        "cityCode": "150400",
                        "provinceCode": "150000",
                        "lon": 118.1102161479,
                        "lat": 43.771462211479
                    },
                    {
                        "label": "克什克腾旗",
                        "value": "150425",
                        "cityCode": "150400",
                        "provinceCode": "150000",
                        "lon": 117.35857031121,
                        "lat": 43.218237176681
                    },
                    {
                        "label": "翁牛特旗",
                        "value": "150426",
                        "cityCode": "150400",
                        "provinceCode": "150000",
                        "lon": 119.25464294075,
                        "lat": 42.973979919258
                    },
                    {
                        "label": "喀喇沁旗",
                        "value": "150428",
                        "cityCode": "150400",
                        "provinceCode": "150000",
                        "lon": 118.66705601357,
                        "lat": 41.908351449935
                    },
                    {
                        "label": "宁城县",
                        "value": "150429",
                        "cityCode": "150400",
                        "provinceCode": "150000",
                        "lon": 118.90549936909,
                        "lat": 41.571040867139
                    },
                    {
                        "label": "敖汉旗",
                        "value": "150430",
                        "cityCode": "150400",
                        "provinceCode": "150000",
                        "lon": 120.15771329609,
                        "lat": 42.430592238203
                    }
                ]
            },
            {
                "label": "通辽市",
                "value": "150500",
                "provinceCode": "150000",
                "lon": 122.26036326322,
                "lat": 43.633756072996,
                "children": [
                    {
                        "label": "科尔沁区",
                        "value": "150502",
                        "cityCode": "150500",
                        "provinceCode": "150000",
                        "lon": 122.29129415356,
                        "lat": 43.658290149837
                    },
                    {
                        "label": "科尔沁左翼中旗",
                        "value": "150521",
                        "cityCode": "150500",
                        "provinceCode": "150000",
                        "lon": 122.49918004442,
                        "lat": 44.0575792852
                    },
                    {
                        "label": "科尔沁左翼后旗",
                        "value": "150522",
                        "cityCode": "150500",
                        "provinceCode": "150000",
                        "lon": 122.69734535162,
                        "lat": 43.196082751665
                    },
                    {
                        "label": "开鲁县",
                        "value": "150523",
                        "cityCode": "150500",
                        "provinceCode": "150000",
                        "lon": 121.32409399005,
                        "lat": 43.734941954391
                    },
                    {
                        "label": "库伦旗",
                        "value": "150524",
                        "cityCode": "150500",
                        "provinceCode": "150000",
                        "lon": 121.5730378859,
                        "lat": 42.810038215314
                    },
                    {
                        "label": "奈曼旗",
                        "value": "150525",
                        "cityCode": "150500",
                        "provinceCode": "150000",
                        "lon": 120.94078899637,
                        "lat": 42.972383010739
                    },
                    {
                        "label": "扎鲁特旗",
                        "value": "150526",
                        "cityCode": "150500",
                        "provinceCode": "150000",
                        "lon": 120.59602806799,
                        "lat": 44.82245130193
                    },
                    {
                        "label": "霍林郭勒市",
                        "value": "150581",
                        "cityCode": "150500",
                        "provinceCode": "150000",
                        "lon": 119.57974844022,
                        "lat": 45.52810605633
                    }
                ]
            },
            {
                "label": "鄂尔多斯市",
                "value": "150600",
                "provinceCode": "150000",
                "lon": 109.99370625145,
                "lat": 39.816489560602,
                "children": [
                    {
                        "label": "东胜区",
                        "value": "150602",
                        "cityCode": "150600",
                        "provinceCode": "150000",
                        "lon": 109.76441928582,
                        "lat": 39.805585913146
                    },
                    {
                        "label": "康巴什区",
                        "value": "150603",
                        "cityCode": "150600",
                        "provinceCode": "150000",
                        "lon": 109.84087569351,
                        "lat": 39.640791926893
                    },
                    {
                        "label": "达拉特旗",
                        "value": "150621",
                        "cityCode": "150600",
                        "provinceCode": "150000",
                        "lon": 109.86619090676,
                        "lat": 40.220264473893
                    },
                    {
                        "label": "准格尔旗",
                        "value": "150622",
                        "cityCode": "150600",
                        "provinceCode": "150000",
                        "lon": 110.88623942079,
                        "lat": 39.79472489563
                    },
                    {
                        "label": "鄂托克前旗",
                        "value": "150623",
                        "cityCode": "150600",
                        "provinceCode": "150000",
                        "lon": 107.59700999652,
                        "lat": 38.275938287288
                    },
                    {
                        "label": "鄂托克旗",
                        "value": "150624",
                        "cityCode": "150600",
                        "provinceCode": "150000",
                        "lon": 107.75202023325,
                        "lat": 39.286296593278
                    },
                    {
                        "label": "杭锦旗",
                        "value": "150625",
                        "cityCode": "150600",
                        "provinceCode": "150000",
                        "lon": 108.21282820432,
                        "lat": 40.212873152738
                    },
                    {
                        "label": "乌审旗",
                        "value": "150626",
                        "cityCode": "150600",
                        "provinceCode": "150000",
                        "lon": 108.88966323666,
                        "lat": 38.640475147234
                    },
                    {
                        "label": "伊金霍洛旗",
                        "value": "150627",
                        "cityCode": "150600",
                        "provinceCode": "150000",
                        "lon": 109.70418618841,
                        "lat": 39.420695918404
                    }
                ]
            },
            {
                "label": "呼伦贝尔市",
                "value": "150700",
                "provinceCode": "150000",
                "lon": 119.760821794,
                "lat": 49.201636054604,
                "children": [
                    {
                        "label": "海拉尔区",
                        "value": "150702",
                        "cityCode": "150700",
                        "provinceCode": "150000",
                        "lon": 120.04288208342,
                        "lat": 49.279245456202
                    },
                    {
                        "label": "扎赉诺尔区",
                        "value": "150703",
                        "cityCode": "150700",
                        "provinceCode": "150000",
                        "lon": 117.72318498536,
                        "lat": 49.461481568108
                    },
                    {
                        "label": "阿荣旗",
                        "value": "150721",
                        "cityCode": "150700",
                        "provinceCode": "150000",
                        "lon": 123.17195423134,
                        "lat": 48.639988741071
                    },
                    {
                        "label": "莫力达瓦达斡尔族自治旗",
                        "value": "150722",
                        "cityCode": "150700",
                        "provinceCode": "150000",
                        "lon": 124.47443404901,
                        "lat": 49.104886651718
                    },
                    {
                        "label": "鄂伦春自治旗",
                        "value": "150723",
                        "cityCode": "150700",
                        "provinceCode": "150000",
                        "lon": 123.81727783782,
                        "lat": 50.348754571528
                    },
                    {
                        "label": "鄂温克族自治旗",
                        "value": "150724",
                        "cityCode": "150700",
                        "provinceCode": "150000",
                        "lon": 120.06748322167,
                        "lat": 48.499136514599
                    },
                    {
                        "label": "陈巴尔虎旗",
                        "value": "150725",
                        "cityCode": "150700",
                        "provinceCode": "150000",
                        "lon": 119.53520765754,
                        "lat": 49.605281276761
                    },
                    {
                        "label": "新巴尔虎左旗",
                        "value": "150726",
                        "cityCode": "150700",
                        "provinceCode": "150000",
                        "lon": 118.62152477909,
                        "lat": 48.43639187877
                    },
                    {
                        "label": "新巴尔虎右旗",
                        "value": "150727",
                        "cityCode": "150700",
                        "provinceCode": "150000",
                        "lon": 116.8021843422,
                        "lat": 48.644978915379
                    },
                    {
                        "label": "满洲里市",
                        "value": "150781",
                        "cityCode": "150700",
                        "provinceCode": "150000",
                        "lon": 117.60368677619,
                        "lat": 49.500031717154
                    },
                    {
                        "label": "牙克石市",
                        "value": "150782",
                        "cityCode": "150700",
                        "provinceCode": "150000",
                        "lon": 121.51266780552,
                        "lat": 49.329995939597
                    },
                    {
                        "label": "扎兰屯市",
                        "value": "150783",
                        "cityCode": "150700",
                        "provinceCode": "150000",
                        "lon": 121.92920216562,
                        "lat": 47.7434033831
                    },
                    {
                        "label": "额尔古纳市",
                        "value": "150784",
                        "cityCode": "150700",
                        "provinceCode": "150000",
                        "lon": 120.65276364824,
                        "lat": 51.660818880977
                    },
                    {
                        "label": "根河市",
                        "value": "150785",
                        "cityCode": "150700",
                        "provinceCode": "150000",
                        "lon": 121.79771324217,
                        "lat": 51.37592516127
                    }
                ]
            },
            {
                "label": "巴彦淖尔市",
                "value": "150800",
                "provinceCode": "150000",
                "lon": 107.42380671968,
                "lat": 40.769179902429,
                "children": [
                    {
                        "label": "临河区",
                        "value": "150802",
                        "cityCode": "150800",
                        "provinceCode": "150000",
                        "lon": 107.44183964667,
                        "lat": 40.932018223224
                    },
                    {
                        "label": "五原县",
                        "value": "150821",
                        "cityCode": "150800",
                        "provinceCode": "150000",
                        "lon": 108.07228406065,
                        "lat": 41.045426664817
                    },
                    {
                        "label": "磴口县",
                        "value": "150822",
                        "cityCode": "150800",
                        "provinceCode": "150000",
                        "lon": 106.7000000567,
                        "lat": 40.55518106886
                    },
                    {
                        "label": "乌拉特前旗",
                        "value": "150823",
                        "cityCode": "150800",
                        "provinceCode": "150000",
                        "lon": 109.10529705882,
                        "lat": 40.905993260887
                    },
                    {
                        "label": "乌拉特中旗",
                        "value": "150824",
                        "cityCode": "150800",
                        "provinceCode": "150000",
                        "lon": 108.46454180074,
                        "lat": 41.831044527428
                    },
                    {
                        "label": "乌拉特后旗",
                        "value": "150825",
                        "cityCode": "150800",
                        "provinceCode": "150000",
                        "lon": 106.41380804671,
                        "lat": 41.53194458396
                    },
                    {
                        "label": "杭锦后旗",
                        "value": "150826",
                        "cityCode": "150800",
                        "provinceCode": "150000",
                        "lon": 107.03345374933,
                        "lat": 40.890870780779
                    }
                ]
            },
            {
                "label": "乌兰察布市",
                "value": "150900",
                "provinceCode": "150000",
                "lon": 113.11284639068,
                "lat": 41.022362946751,
                "children": [
                    {
                        "label": "集宁区",
                        "value": "150902",
                        "cityCode": "150900",
                        "provinceCode": "150000",
                        "lon": 113.11283222874,
                        "lat": 41.027765971469
                    },
                    {
                        "label": "卓资县",
                        "value": "150921",
                        "cityCode": "150900",
                        "provinceCode": "150000",
                        "lon": 112.44337671416,
                        "lat": 40.958869485808
                    },
                    {
                        "label": "化德县",
                        "value": "150922",
                        "cityCode": "150900",
                        "provinceCode": "150000",
                        "lon": 114.16573790656,
                        "lat": 41.979126377538
                    },
                    {
                        "label": "商都县",
                        "value": "150923",
                        "cityCode": "150900",
                        "provinceCode": "150000",
                        "lon": 113.62215528367,
                        "lat": 41.726516851564
                    },
                    {
                        "label": "兴和县",
                        "value": "150924",
                        "cityCode": "150900",
                        "provinceCode": "150000",
                        "lon": 113.77372051762,
                        "lat": 40.952666521778
                    },
                    {
                        "label": "凉城县",
                        "value": "150925",
                        "cityCode": "150900",
                        "provinceCode": "150000",
                        "lon": 112.55043247172,
                        "lat": 40.502780210604
                    },
                    {
                        "label": "察哈尔右翼前旗",
                        "value": "150926",
                        "cityCode": "150900",
                        "provinceCode": "150000",
                        "lon": 113.24109639163,
                        "lat": 40.981709597107
                    },
                    {
                        "label": "察哈尔右翼中旗",
                        "value": "150927",
                        "cityCode": "150900",
                        "provinceCode": "150000",
                        "lon": 112.47074335399,
                        "lat": 41.428255371505
                    },
                    {
                        "label": "察哈尔右翼后旗",
                        "value": "150928",
                        "cityCode": "150900",
                        "provinceCode": "150000",
                        "lon": 113.06969288248,
                        "lat": 41.529483090789
                    },
                    {
                        "label": "四子王旗",
                        "value": "150929",
                        "cityCode": "150900",
                        "provinceCode": "150000",
                        "lon": 111.58903652853,
                        "lat": 42.30714575607
                    },
                    {
                        "label": "丰镇市",
                        "value": "150981",
                        "cityCode": "150900",
                        "provinceCode": "150000",
                        "lon": 113.30867650253,
                        "lat": 40.558336025296
                    }
                ]
            },
            {
                "label": "兴安盟",
                "value": "152200",
                "provinceCode": "150000",
                "lon": 122.04816651407,
                "lat": 46.083757065182,
                "children": [
                    {
                        "label": "乌兰浩特市",
                        "value": "152201",
                        "cityCode": "152200",
                        "provinceCode": "150000",
                        "lon": 122.0815338095,
                        "lat": 46.116943570165
                    },
                    {
                        "label": "阿尔山市",
                        "value": "152202",
                        "cityCode": "152200",
                        "provinceCode": "150000",
                        "lon": 120.35753387505,
                        "lat": 47.163696335727
                    },
                    {
                        "label": "科尔沁右翼前旗",
                        "value": "152221",
                        "cityCode": "152200",
                        "provinceCode": "150000",
                        "lon": 121.22152365342,
                        "lat": 46.334025380898
                    },
                    {
                        "label": "科尔沁右翼中旗",
                        "value": "152222",
                        "cityCode": "152200",
                        "provinceCode": "150000",
                        "lon": 121.19851019319,
                        "lat": 45.242068815668
                    },
                    {
                        "label": "扎赉特旗",
                        "value": "152223",
                        "cityCode": "152200",
                        "provinceCode": "150000",
                        "lon": 122.38814625782,
                        "lat": 46.790807786397
                    },
                    {
                        "label": "突泉县",
                        "value": "152224",
                        "cityCode": "152200",
                        "provinceCode": "150000",
                        "lon": 121.51921179351,
                        "lat": 45.632866219095
                    }
                ]
            },
            {
                "label": "锡林郭勒盟",
                "value": "152500",
                "provinceCode": "150000",
                "lon": 116.02733968896,
                "lat": 43.939704842324,
                "children": [
                    {
                        "label": "二连浩特市",
                        "value": "152501",
                        "cityCode": "152500",
                        "provinceCode": "150000",
                        "lon": 111.96617841378,
                        "lat": 43.417780458226
                    },
                    {
                        "label": "锡林浩特市",
                        "value": "152502",
                        "cityCode": "152500",
                        "provinceCode": "150000",
                        "lon": 116.13694826431,
                        "lat": 44.078961129099
                    },
                    {
                        "label": "阿巴嘎旗",
                        "value": "152522",
                        "cityCode": "152500",
                        "provinceCode": "150000",
                        "lon": 114.89347121165,
                        "lat": 44.276507422523
                    },
                    {
                        "label": "苏尼特左旗",
                        "value": "152523",
                        "cityCode": "152500",
                        "provinceCode": "150000",
                        "lon": 113.14030742275,
                        "lat": 44.039238043252
                    },
                    {
                        "label": "苏尼特右旗",
                        "value": "152524",
                        "cityCode": "152500",
                        "provinceCode": "150000",
                        "lon": 112.91159981029,
                        "lat": 42.900963777858
                    },
                    {
                        "label": "东乌珠穆沁旗",
                        "value": "152525",
                        "cityCode": "152500",
                        "provinceCode": "150000",
                        "lon": 117.8104504134,
                        "lat": 45.826664793338
                    },
                    {
                        "label": "西乌珠穆沁旗",
                        "value": "152526",
                        "cityCode": "152500",
                        "provinceCode": "150000",
                        "lon": 117.81696314273,
                        "lat": 44.715902995292
                    },
                    {
                        "label": "太仆寺旗",
                        "value": "152527",
                        "cityCode": "152500",
                        "provinceCode": "150000",
                        "lon": 115.30455821777,
                        "lat": 41.906215635041
                    },
                    {
                        "label": "镶黄旗",
                        "value": "152528",
                        "cityCode": "152500",
                        "provinceCode": "150000",
                        "lon": 114.12058911409,
                        "lat": 42.368275700926
                    },
                    {
                        "label": "正镶白旗",
                        "value": "152529",
                        "cityCode": "152500",
                        "provinceCode": "150000",
                        "lon": 115.02434728451,
                        "lat": 42.554842970033
                    },
                    {
                        "label": "正蓝旗",
                        "value": "152530",
                        "cityCode": "152500",
                        "provinceCode": "150000",
                        "lon": 115.94010983058,
                        "lat": 42.674413879311
                    },
                    {
                        "label": "多伦县",
                        "value": "152531",
                        "cityCode": "152500",
                        "provinceCode": "150000",
                        "lon": 116.4986386762,
                        "lat": 42.196600874379
                    }
                ]
            },
            {
                "label": "阿拉善盟",
                "value": "152900",
                "provinceCode": "150000",
                "lon": 105.69568287113,
                "lat": 38.843075264408,
                "children": [
                    {
                        "label": "阿拉善左旗",
                        "value": "152921",
                        "cityCode": "152900",
                        "provinceCode": "150000",
                        "lon": 105.03824684198,
                        "lat": 39.547806401013
                    },
                    {
                        "label": "阿拉善右旗",
                        "value": "152922",
                        "cityCode": "152900",
                        "provinceCode": "150000",
                        "lon": 102.44385599727,
                        "lat": 40.186228955604
                    },
                    {
                        "label": "额济纳旗",
                        "value": "152923",
                        "cityCode": "152900",
                        "provinceCode": "150000",
                        "lon": 100.09951238471,
                        "lat": 41.693799843161
                    }
                ]
            }
        ],
        "label": "内蒙古自治区",
        "value": "150000"
    },
    {
        "country": "china",
        "lon": 122.75359155772,
        "lat": 41.621600105958,
        "children": [
            {
                "label": "沈阳市",
                "value": "210100",
                "provinceCode": "210000",
                "lon": 123.43279092161,
                "lat": 41.808644783516,
                "children": [
                    {
                        "label": "和平区",
                        "value": "210102",
                        "cityCode": "210100",
                        "provinceCode": "210000",
                        "lon": 123.41433166046,
                        "lat": 41.786474395792
                    },
                    {
                        "label": "沈河区",
                        "value": "210103",
                        "cityCode": "210100",
                        "provinceCode": "210000",
                        "lon": 123.45355228301,
                        "lat": 41.798304641933
                    },
                    {
                        "label": "大东区",
                        "value": "210104",
                        "cityCode": "210100",
                        "provinceCode": "210000",
                        "lon": 123.49892677691,
                        "lat": 41.835279080775
                    },
                    {
                        "label": "皇姑区",
                        "value": "210105",
                        "cityCode": "210100",
                        "provinceCode": "210000",
                        "lon": 123.41537632672,
                        "lat": 41.848913204573
                    },
                    {
                        "label": "铁西区",
                        "value": "210106",
                        "cityCode": "210100",
                        "provinceCode": "210000",
                        "lon": 123.35862982907,
                        "lat": 41.805724167622
                    },
                    {
                        "label": "苏家屯区",
                        "value": "210111",
                        "cityCode": "210100",
                        "provinceCode": "210000",
                        "lon": 123.42628905169,
                        "lat": 41.589345157565
                    },
                    {
                        "label": "浑南区",
                        "value": "210112",
                        "cityCode": "210100",
                        "provinceCode": "210000",
                        "lon": 123.5714290915,
                        "lat": 41.794157738255
                    },
                    {
                        "label": "沈北新区",
                        "value": "210113",
                        "cityCode": "210100",
                        "provinceCode": "210000",
                        "lon": 123.5186904027,
                        "lat": 42.043849976101
                    },
                    {
                        "label": "于洪区",
                        "value": "210114",
                        "cityCode": "210100",
                        "provinceCode": "210000",
                        "lon": 123.2428469731,
                        "lat": 41.843551023712
                    },
                    {
                        "label": "辽中区",
                        "value": "210115",
                        "cityCode": "210100",
                        "provinceCode": "210000",
                        "lon": 122.79857550059,
                        "lat": 41.500330370098
                    },
                    {
                        "label": "康平县",
                        "value": "210123",
                        "cityCode": "210100",
                        "provinceCode": "210000",
                        "lon": 123.27359808776,
                        "lat": 42.765540738313
                    },
                    {
                        "label": "法库县",
                        "value": "210124",
                        "cityCode": "210100",
                        "provinceCode": "210000",
                        "lon": 123.24889709003,
                        "lat": 42.415297839562
                    },
                    {
                        "label": "新民市",
                        "value": "210181",
                        "cityCode": "210100",
                        "provinceCode": "210000",
                        "lon": 122.86641820399,
                        "lat": 42.016776193846
                    }
                ]
            },
            {
                "label": "大连市",
                "value": "210200",
                "provinceCode": "210000",
                "lon": 121.59347778144,
                "lat": 38.948709938304,
                "children": [
                    {
                        "label": "中山区",
                        "value": "210202",
                        "cityCode": "210200",
                        "provinceCode": "210000",
                        "lon": 121.67796628923,
                        "lat": 38.900436431992
                    },
                    {
                        "label": "西岗区",
                        "value": "210203",
                        "cityCode": "210200",
                        "provinceCode": "210000",
                        "lon": 121.6258229781,
                        "lat": 38.913369529939
                    },
                    {
                        "label": "沙河口区",
                        "value": "210204",
                        "cityCode": "210200",
                        "provinceCode": "210000",
                        "lon": 121.5826178068,
                        "lat": 38.921778341674
                    },
                    {
                        "label": "甘井子区",
                        "value": "210211",
                        "cityCode": "210200",
                        "provinceCode": "210000",
                        "lon": 121.52850037949,
                        "lat": 38.955461760661
                    },
                    {
                        "label": "旅顺口区",
                        "value": "210212",
                        "cityCode": "210200",
                        "provinceCode": "210000",
                        "lon": 121.29593564059,
                        "lat": 38.908290673003
                    },
                    {
                        "label": "金州区",
                        "value": "210213",
                        "cityCode": "210200",
                        "provinceCode": "210000",
                        "lon": 121.95658248044,
                        "lat": 39.29861907186
                    },
                    {
                        "label": "普兰店区",
                        "value": "210214",
                        "cityCode": "210200",
                        "provinceCode": "210000",
                        "lon": 122.21603953088,
                        "lat": 39.651792833684
                    },
                    {
                        "label": "长海县",
                        "value": "210224",
                        "cityCode": "210200",
                        "provinceCode": "210000",
                        "lon": 122.74826454271,
                        "lat": 39.26010853029
                    },
                    {
                        "label": "瓦房店市",
                        "value": "210281",
                        "cityCode": "210200",
                        "provinceCode": "210000",
                        "lon": 121.79069878874,
                        "lat": 39.70895639619
                    },
                    {
                        "label": "庄河市",
                        "value": "210283",
                        "cityCode": "210200",
                        "provinceCode": "210000",
                        "lon": 122.934145267,
                        "lat": 39.858909784172
                    }
                ]
            },
            {
                "label": "鞍山市",
                "value": "210300",
                "provinceCode": "210000",
                "lon": 123.00776332888,
                "lat": 41.118743682153,
                "children": [
                    {
                        "label": "铁东区",
                        "value": "210302",
                        "cityCode": "210300",
                        "provinceCode": "210000",
                        "lon": 123.02070584518,
                        "lat": 41.118235115557
                    },
                    {
                        "label": "铁西区",
                        "value": "210303",
                        "cityCode": "210300",
                        "provinceCode": "210000",
                        "lon": 123.35862982907,
                        "lat": 41.805724167622
                    },
                    {
                        "label": "立山区",
                        "value": "210304",
                        "cityCode": "210300",
                        "provinceCode": "210000",
                        "lon": 123.04047350708,
                        "lat": 41.164172891853
                    },
                    {
                        "label": "千山区",
                        "value": "210311",
                        "cityCode": "210300",
                        "provinceCode": "210000",
                        "lon": 123.01400529455,
                        "lat": 41.061328521987
                    },
                    {
                        "label": "台安县",
                        "value": "210321",
                        "cityCode": "210300",
                        "provinceCode": "210000",
                        "lon": 122.4436825276,
                        "lat": 41.347099748004
                    },
                    {
                        "label": "岫岩满族自治县",
                        "value": "210323",
                        "cityCode": "210300",
                        "provinceCode": "210000",
                        "lon": 123.34606899826,
                        "lat": 40.4031809953
                    },
                    {
                        "label": "海城市",
                        "value": "210381",
                        "cityCode": "210300",
                        "provinceCode": "210000",
                        "lon": 122.79120058219,
                        "lat": 40.840354247523
                    }
                ]
            },
            {
                "label": "抚顺市",
                "value": "210400",
                "provinceCode": "210000",
                "lon": 123.92981976705,
                "lat": 41.877303829591,
                "children": [
                    {
                        "label": "新抚区",
                        "value": "210402",
                        "cityCode": "210400",
                        "provinceCode": "210000",
                        "lon": 123.91136857188,
                        "lat": 41.869789660664
                    },
                    {
                        "label": "东洲区",
                        "value": "210403",
                        "cityCode": "210400",
                        "provinceCode": "210000",
                        "lon": 124.02924934124,
                        "lat": 41.833588275171
                    },
                    {
                        "label": "望花区",
                        "value": "210404",
                        "cityCode": "210400",
                        "provinceCode": "210000",
                        "lon": 123.78599647355,
                        "lat": 41.860403588778
                    },
                    {
                        "label": "顺城区",
                        "value": "210411",
                        "cityCode": "210400",
                        "provinceCode": "210000",
                        "lon": 123.90172355545,
                        "lat": 41.916014133796
                    },
                    {
                        "label": "抚顺县",
                        "value": "210421",
                        "cityCode": "210400",
                        "provinceCode": "210000",
                        "lon": 124.1365888338,
                        "lat": 41.750076669591
                    },
                    {
                        "label": "新宾满族自治县",
                        "value": "210422",
                        "cityCode": "210400",
                        "provinceCode": "210000",
                        "lon": 124.82786556411,
                        "lat": 41.635119411
                    },
                    {
                        "label": "清原满族自治县",
                        "value": "210423",
                        "cityCode": "210400",
                        "provinceCode": "210000",
                        "lon": 124.92431743309,
                        "lat": 42.118882344791
                    }
                ]
            },
            {
                "label": "本溪市",
                "value": "210500",
                "provinceCode": "210000",
                "lon": 123.77806236979,
                "lat": 41.325837626649,
                "children": [
                    {
                        "label": "平山区",
                        "value": "210502",
                        "cityCode": "210500",
                        "provinceCode": "210000",
                        "lon": 123.69257521577,
                        "lat": 41.240400691895
                    },
                    {
                        "label": "溪湖区",
                        "value": "210503",
                        "cityCode": "210500",
                        "provinceCode": "210000",
                        "lon": 123.71186569778,
                        "lat": 41.45615399333
                    },
                    {
                        "label": "明山区",
                        "value": "210504",
                        "cityCode": "210500",
                        "provinceCode": "210000",
                        "lon": 123.90173685037,
                        "lat": 41.347752110456
                    },
                    {
                        "label": "南芬区",
                        "value": "210505",
                        "cityCode": "210500",
                        "provinceCode": "210000",
                        "lon": 123.82788014761,
                        "lat": 41.122716220999
                    },
                    {
                        "label": "本溪满族自治县",
                        "value": "210521",
                        "cityCode": "210500",
                        "provinceCode": "210000",
                        "lon": 124.15856431847,
                        "lat": 41.195670233912
                    },
                    {
                        "label": "桓仁满族自治县",
                        "value": "210522",
                        "cityCode": "210500",
                        "provinceCode": "210000",
                        "lon": 125.29002787,
                        "lat": 41.261815877129
                    }
                ]
            },
            {
                "label": "丹东市",
                "value": "210600",
                "provinceCode": "210000",
                "lon": 124.33854311477,
                "lat": 40.129022826638,
                "children": [
                    {
                        "label": "元宝区",
                        "value": "210602",
                        "cityCode": "210600",
                        "provinceCode": "210000",
                        "lon": 124.35032097797,
                        "lat": 40.173197015058
                    },
                    {
                        "label": "振兴区",
                        "value": "210603",
                        "cityCode": "210600",
                        "provinceCode": "210000",
                        "lon": 124.35556286011,
                        "lat": 40.067035318752
                    },
                    {
                        "label": "振安区",
                        "value": "210604",
                        "cityCode": "210600",
                        "provinceCode": "210000",
                        "lon": 124.29219665893,
                        "lat": 40.211546606919
                    },
                    {
                        "label": "宽甸满族自治县",
                        "value": "210624",
                        "cityCode": "210600",
                        "provinceCode": "210000",
                        "lon": 124.93410611424,
                        "lat": 40.766142006754
                    },
                    {
                        "label": "东港市",
                        "value": "210681",
                        "cityCode": "210600",
                        "provinceCode": "210000",
                        "lon": 123.876870274,
                        "lat": 39.981217334184
                    },
                    {
                        "label": "凤城市",
                        "value": "210682",
                        "cityCode": "210600",
                        "provinceCode": "210000",
                        "lon": 124.07296025051,
                        "lat": 40.579570306659
                    }
                ]
            },
            {
                "label": "锦州市",
                "value": "210700",
                "provinceCode": "210000",
                "lon": 121.14774873824,
                "lat": 41.130878875917,
                "children": [
                    {
                        "label": "古塔区",
                        "value": "210702",
                        "cityCode": "210700",
                        "provinceCode": "210000",
                        "lon": 121.1264337451,
                        "lat": 41.14138819307
                    },
                    {
                        "label": "凌河区",
                        "value": "210703",
                        "cityCode": "210700",
                        "provinceCode": "210000",
                        "lon": 121.18266452595,
                        "lat": 41.13438040426
                    },
                    {
                        "label": "太和区",
                        "value": "210711",
                        "cityCode": "210700",
                        "provinceCode": "210000",
                        "lon": 121.11864471768,
                        "lat": 41.136830132753
                    },
                    {
                        "label": "黑山县",
                        "value": "210726",
                        "cityCode": "210700",
                        "provinceCode": "210000",
                        "lon": 122.26073588726,
                        "lat": 41.799697885598
                    },
                    {
                        "label": "义县",
                        "value": "210727",
                        "cityCode": "210700",
                        "provinceCode": "210000",
                        "lon": 121.30187737888,
                        "lat": 41.534928118312
                    },
                    {
                        "label": "凌海市",
                        "value": "210781",
                        "cityCode": "210700",
                        "provinceCode": "210000",
                        "lon": 121.28557458803,
                        "lat": 41.152566155094
                    },
                    {
                        "label": "北镇市",
                        "value": "210782",
                        "cityCode": "210700",
                        "provinceCode": "210000",
                        "lon": 121.86454971392,
                        "lat": 41.547118023827
                    }
                ]
            },
            {
                "label": "营口市",
                "value": "210800",
                "provinceCode": "210000",
                "lon": 122.23339137079,
                "lat": 40.668651066474,
                "children": [
                    {
                        "label": "站前区",
                        "value": "210802",
                        "cityCode": "210800",
                        "provinceCode": "210000",
                        "lon": 122.2655920301,
                        "lat": 40.703009826765
                    },
                    {
                        "label": "西市区",
                        "value": "210803",
                        "cityCode": "210800",
                        "provinceCode": "210000",
                        "lon": 122.21012624622,
                        "lat": 40.66694904618
                    },
                    {
                        "label": "鲅鱼圈区",
                        "value": "210804",
                        "cityCode": "210800",
                        "provinceCode": "210000",
                        "lon": 122.17689658108,
                        "lat": 40.25258448446
                    },
                    {
                        "label": "老边区",
                        "value": "210811",
                        "cityCode": "210800",
                        "provinceCode": "210000",
                        "lon": 122.33090270339,
                        "lat": 40.672565437571
                    },
                    {
                        "label": "盖州市",
                        "value": "210881",
                        "cityCode": "210800",
                        "provinceCode": "210000",
                        "lon": 122.47732679351,
                        "lat": 40.235441470469
                    },
                    {
                        "label": "大石桥市",
                        "value": "210882",
                        "cityCode": "210800",
                        "provinceCode": "210000",
                        "lon": 122.57155106236,
                        "lat": 40.646915451877
                    }
                ]
            },
            {
                "label": "阜新市",
                "value": "210900",
                "provinceCode": "210000",
                "lon": 121.66082212857,
                "lat": 42.01925010706,
                "children": [
                    {
                        "label": "海州区",
                        "value": "210902",
                        "cityCode": "210900",
                        "provinceCode": "210000",
                        "lon": 121.65270512981,
                        "lat": 41.99090249247
                    },
                    {
                        "label": "新邱区",
                        "value": "210903",
                        "cityCode": "210900",
                        "provinceCode": "210000",
                        "lon": 121.82432100766,
                        "lat": 42.074627619468
                    },
                    {
                        "label": "太平区",
                        "value": "210904",
                        "cityCode": "210900",
                        "provinceCode": "210000",
                        "lon": 121.73775310227,
                        "lat": 42.00945236252
                    },
                    {
                        "label": "清河门区",
                        "value": "210905",
                        "cityCode": "210900",
                        "provinceCode": "210000",
                        "lon": 121.44683854847,
                        "lat": 41.754998439335
                    },
                    {
                        "label": "细河区",
                        "value": "210911",
                        "cityCode": "210900",
                        "provinceCode": "210000",
                        "lon": 121.6275568874,
                        "lat": 42.043253678758
                    },
                    {
                        "label": "阜新蒙古族自治县",
                        "value": "210921",
                        "cityCode": "210900",
                        "provinceCode": "210000",
                        "lon": 121.69557778355,
                        "lat": 42.157500408157
                    },
                    {
                        "label": "彰武县",
                        "value": "210922",
                        "cityCode": "210900",
                        "provinceCode": "210000",
                        "lon": 122.47417316389,
                        "lat": 42.523754435526
                    }
                ]
            },
            {
                "label": "辽阳市",
                "value": "211000",
                "provinceCode": "210000",
                "lon": 123.17245120515,
                "lat": 41.273339265569,
                "children": [
                    {
                        "label": "白塔区",
                        "value": "211002",
                        "cityCode": "211000",
                        "provinceCode": "210000",
                        "lon": 123.17516309965,
                        "lat": 41.279285816853
                    },
                    {
                        "label": "文圣区",
                        "value": "211003",
                        "cityCode": "211000",
                        "provinceCode": "210000",
                        "lon": 123.20121638487,
                        "lat": 41.271122206557
                    },
                    {
                        "label": "宏伟区",
                        "value": "211004",
                        "cityCode": "211000",
                        "provinceCode": "210000",
                        "lon": 123.22051827536,
                        "lat": 41.220763801748
                    },
                    {
                        "label": "弓长岭区",
                        "value": "211005",
                        "cityCode": "211000",
                        "provinceCode": "210000",
                        "lon": 123.42628014056,
                        "lat": 41.145969646405
                    },
                    {
                        "label": "太子河区",
                        "value": "211011",
                        "cityCode": "211000",
                        "provinceCode": "210000",
                        "lon": 123.17837427236,
                        "lat": 41.274593139071
                    },
                    {
                        "label": "辽阳县",
                        "value": "211021",
                        "cityCode": "211000",
                        "provinceCode": "210000",
                        "lon": 123.21982126206,
                        "lat": 41.077281158776
                    },
                    {
                        "label": "灯塔市",
                        "value": "211081",
                        "cityCode": "211000",
                        "provinceCode": "210000",
                        "lon": 123.31257357315,
                        "lat": 41.420098857086
                    }
                ]
            },
            {
                "label": "盘锦市",
                "value": "211100",
                "provinceCode": "210000",
                "lon": 122.07322781023,
                "lat": 41.141248022956,
                "children": [
                    {
                        "label": "双台子区",
                        "value": "211102",
                        "cityCode": "211100",
                        "provinceCode": "210000",
                        "lon": 122.03203843649,
                        "lat": 41.193224510116
                    },
                    {
                        "label": "兴隆台区",
                        "value": "211103",
                        "cityCode": "211100",
                        "provinceCode": "210000",
                        "lon": 121.96962911034,
                        "lat": 41.155830887559
                    },
                    {
                        "label": "大洼区",
                        "value": "211104",
                        "cityCode": "211100",
                        "provinceCode": "210000",
                        "lon": 122.08839097548,
                        "lat": 40.905899458766
                    },
                    {
                        "label": "盘山县",
                        "value": "211122",
                        "cityCode": "211100",
                        "provinceCode": "210000",
                        "lon": 121.95216562366,
                        "lat": 41.193475065521
                    }
                ]
            },
            {
                "label": "铁岭市",
                "value": "211200",
                "provinceCode": "210000",
                "lon": 123.85484961462,
                "lat": 42.299757012125,
                "children": [
                    {
                        "label": "银州区",
                        "value": "211202",
                        "cityCode": "211200",
                        "provinceCode": "210000",
                        "lon": 123.85851586889,
                        "lat": 42.248294823185
                    },
                    {
                        "label": "清河区",
                        "value": "211204",
                        "cityCode": "211200",
                        "provinceCode": "210000",
                        "lon": 124.27578016446,
                        "lat": 42.508557048192
                    },
                    {
                        "label": "铁岭县",
                        "value": "211221",
                        "cityCode": "211200",
                        "provinceCode": "210000",
                        "lon": 123.91452868265,
                        "lat": 42.222764650024
                    },
                    {
                        "label": "西丰县",
                        "value": "211223",
                        "cityCode": "211200",
                        "provinceCode": "210000",
                        "lon": 124.73850222789,
                        "lat": 42.712739429005
                    },
                    {
                        "label": "昌图县",
                        "value": "211224",
                        "cityCode": "211200",
                        "provinceCode": "210000",
                        "lon": 123.94640914451,
                        "lat": 43.000462116167
                    },
                    {
                        "label": "调兵山市",
                        "value": "211281",
                        "cityCode": "211200",
                        "provinceCode": "210000",
                        "lon": 123.58434789559,
                        "lat": 42.442929890534
                    },
                    {
                        "label": "开原市",
                        "value": "211282",
                        "cityCode": "211200",
                        "provinceCode": "210000",
                        "lon": 124.28377598099,
                        "lat": 42.471223289128
                    }
                ]
            },
            {
                "label": "朝阳市",
                "value": "211300",
                "provinceCode": "210000",
                "lon": 120.44616270274,
                "lat": 41.571827667857,
                "children": [
                    {
                        "label": "双塔区",
                        "value": "211302",
                        "cityCode": "211300",
                        "provinceCode": "210000",
                        "lon": 120.48407290204,
                        "lat": 41.605740189556
                    },
                    {
                        "label": "龙城区",
                        "value": "211303",
                        "cityCode": "211300",
                        "provinceCode": "210000",
                        "lon": 120.40133294592,
                        "lat": 41.606226996662
                    },
                    {
                        "label": "朝阳县",
                        "value": "211321",
                        "cityCode": "211300",
                        "provinceCode": "210000",
                        "lon": 120.30506072918,
                        "lat": 41.372795903547
                    },
                    {
                        "label": "建平县",
                        "value": "211322",
                        "cityCode": "211300",
                        "provinceCode": "210000",
                        "lon": 119.63252714815,
                        "lat": 41.842222586595
                    },
                    {
                        "label": "喀喇沁左翼蒙古族自治县",
                        "value": "211324",
                        "cityCode": "211300",
                        "provinceCode": "210000",
                        "lon": 119.77553367022,
                        "lat": 41.143623845035
                    },
                    {
                        "label": "北票市",
                        "value": "211381",
                        "cityCode": "211300",
                        "provinceCode": "210000",
                        "lon": 120.81188458747,
                        "lat": 41.865071031498
                    },
                    {
                        "label": "凌源市",
                        "value": "211382",
                        "cityCode": "211300",
                        "provinceCode": "210000",
                        "lon": 119.27154312683,
                        "lat": 40.981801128352
                    }
                ]
            },
            {
                "label": "葫芦岛市",
                "value": "211400",
                "provinceCode": "210000",
                "lon": 120.86075764476,
                "lat": 40.743029881318,
                "children": [
                    {
                        "label": "连山区",
                        "value": "211402",
                        "cityCode": "211400",
                        "provinceCode": "210000",
                        "lon": 120.6883607801,
                        "lat": 40.888537340117
                    },
                    {
                        "label": "龙港区",
                        "value": "211403",
                        "cityCode": "211400",
                        "provinceCode": "210000",
                        "lon": 120.90458597059,
                        "lat": 40.750992710489
                    },
                    {
                        "label": "南票区",
                        "value": "211404",
                        "cityCode": "211400",
                        "provinceCode": "210000",
                        "lon": 120.66464506548,
                        "lat": 41.137035783771
                    },
                    {
                        "label": "绥中县",
                        "value": "211421",
                        "cityCode": "211400",
                        "provinceCode": "210000",
                        "lon": 120.02630174192,
                        "lat": 40.305129005823
                    },
                    {
                        "label": "建昌县",
                        "value": "211422",
                        "cityCode": "211400",
                        "provinceCode": "210000",
                        "lon": 119.83489152944,
                        "lat": 40.716827705586
                    },
                    {
                        "label": "兴城市",
                        "value": "211481",
                        "cityCode": "211400",
                        "provinceCode": "210000",
                        "lon": 120.47552727234,
                        "lat": 40.596284243832
                    }
                ]
            }
        ],
        "label": "辽宁省",
        "value": "210000"
    },
    {
        "country": "china",
        "lon": 126.26287593078,
        "lat": 43.678846185241,
        "children": [
            {
                "label": "长春市",
                "value": "220100",
                "provinceCode": "220000",
                "lon": 125.3136424272,
                "lat": 43.898337607098,
                "children": [
                    {
                        "label": "南关区",
                        "value": "220102",
                        "cityCode": "220100",
                        "provinceCode": "220000",
                        "lon": 125.41964874071,
                        "lat": 43.732190540843
                    },
                    {
                        "label": "宽城区",
                        "value": "220103",
                        "cityCode": "220100",
                        "provinceCode": "220000",
                        "lon": 125.34489933527,
                        "lat": 43.998252407951
                    },
                    {
                        "label": "朝阳区",
                        "value": "220104",
                        "cityCode": "220100",
                        "provinceCode": "220000",
                        "lon": 125.27822648218,
                        "lat": 43.689108619451
                    },
                    {
                        "label": "二道区",
                        "value": "220105",
                        "cityCode": "220100",
                        "provinceCode": "220000",
                        "lon": 125.61148484631,
                        "lat": 43.872222715497
                    },
                    {
                        "label": "绿园区",
                        "value": "220106",
                        "cityCode": "220100",
                        "provinceCode": "220000",
                        "lon": 125.19133076327,
                        "lat": 43.912164564835
                    },
                    {
                        "label": "双阳区",
                        "value": "220112",
                        "cityCode": "220100",
                        "provinceCode": "220000",
                        "lon": 125.71282235937,
                        "lat": 43.531747024963
                    },
                    {
                        "label": "九台区",
                        "value": "220113",
                        "cityCode": "220100",
                        "provinceCode": "220000",
                        "lon": 125.96882675838,
                        "lat": 44.194372106981
                    },
                    {
                        "label": "农安县",
                        "value": "220122",
                        "cityCode": "220100",
                        "provinceCode": "220000",
                        "lon": 125.09432707273,
                        "lat": 44.461506089801
                    },
                    {
                        "label": "榆树市",
                        "value": "220182",
                        "cityCode": "220100",
                        "provinceCode": "220000",
                        "lon": 126.60250076501,
                        "lat": 44.879422926679
                    },
                    {
                        "label": "德惠市",
                        "value": "220183",
                        "cityCode": "220100",
                        "provinceCode": "220000",
                        "lon": 125.76904438895,
                        "lat": 44.510507146916
                    }
                ]
            },
            {
                "label": "吉林市",
                "value": "220200",
                "provinceCode": "220000",
                "lon": 126.56454398883,
                "lat": 43.871988334359,
                "children": [
                    {
                        "label": "昌邑区",
                        "value": "220202",
                        "cityCode": "220200",
                        "provinceCode": "220000",
                        "lon": 126.3265130609,
                        "lat": 44.023897560596
                    },
                    {
                        "label": "龙潭区",
                        "value": "220203",
                        "cityCode": "220200",
                        "provinceCode": "220000",
                        "lon": 126.69508484724,
                        "lat": 44.100874364702
                    },
                    {
                        "label": "船营区",
                        "value": "220204",
                        "cityCode": "220200",
                        "provinceCode": "220000",
                        "lon": 126.38908947188,
                        "lat": 43.882171941455
                    },
                    {
                        "label": "丰满区",
                        "value": "220211",
                        "cityCode": "220200",
                        "provinceCode": "220000",
                        "lon": 126.69820214702,
                        "lat": 43.654515333155
                    },
                    {
                        "label": "永吉县",
                        "value": "220221",
                        "cityCode": "220200",
                        "provinceCode": "220000",
                        "lon": 126.22756009767,
                        "lat": 43.601481147552
                    },
                    {
                        "label": "蛟河市",
                        "value": "220281",
                        "cityCode": "220200",
                        "provinceCode": "220000",
                        "lon": 127.35174186542,
                        "lat": 43.716756082246
                    },
                    {
                        "label": "桦甸市",
                        "value": "220282",
                        "cityCode": "220200",
                        "provinceCode": "220000",
                        "lon": 127.04139243957,
                        "lat": 43.056631099131
                    },
                    {
                        "label": "舒兰市",
                        "value": "220283",
                        "cityCode": "220200",
                        "provinceCode": "220000",
                        "lon": 127.11677230895,
                        "lat": 44.335465144158
                    },
                    {
                        "label": "磐石市",
                        "value": "220284",
                        "cityCode": "220200",
                        "provinceCode": "220000",
                        "lon": 126.17462779101,
                        "lat": 43.05745611333
                    }
                ]
            },
            {
                "label": "四平市",
                "value": "220300",
                "provinceCode": "220000",
                "lon": 124.39138207368,
                "lat": 43.175524701126,
                "children": [
                    {
                        "label": "铁西区",
                        "value": "220302",
                        "cityCode": "220300",
                        "provinceCode": "220000",
                        "lon": 124.35539155325,
                        "lat": 43.214159722508
                    },
                    {
                        "label": "铁东区",
                        "value": "220303",
                        "cityCode": "220300",
                        "provinceCode": "220000",
                        "lon": 124.45989915866,
                        "lat": 43.101528833564
                    },
                    {
                        "label": "梨树县",
                        "value": "220322",
                        "cityCode": "220300",
                        "provinceCode": "220000",
                        "lon": 124.38049140672,
                        "lat": 43.414437629602
                    },
                    {
                        "label": "伊通满族自治县",
                        "value": "220323",
                        "cityCode": "220300",
                        "provinceCode": "220000",
                        "lon": 125.27114939123,
                        "lat": 43.346321828789
                    },
                    {
                        "label": "公主岭市",
                        "value": "220381",
                        "cityCode": "220300",
                        "provinceCode": "220000",
                        "lon": 124.6858822207,
                        "lat": 43.791826067578
                    },
                    {
                        "label": "双辽市",
                        "value": "220382",
                        "cityCode": "220300",
                        "provinceCode": "220000",
                        "lon": 123.70852021747,
                        "lat": 43.767694883217
                    }
                ]
            },
            {
                "label": "辽源市",
                "value": "220400",
                "provinceCode": "220000",
                "lon": 125.13368605218,
                "lat": 42.923302619054,
                "children": [
                    {
                        "label": "龙山区",
                        "value": "220402",
                        "cityCode": "220400",
                        "provinceCode": "220000",
                        "lon": 125.2109975481,
                        "lat": 42.913196595909
                    },
                    {
                        "label": "西安区",
                        "value": "220403",
                        "cityCode": "220400",
                        "provinceCode": "220000",
                        "lon": 125.15014857862,
                        "lat": 42.986364946378
                    },
                    {
                        "label": "东丰县",
                        "value": "220421",
                        "cityCode": "220400",
                        "provinceCode": "220000",
                        "lon": 125.45480890408,
                        "lat": 42.683933895982
                    },
                    {
                        "label": "东辽县",
                        "value": "220422",
                        "cityCode": "220400",
                        "provinceCode": "220000",
                        "lon": 125.18493119325,
                        "lat": 42.94792512736
                    }
                ]
            },
            {
                "label": "通化市",
                "value": "220500",
                "provinceCode": "220000",
                "lon": 125.94265013851,
                "lat": 41.736397129868,
                "children": [
                    {
                        "label": "东昌区",
                        "value": "220502",
                        "cityCode": "220500",
                        "provinceCode": "220000",
                        "lon": 125.9601237078,
                        "lat": 41.677262396551
                    },
                    {
                        "label": "二道江区",
                        "value": "220503",
                        "cityCode": "220500",
                        "provinceCode": "220000",
                        "lon": 126.15628012439,
                        "lat": 41.772625959427
                    },
                    {
                        "label": "通化县",
                        "value": "220521",
                        "cityCode": "220500",
                        "provinceCode": "220000",
                        "lon": 125.85733217991,
                        "lat": 41.729156130979
                    },
                    {
                        "label": "辉南县",
                        "value": "220523",
                        "cityCode": "220500",
                        "provinceCode": "220000",
                        "lon": 126.34272419975,
                        "lat": 42.557948885604
                    },
                    {
                        "label": "柳河县",
                        "value": "220524",
                        "cityCode": "220500",
                        "provinceCode": "220000",
                        "lon": 125.91727588294,
                        "lat": 42.185665412078
                    },
                    {
                        "label": "梅河口市",
                        "value": "220581",
                        "cityCode": "220500",
                        "provinceCode": "220000",
                        "lon": 125.72351563218,
                        "lat": 42.542649892656
                    },
                    {
                        "label": "集安市",
                        "value": "220582",
                        "cityCode": "220500",
                        "provinceCode": "220000",
                        "lon": 125.99899197532,
                        "lat": 41.251410585346
                    }
                ]
            },
            {
                "label": "白山市",
                "value": "220600",
                "provinceCode": "220000",
                "lon": 126.43579767535,
                "lat": 41.945859397018,
                "children": [
                    {
                        "label": "浑江区",
                        "value": "220602",
                        "cityCode": "220600",
                        "provinceCode": "220000",
                        "lon": 126.39664287376,
                        "lat": 41.791642228255
                    },
                    {
                        "label": "江源区",
                        "value": "220605",
                        "cityCode": "220600",
                        "provinceCode": "220000",
                        "lon": 126.82530168684,
                        "lat": 42.078958587922
                    },
                    {
                        "label": "抚松县",
                        "value": "220621",
                        "cityCode": "220600",
                        "provinceCode": "220000",
                        "lon": 127.62393805705,
                        "lat": 42.277909113144
                    },
                    {
                        "label": "靖宇县",
                        "value": "220622",
                        "cityCode": "220600",
                        "provinceCode": "220000",
                        "lon": 126.90246851455,
                        "lat": 42.449966505533
                    },
                    {
                        "label": "长白朝鲜族自治县",
                        "value": "220623",
                        "cityCode": "220600",
                        "provinceCode": "220000",
                        "lon": 127.86435839919,
                        "lat": 41.584709161363
                    },
                    {
                        "label": "临江市",
                        "value": "220681",
                        "cityCode": "220600",
                        "provinceCode": "220000",
                        "lon": 127.19171033688,
                        "lat": 41.816565968987
                    }
                ]
            },
            {
                "label": "松原市",
                "value": "220700",
                "provinceCode": "220000",
                "lon": 124.83299453234,
                "lat": 45.136048970084,
                "children": [
                    {
                        "label": "宁江区",
                        "value": "220702",
                        "cityCode": "220700",
                        "provinceCode": "220000",
                        "lon": 124.86757114896,
                        "lat": 45.292709616884
                    },
                    {
                        "label": "前郭尔罗斯蒙古族自治县",
                        "value": "220721",
                        "cityCode": "220700",
                        "provinceCode": "220000",
                        "lon": 124.48165037618,
                        "lat": 44.86912678932
                    },
                    {
                        "label": "长岭县",
                        "value": "220722",
                        "cityCode": "220700",
                        "provinceCode": "220000",
                        "lon": 123.8665042888,
                        "lat": 44.305644527778
                    },
                    {
                        "label": "乾安县",
                        "value": "220723",
                        "cityCode": "220700",
                        "provinceCode": "220000",
                        "lon": 123.96912337789,
                        "lat": 44.92691448746
                    },
                    {
                        "label": "扶余市",
                        "value": "220781",
                        "cityCode": "220700",
                        "provinceCode": "220000",
                        "lon": 125.60981401543,
                        "lat": 45.171384133354
                    }
                ]
            },
            {
                "label": "白城市",
                "value": "220800",
                "provinceCode": "220000",
                "lon": 122.8407766791,
                "lat": 45.621086275219,
                "children": [
                    {
                        "label": "洮北区",
                        "value": "220802",
                        "cityCode": "220800",
                        "provinceCode": "220000",
                        "lon": 122.78907446427,
                        "lat": 45.623300921069
                    },
                    {
                        "label": "镇赉县",
                        "value": "220821",
                        "cityCode": "220800",
                        "provinceCode": "220000",
                        "lon": 123.45227210722,
                        "lat": 45.956171923796
                    },
                    {
                        "label": "通榆县",
                        "value": "220822",
                        "cityCode": "220800",
                        "provinceCode": "220000",
                        "lon": 122.74529133311,
                        "lat": 44.785716778696
                    },
                    {
                        "label": "洮南市",
                        "value": "220881",
                        "cityCode": "220800",
                        "provinceCode": "220000",
                        "lon": 122.45367732552,
                        "lat": 45.475604304499
                    },
                    {
                        "label": "大安市",
                        "value": "220882",
                        "cityCode": "220800",
                        "provinceCode": "220000",
                        "lon": 123.72371415195,
                        "lat": 45.432438158186
                    }
                ]
            },
            {
                "label": "延边朝鲜族自治州",
                "value": "222400",
                "provinceCode": "220000",
                "lon": 129.48590195816,
                "lat": 42.896413603744,
                "children": [
                    {
                        "label": "延吉市",
                        "value": "222401",
                        "cityCode": "222400",
                        "provinceCode": "220000",
                        "lon": 129.47130153101,
                        "lat": 43.05966660114
                    },
                    {
                        "label": "图们市",
                        "value": "222402",
                        "cityCode": "222400",
                        "provinceCode": "220000",
                        "lon": 129.83431076023,
                        "lat": 43.03054892373
                    },
                    {
                        "label": "敦化市",
                        "value": "222403",
                        "cityCode": "222400",
                        "provinceCode": "220000",
                        "lon": 128.23949928011,
                        "lat": 43.560201838077
                    },
                    {
                        "label": "珲春市",
                        "value": "222404",
                        "cityCode": "222400",
                        "provinceCode": "220000",
                        "lon": 130.70236659184,
                        "lat": 43.074719340737
                    },
                    {
                        "label": "龙井市",
                        "value": "222405",
                        "cityCode": "222400",
                        "provinceCode": "220000",
                        "lon": 129.38381622469,
                        "lat": 42.844249320769
                    },
                    {
                        "label": "和龙市",
                        "value": "222406",
                        "cityCode": "222400",
                        "provinceCode": "220000",
                        "lon": 128.91121076889,
                        "lat": 42.466442285556
                    },
                    {
                        "label": "汪清县",
                        "value": "222424",
                        "cityCode": "222400",
                        "provinceCode": "220000",
                        "lon": 129.95399441696,
                        "lat": 43.540143921506
                    },
                    {
                        "label": "安图县",
                        "value": "222426",
                        "cityCode": "222400",
                        "provinceCode": "220000",
                        "lon": 128.43765169208,
                        "lat": 42.70103301919
                    }
                ]
            }
        ],
        "label": "吉林省",
        "value": "220000"
    },
    {
        "country": "china",
        "lon": 128.04741371499,
        "lat": 47.356591643111,
        "children": [
            {
                "label": "哈尔滨市",
                "value": "230100",
                "provinceCode": "230000",
                "lon": 126.65771685545,
                "lat": 45.773224633239,
                "children": [
                    {
                        "label": "道里区",
                        "value": "230102",
                        "cityCode": "230100",
                        "provinceCode": "230000",
                        "lon": 126.36841846875,
                        "lat": 45.686139243933
                    },
                    {
                        "label": "南岗区",
                        "value": "230103",
                        "cityCode": "230100",
                        "provinceCode": "230000",
                        "lon": 126.59025453924,
                        "lat": 45.66612348458
                    },
                    {
                        "label": "道外区",
                        "value": "230104",
                        "cityCode": "230100",
                        "provinceCode": "230000",
                        "lon": 126.79557490271,
                        "lat": 45.799105971955
                    },
                    {
                        "label": "平房区",
                        "value": "230108",
                        "cityCode": "230100",
                        "provinceCode": "230000",
                        "lon": 126.65771685545,
                        "lat": 45.773224633239
                    },
                    {
                        "label": "松北区",
                        "value": "230109",
                        "cityCode": "230100",
                        "provinceCode": "230000",
                        "lon": 126.45227113075,
                        "lat": 45.941458151669
                    },
                    {
                        "label": "香坊区",
                        "value": "230110",
                        "cityCode": "230100",
                        "provinceCode": "230000",
                        "lon": 126.79204413625,
                        "lat": 45.710449322359
                    },
                    {
                        "label": "呼兰区",
                        "value": "230111",
                        "cityCode": "230100",
                        "provinceCode": "230000",
                        "lon": 126.78775713041,
                        "lat": 46.079315096502
                    },
                    {
                        "label": "阿城区",
                        "value": "230112",
                        "cityCode": "230100",
                        "provinceCode": "230000",
                        "lon": 127.12462182332,
                        "lat": 45.557335189202
                    },
                    {
                        "label": "双城区",
                        "value": "230113",
                        "cityCode": "230100",
                        "provinceCode": "230000",
                        "lon": 126.20893033512,
                        "lat": 45.429694282772
                    },
                    {
                        "label": "依兰县",
                        "value": "230123",
                        "cityCode": "230100",
                        "provinceCode": "230000",
                        "lon": 129.72150310519,
                        "lat": 46.275637068421
                    },
                    {
                        "label": "方正县",
                        "value": "230124",
                        "cityCode": "230100",
                        "provinceCode": "230000",
                        "lon": 128.94941872931,
                        "lat": 45.819769362966
                    },
                    {
                        "label": "宾县",
                        "value": "230125",
                        "cityCode": "230100",
                        "provinceCode": "230000",
                        "lon": 127.66161209688,
                        "lat": 45.783825431221
                    },
                    {
                        "label": "巴彦县",
                        "value": "230126",
                        "cityCode": "230100",
                        "provinceCode": "230000",
                        "lon": 127.32428735381,
                        "lat": 46.340415542078
                    },
                    {
                        "label": "木兰县",
                        "value": "230127",
                        "cityCode": "230100",
                        "provinceCode": "230000",
                        "lon": 127.92983800734,
                        "lat": 46.248171654041
                    },
                    {
                        "label": "通河县",
                        "value": "230128",
                        "cityCode": "230100",
                        "provinceCode": "230000",
                        "lon": 128.7622323166,
                        "lat": 46.247857247283
                    },
                    {
                        "label": "延寿县",
                        "value": "230129",
                        "cityCode": "230100",
                        "provinceCode": "230000",
                        "lon": 128.4639428653,
                        "lat": 45.489520215745
                    },
                    {
                        "label": "尚志市",
                        "value": "230183",
                        "cityCode": "230100",
                        "provinceCode": "230000",
                        "lon": 128.31617023054,
                        "lat": 45.083893011118
                    },
                    {
                        "label": "五常市",
                        "value": "230184",
                        "cityCode": "230100",
                        "provinceCode": "230000",
                        "lon": 127.49111263245,
                        "lat": 44.772543560859
                    }
                ]
            },
            {
                "label": "齐齐哈尔市",
                "value": "230200",
                "provinceCode": "230000",
                "lon": 123.98728894217,
                "lat": 47.347699813366,
                "children": [
                    {
                        "label": "龙沙区",
                        "value": "230202",
                        "cityCode": "230200",
                        "provinceCode": "230000",
                        "lon": 123.94483825767,
                        "lat": 47.301073163863
                    },
                    {
                        "label": "建华区",
                        "value": "230203",
                        "cityCode": "230200",
                        "provinceCode": "230000",
                        "lon": 124.02127875657,
                        "lat": 47.404865706359
                    },
                    {
                        "label": "铁锋区",
                        "value": "230204",
                        "cityCode": "230200",
                        "provinceCode": "230000",
                        "lon": 124.26293093367,
                        "lat": 47.303488569291
                    },
                    {
                        "label": "昂昂溪区",
                        "value": "230205",
                        "cityCode": "230200",
                        "provinceCode": "230000",
                        "lon": 123.97293464894,
                        "lat": 47.104048383337
                    },
                    {
                        "label": "富拉尔基区",
                        "value": "230206",
                        "cityCode": "230200",
                        "provinceCode": "230000",
                        "lon": 123.57199835236,
                        "lat": 47.228951853753
                    },
                    {
                        "label": "碾子山区",
                        "value": "230207",
                        "cityCode": "230200",
                        "provinceCode": "230000",
                        "lon": 122.93233528482,
                        "lat": 47.585869259054
                    },
                    {
                        "label": "梅里斯达斡尔族区",
                        "value": "230208",
                        "cityCode": "230200",
                        "provinceCode": "230000",
                        "lon": 124.00548681519,
                        "lat": 47.583080065198
                    },
                    {
                        "label": "龙江县",
                        "value": "230221",
                        "cityCode": "230200",
                        "provinceCode": "230000",
                        "lon": 123.08910277315,
                        "lat": 47.258895031048
                    },
                    {
                        "label": "依安县",
                        "value": "230223",
                        "cityCode": "230200",
                        "provinceCode": "230000",
                        "lon": 125.29463341876,
                        "lat": 47.70687276451
                    },
                    {
                        "label": "泰来县",
                        "value": "230224",
                        "cityCode": "230200",
                        "provinceCode": "230000",
                        "lon": 123.55804791893,
                        "lat": 46.603290111422
                    },
                    {
                        "label": "甘南县",
                        "value": "230225",
                        "cityCode": "230200",
                        "provinceCode": "230000",
                        "lon": 123.84689963764,
                        "lat": 48.011583079958
                    },
                    {
                        "label": "富裕县",
                        "value": "230227",
                        "cityCode": "230200",
                        "provinceCode": "230000",
                        "lon": 124.57174679759,
                        "lat": 47.66582009392
                    },
                    {
                        "label": "克山县",
                        "value": "230229",
                        "cityCode": "230200",
                        "provinceCode": "230000",
                        "lon": 125.70647087609,
                        "lat": 48.16709075607
                    },
                    {
                        "label": "克东县",
                        "value": "230230",
                        "cityCode": "230200",
                        "provinceCode": "230000",
                        "lon": 126.35213605416,
                        "lat": 48.009015428979
                    },
                    {
                        "label": "拜泉县",
                        "value": "230231",
                        "cityCode": "230200",
                        "provinceCode": "230000",
                        "lon": 126.02178604309,
                        "lat": 47.59225565379
                    },
                    {
                        "label": "讷河市",
                        "value": "230281",
                        "cityCode": "230200",
                        "provinceCode": "230000",
                        "lon": 125.07655310394,
                        "lat": 48.481453388811
                    }
                ]
            },
            {
                "label": "鸡西市",
                "value": "230300",
                "provinceCode": "230000",
                "lon": 130.94176727325,
                "lat": 45.321539886551,
                "children": [
                    {
                        "label": "鸡冠区",
                        "value": "230302",
                        "cityCode": "230300",
                        "provinceCode": "230000",
                        "lon": 130.95993684965,
                        "lat": 45.307610212685
                    },
                    {
                        "label": "恒山区",
                        "value": "230303",
                        "cityCode": "230300",
                        "provinceCode": "230000",
                        "lon": 130.91626680525,
                        "lat": 45.138570833129
                    },
                    {
                        "label": "滴道区",
                        "value": "230304",
                        "cityCode": "230300",
                        "provinceCode": "230000",
                        "lon": 130.73483586173,
                        "lat": 45.354342346984
                    },
                    {
                        "label": "梨树区",
                        "value": "230305",
                        "cityCode": "230300",
                        "provinceCode": "230000",
                        "lon": 130.76523847274,
                        "lat": 45.097064304174
                    },
                    {
                        "label": "城子河区",
                        "value": "230306",
                        "cityCode": "230300",
                        "provinceCode": "230000",
                        "lon": 131.02770429868,
                        "lat": 45.379689760283
                    },
                    {
                        "label": "麻山区",
                        "value": "230307",
                        "cityCode": "230300",
                        "provinceCode": "230000",
                        "lon": 130.56688686698,
                        "lat": 45.205825834254
                    },
                    {
                        "label": "鸡东县",
                        "value": "230321",
                        "cityCode": "230300",
                        "provinceCode": "230000",
                        "lon": 131.22565372007,
                        "lat": 45.273228207889
                    },
                    {
                        "label": "虎林市",
                        "value": "230381",
                        "cityCode": "230300",
                        "provinceCode": "230000",
                        "lon": 133.12110607261,
                        "lat": 45.997276203515
                    },
                    {
                        "label": "密山市",
                        "value": "230382",
                        "cityCode": "230300",
                        "provinceCode": "230000",
                        "lon": 132.17656238974,
                        "lat": 45.469765426971
                    }
                ]
            },
            {
                "label": "鹤岗市",
                "value": "230400",
                "provinceCode": "230000",
                "lon": 130.29247205063,
                "lat": 47.338665903727,
                "children": [
                    {
                        "label": "向阳区",
                        "value": "230402",
                        "cityCode": "230400",
                        "provinceCode": "230000",
                        "lon": 130.30123313444,
                        "lat": 47.350919505165
                    },
                    {
                        "label": "工农区",
                        "value": "230403",
                        "cityCode": "230400",
                        "provinceCode": "230000",
                        "lon": 130.27719618578,
                        "lat": 47.327770216306
                    },
                    {
                        "label": "南山区",
                        "value": "230404",
                        "cityCode": "230400",
                        "provinceCode": "230000",
                        "lon": 130.28176460828,
                        "lat": 47.298820938262
                    },
                    {
                        "label": "兴安区",
                        "value": "230405",
                        "cityCode": "230400",
                        "provinceCode": "230000",
                        "lon": 130.24437533634,
                        "lat": 47.23371006572
                    },
                    {
                        "label": "东山区",
                        "value": "230406",
                        "cityCode": "230400",
                        "provinceCode": "230000",
                        "lon": 130.24750143952,
                        "lat": 47.483737355287
                    },
                    {
                        "label": "兴山区",
                        "value": "230407",
                        "cityCode": "230400",
                        "provinceCode": "230000",
                        "lon": 130.32664592783,
                        "lat": 47.393964799831
                    },
                    {
                        "label": "萝北县",
                        "value": "230421",
                        "cityCode": "230400",
                        "provinceCode": "230000",
                        "lon": 130.76133324012,
                        "lat": 47.74693489479
                    },
                    {
                        "label": "绥滨县",
                        "value": "230422",
                        "cityCode": "230400",
                        "provinceCode": "230000",
                        "lon": 131.85659492327,
                        "lat": 47.483007019685
                    }
                ]
            },
            {
                "label": "双鸭山市",
                "value": "230500",
                "provinceCode": "230000",
                "lon": 131.17140173958,
                "lat": 46.655102062482,
                "children": [
                    {
                        "label": "尖山区",
                        "value": "230502",
                        "cityCode": "230500",
                        "provinceCode": "230000",
                        "lon": 131.17851398363,
                        "lat": 46.658524603822
                    },
                    {
                        "label": "岭东区",
                        "value": "230503",
                        "cityCode": "230500",
                        "provinceCode": "230000",
                        "lon": 131.24602424779,
                        "lat": 46.459521565337
                    },
                    {
                        "label": "四方台区",
                        "value": "230505",
                        "cityCode": "230500",
                        "provinceCode": "230000",
                        "lon": 131.30870692831,
                        "lat": 46.669775046181
                    },
                    {
                        "label": "宝山区",
                        "value": "230506",
                        "cityCode": "230500",
                        "provinceCode": "230000",
                        "lon": 131.56483592752,
                        "lat": 46.5292279819
                    },
                    {
                        "label": "集贤县",
                        "value": "230521",
                        "cityCode": "230500",
                        "provinceCode": "230000",
                        "lon": 131.15055588277,
                        "lat": 46.818437079003
                    },
                    {
                        "label": "友谊县",
                        "value": "230522",
                        "cityCode": "230500",
                        "provinceCode": "230000",
                        "lon": 131.8549989164,
                        "lat": 46.788592814562
                    },
                    {
                        "label": "宝清县",
                        "value": "230523",
                        "cityCode": "230500",
                        "provinceCode": "230000",
                        "lon": 132.40927864827,
                        "lat": 46.409383212717
                    },
                    {
                        "label": "饶河县",
                        "value": "230524",
                        "cityCode": "230500",
                        "provinceCode": "230000",
                        "lon": 133.7292586825,
                        "lat": 47.072628542857
                    }
                ]
            },
            {
                "label": "大庆市",
                "value": "230600",
                "provinceCode": "230000",
                "lon": 125.02183973021,
                "lat": 46.596709020008,
                "children": [
                    {
                        "label": "萨尔图区",
                        "value": "230602",
                        "cityCode": "230600",
                        "provinceCode": "230000",
                        "lon": 125.0424515298,
                        "lat": 46.663311354817
                    },
                    {
                        "label": "龙凤区",
                        "value": "230603",
                        "cityCode": "230600",
                        "provinceCode": "230000",
                        "lon": 125.14176665986,
                        "lat": 46.53556824178
                    },
                    {
                        "label": "让胡路区",
                        "value": "230604",
                        "cityCode": "230600",
                        "provinceCode": "230000",
                        "lon": 124.83842676542,
                        "lat": 46.729160383306
                    },
                    {
                        "label": "红岗区",
                        "value": "230605",
                        "cityCode": "230600",
                        "provinceCode": "230000",
                        "lon": 124.91428498269,
                        "lat": 46.420778588396
                    },
                    {
                        "label": "大同区",
                        "value": "230606",
                        "cityCode": "230600",
                        "provinceCode": "230000",
                        "lon": 124.69907739268,
                        "lat": 46.070051001663
                    },
                    {
                        "label": "肇州县",
                        "value": "230621",
                        "cityCode": "230600",
                        "provinceCode": "230000",
                        "lon": 125.3089692416,
                        "lat": 45.837071583611
                    },
                    {
                        "label": "肇源县",
                        "value": "230622",
                        "cityCode": "230600",
                        "provinceCode": "230000",
                        "lon": 124.76904364094,
                        "lat": 45.647200471445
                    },
                    {
                        "label": "林甸县",
                        "value": "230623",
                        "cityCode": "230600",
                        "provinceCode": "230000",
                        "lon": 124.8967829092,
                        "lat": 47.159692937417
                    },
                    {
                        "label": "杜尔伯特蒙古族自治县",
                        "value": "230624",
                        "cityCode": "230600",
                        "provinceCode": "230000",
                        "lon": 124.24651264677,
                        "lat": 46.561613536188
                    }
                ]
            },
            {
                "label": "伊春市",
                "value": "230700",
                "provinceCode": "230000",
                "lon": 128.91076597792,
                "lat": 47.734685075079,
                "children": [
                    {
                        "label": "友好区",
                        "value": "230719",
                        "cityCode": "230700",
                        "provinceCode": "230000",
                        "lon": 128.46596407584,
                        "lat": 48.128001664241
                    },
                    {
                        "label": "嘉荫县",
                        "value": "230722",
                        "cityCode": "230700",
                        "provinceCode": "230000",
                        "lon": 130.00824972425,
                        "lat": 48.769519787363
                    },
                    {
                        "label": "铁力市",
                        "value": "230781",
                        "cityCode": "230700",
                        "provinceCode": "230000",
                        "lon": 128.55251746527,
                        "lat": 46.866328682376
                    }
                ]
            },
            {
                "label": "佳木斯市",
                "value": "230800",
                "provinceCode": "230000",
                "lon": 130.28473458595,
                "lat": 46.81377960474,
                "children": [
                    {
                        "label": "向阳区",
                        "value": "230803",
                        "cityCode": "230800",
                        "provinceCode": "230000",
                        "lon": 130.30123313444,
                        "lat": 47.350919505165
                    },
                    {
                        "label": "前进区",
                        "value": "230804",
                        "cityCode": "230800",
                        "provinceCode": "230000",
                        "lon": 130.39791016311,
                        "lat": 46.809721977545
                    },
                    {
                        "label": "东风区",
                        "value": "230805",
                        "cityCode": "230800",
                        "provinceCode": "230000",
                        "lon": 130.51740321928,
                        "lat": 46.894910414945
                    },
                    {
                        "label": "郊区",
                        "value": "230811",
                        "cityCode": "230800",
                        "provinceCode": "230000",
                        "lon": 130.26396912133,
                        "lat": 46.775887398703
                    },
                    {
                        "label": "桦南县",
                        "value": "230822",
                        "cityCode": "230800",
                        "provinceCode": "230000",
                        "lon": 130.63701542096,
                        "lat": 46.306671717134
                    },
                    {
                        "label": "桦川县",
                        "value": "230826",
                        "cityCode": "230800",
                        "provinceCode": "230000",
                        "lon": 130.9630176143,
                        "lat": 46.989258424239
                    },
                    {
                        "label": "汤原县",
                        "value": "230828",
                        "cityCode": "230800",
                        "provinceCode": "230000",
                        "lon": 130.07240618628,
                        "lat": 46.988318509463
                    },
                    {
                        "label": "同江市",
                        "value": "230881",
                        "cityCode": "230800",
                        "provinceCode": "230000",
                        "lon": 133.27332836382,
                        "lat": 47.833684686564
                    },
                    {
                        "label": "富锦市",
                        "value": "230882",
                        "cityCode": "230800",
                        "provinceCode": "230000",
                        "lon": 132.53900135629,
                        "lat": 47.170672548244
                    },
                    {
                        "label": "抚远市",
                        "value": "230883",
                        "cityCode": "230800",
                        "provinceCode": "230000",
                        "lon": 134.39306261929,
                        "lat": 47.955162063941
                    }
                ]
            },
            {
                "label": "七台河市",
                "value": "230900",
                "provinceCode": "230000",
                "lon": 131.01904804712,
                "lat": 45.77500536864,
                "children": [
                    {
                        "label": "新兴区",
                        "value": "230902",
                        "cityCode": "230900",
                        "provinceCode": "230000",
                        "lon": 130.89318834856,
                        "lat": 45.8134935903
                    },
                    {
                        "label": "桃山区",
                        "value": "230903",
                        "cityCode": "230900",
                        "provinceCode": "230000",
                        "lon": 130.9925031193,
                        "lat": 45.770092507257
                    },
                    {
                        "label": "茄子河区",
                        "value": "230904",
                        "cityCode": "230900",
                        "provinceCode": "230000",
                        "lon": 131.47522375459,
                        "lat": 45.883167710316
                    },
                    {
                        "label": "勃利县",
                        "value": "230921",
                        "cityCode": "230900",
                        "provinceCode": "230000",
                        "lon": 130.81816940292,
                        "lat": 45.930545419106
                    }
                ]
            },
            {
                "label": "牡丹江市",
                "value": "231000",
                "provinceCode": "230000",
                "lon": 129.60803539564,
                "lat": 44.588521152783,
                "children": [
                    {
                        "label": "东安区",
                        "value": "231002",
                        "cityCode": "231000",
                        "provinceCode": "230000",
                        "lon": 129.86044675749,
                        "lat": 44.408404499377
                    },
                    {
                        "label": "阳明区",
                        "value": "231003",
                        "cityCode": "231000",
                        "provinceCode": "230000",
                        "lon": 129.78391508059,
                        "lat": 44.58797510378
                    },
                    {
                        "label": "爱民区",
                        "value": "231004",
                        "cityCode": "231000",
                        "provinceCode": "230000",
                        "lon": 129.54456588932,
                        "lat": 44.685920648737
                    },
                    {
                        "label": "西安区",
                        "value": "231005",
                        "cityCode": "231000",
                        "provinceCode": "230000",
                        "lon": 129.58492424063,
                        "lat": 44.491714149262
                    },
                    {
                        "label": "林口县",
                        "value": "231025",
                        "cityCode": "231000",
                        "provinceCode": "230000",
                        "lon": 130.02318050895,
                        "lat": 45.396101732571
                    },
                    {
                        "label": "绥芬河市",
                        "value": "231081",
                        "cityCode": "231000",
                        "provinceCode": "230000",
                        "lon": 131.10245653286,
                        "lat": 44.408005174587
                    },
                    {
                        "label": "海林市",
                        "value": "231083",
                        "cityCode": "231000",
                        "provinceCode": "230000",
                        "lon": 129.2214141346,
                        "lat": 44.903617439366
                    },
                    {
                        "label": "宁安市",
                        "value": "231084",
                        "cityCode": "231000",
                        "provinceCode": "230000",
                        "lon": 129.21531714201,
                        "lat": 44.058017259883
                    },
                    {
                        "label": "穆棱市",
                        "value": "231085",
                        "cityCode": "231000",
                        "provinceCode": "230000",
                        "lon": 130.39552588753,
                        "lat": 44.576869855321
                    },
                    {
                        "label": "东宁市",
                        "value": "231086",
                        "cityCode": "231000",
                        "provinceCode": "230000",
                        "lon": 130.82976155466,
                        "lat": 44.085228695883
                    }
                ]
            },
            {
                "label": "黑河市",
                "value": "231100",
                "provinceCode": "230000",
                "lon": 127.50083029524,
                "lat": 50.250690090738,
                "children": [
                    {
                        "label": "爱辉区",
                        "value": "231102",
                        "cityCode": "231100",
                        "provinceCode": "230000",
                        "lon": 126.76426227527,
                        "lat": 50.21824505447
                    },
                    {
                        "label": "逊克县",
                        "value": "231123",
                        "cityCode": "231100",
                        "provinceCode": "230000",
                        "lon": 128.37087710653,
                        "lat": 48.886739946849
                    },
                    {
                        "label": "孙吴县",
                        "value": "231124",
                        "cityCode": "231100",
                        "provinceCode": "230000",
                        "lon": 127.31667232079,
                        "lat": 49.370655539474
                    },
                    {
                        "label": "北安市",
                        "value": "231181",
                        "cityCode": "231100",
                        "provinceCode": "230000",
                        "lon": 127.11154600578,
                        "lat": 48.115945723953
                    },
                    {
                        "label": "五大连池市",
                        "value": "231182",
                        "cityCode": "231100",
                        "provinceCode": "230000",
                        "lon": 126.63450133401,
                        "lat": 48.749166077372
                    }
                ]
            },
            {
                "label": "绥化市",
                "value": "231200",
                "provinceCode": "230000",
                "lon": 126.98909457163,
                "lat": 46.646063926997,
                "children": [
                    {
                        "label": "北林区",
                        "value": "231202",
                        "cityCode": "231200",
                        "provinceCode": "230000",
                        "lon": 126.95786274455,
                        "lat": 46.747536778515
                    },
                    {
                        "label": "望奎县",
                        "value": "231221",
                        "cityCode": "231200",
                        "provinceCode": "230000",
                        "lon": 126.59302313008,
                        "lat": 46.869481261175
                    },
                    {
                        "label": "兰西县",
                        "value": "231222",
                        "cityCode": "231200",
                        "provinceCode": "230000",
                        "lon": 126.21354291791,
                        "lat": 46.358350137762
                    },
                    {
                        "label": "青冈县",
                        "value": "231223",
                        "cityCode": "231200",
                        "provinceCode": "230000",
                        "lon": 125.96052417701,
                        "lat": 46.846560509098
                    },
                    {
                        "label": "庆安县",
                        "value": "231224",
                        "cityCode": "231200",
                        "provinceCode": "230000",
                        "lon": 127.84448982607,
                        "lat": 47.070365971064
                    },
                    {
                        "label": "明水县",
                        "value": "231225",
                        "cityCode": "231200",
                        "provinceCode": "230000",
                        "lon": 125.84126811337,
                        "lat": 47.201247327838
                    },
                    {
                        "label": "绥棱县",
                        "value": "231226",
                        "cityCode": "231200",
                        "provinceCode": "230000",
                        "lon": 127.71941343154,
                        "lat": 47.584142706971
                    },
                    {
                        "label": "安达市",
                        "value": "231281",
                        "cityCode": "231200",
                        "provinceCode": "230000",
                        "lon": 125.38455235789,
                        "lat": 46.535467128182
                    },
                    {
                        "label": "肇东市",
                        "value": "231282",
                        "cityCode": "231200",
                        "provinceCode": "230000",
                        "lon": 125.84973124624,
                        "lat": 46.009305917541
                    },
                    {
                        "label": "海伦市",
                        "value": "231283",
                        "cityCode": "231200",
                        "provinceCode": "230000",
                        "lon": 126.89712924928,
                        "lat": 47.447269604837
                    }
                ]
            },
            {
                "label": "大兴安岭地区",
                "value": "232700",
                "provinceCode": "230000",
                "lon": 124.19610419017,
                "lat": 51.991788968014,
                "children": [
                    {
                        "label": "呼玛县",
                        "value": "232721",
                        "cityCode": "232700",
                        "provinceCode": "230000",
                        "lon": 124.91200234302,
                        "lat": 51.813130087054
                    },
                    {
                        "label": "塔河县",
                        "value": "232722",
                        "cityCode": "232700",
                        "provinceCode": "230000",
                        "lon": 124.64020335752,
                        "lat": 52.716506252523
                    }
                ]
            }
        ],
        "label": "黑龙江省",
        "value": "230000"
    },
    {
        "country": "china",
        "lon": 121.48789948569,
        "lat": 31.249161710015,
        "children": [
            {
                "label": "市辖区",
                "value": "310100",
                "provinceCode": "310000",
                "lon": 121.48789948569,
                "lat": 31.249161710015,
                "children": [
                    {
                        "label": "黄浦区",
                        "value": "310101",
                        "cityCode": "310100",
                        "provinceCode": "310000",
                        "lon": 121.49607206403,
                        "lat": 31.227203440769
                    },
                    {
                        "label": "徐汇区",
                        "value": "310104",
                        "cityCode": "310100",
                        "provinceCode": "310000",
                        "lon": 121.44623500473,
                        "lat": 31.169152089592
                    },
                    {
                        "label": "长宁区",
                        "value": "310105",
                        "cityCode": "310100",
                        "provinceCode": "310000",
                        "lon": 121.38761610866,
                        "lat": 31.213301496814
                    },
                    {
                        "label": "静安区",
                        "value": "310106",
                        "cityCode": "310100",
                        "provinceCode": "310000",
                        "lon": 121.454755557,
                        "lat": 31.235380803488
                    },
                    {
                        "label": "普陀区",
                        "value": "310107",
                        "cityCode": "310100",
                        "provinceCode": "310000",
                        "lon": 121.39844294375,
                        "lat": 31.263742929076
                    },
                    {
                        "label": "虹口区",
                        "value": "310109",
                        "cityCode": "310100",
                        "provinceCode": "310000",
                        "lon": 121.49191854079,
                        "lat": 31.282497228987
                    },
                    {
                        "label": "杨浦区",
                        "value": "310110",
                        "cityCode": "310100",
                        "provinceCode": "310000",
                        "lon": 121.53571659963,
                        "lat": 31.304510479542
                    },
                    {
                        "label": "闵行区",
                        "value": "310112",
                        "cityCode": "310100",
                        "provinceCode": "310000",
                        "lon": 121.42502428093,
                        "lat": 31.093537540382
                    },
                    {
                        "label": "宝山区",
                        "value": "310113",
                        "cityCode": "310100",
                        "provinceCode": "310000",
                        "lon": 121.40904121845,
                        "lat": 31.398622694467
                    },
                    {
                        "label": "嘉定区",
                        "value": "310114",
                        "cityCode": "310100",
                        "provinceCode": "310000",
                        "lon": 121.25101353756,
                        "lat": 31.364338055434
                    },
                    {
                        "label": "浦东新区",
                        "value": "310115",
                        "cityCode": "310100",
                        "provinceCode": "310000",
                        "lon": 121.63848131409,
                        "lat": 31.230895349134
                    },
                    {
                        "label": "金山区",
                        "value": "310116",
                        "cityCode": "310100",
                        "provinceCode": "310000",
                        "lon": 121.24840817975,
                        "lat": 30.835080777082
                    },
                    {
                        "label": "松江区",
                        "value": "310117",
                        "cityCode": "310100",
                        "provinceCode": "310000",
                        "lon": 121.22679050142,
                        "lat": 31.021244628099
                    },
                    {
                        "label": "青浦区",
                        "value": "310118",
                        "cityCode": "310100",
                        "provinceCode": "310000",
                        "lon": 121.09142524282,
                        "lat": 31.130862397997
                    },
                    {
                        "label": "奉贤区",
                        "value": "310120",
                        "cityCode": "310100",
                        "provinceCode": "310000",
                        "lon": 121.56064167963,
                        "lat": 30.915122452606
                    },
                    {
                        "label": "崇明区",
                        "value": "310151",
                        "cityCode": "310100",
                        "provinceCode": "310000",
                        "lon": 121.56909950183,
                        "lat": 31.52860136251
                    }
                ]
            }
        ],
        "label": "上海市",
        "value": "310000"
    },
    {
        "country": "china",
        "lon": 119.36848893836,
        "lat": 33.013797169954,
        "children": [
            {
                "label": "南京市",
                "value": "320100",
                "provinceCode": "320000",
                "lon": 118.77807440803,
                "lat": 32.057235501806,
                "children": [
                    {
                        "label": "玄武区",
                        "value": "320102",
                        "cityCode": "320100",
                        "provinceCode": "320000",
                        "lon": 118.84893734485,
                        "lat": 32.07176566029
                    },
                    {
                        "label": "秦淮区",
                        "value": "320104",
                        "cityCode": "320100",
                        "provinceCode": "320000",
                        "lon": 118.81722069709,
                        "lat": 32.007969136143
                    },
                    {
                        "label": "建邺区",
                        "value": "320105",
                        "cityCode": "320100",
                        "provinceCode": "320000",
                        "lon": 118.71334176065,
                        "lat": 32.012518207527
                    },
                    {
                        "label": "鼓楼区",
                        "value": "320106",
                        "cityCode": "320100",
                        "provinceCode": "320000",
                        "lon": 118.76505691316,
                        "lat": 32.068604458801
                    },
                    {
                        "label": "浦口区",
                        "value": "320111",
                        "cityCode": "320100",
                        "provinceCode": "320000",
                        "lon": 118.56912478518,
                        "lat": 32.05906230054
                    },
                    {
                        "label": "栖霞区",
                        "value": "320113",
                        "cityCode": "320100",
                        "provinceCode": "320000",
                        "lon": 118.96372475912,
                        "lat": 32.16942425653
                    },
                    {
                        "label": "雨花台区",
                        "value": "320114",
                        "cityCode": "320100",
                        "provinceCode": "320000",
                        "lon": 118.72197857905,
                        "lat": 31.954552108797
                    },
                    {
                        "label": "江宁区",
                        "value": "320115",
                        "cityCode": "320100",
                        "provinceCode": "320000",
                        "lon": 118.83541822485,
                        "lat": 31.863971430281
                    },
                    {
                        "label": "六合区",
                        "value": "320116",
                        "cityCode": "320100",
                        "provinceCode": "320000",
                        "lon": 118.84816604456,
                        "lat": 32.400640243232
                    },
                    {
                        "label": "溧水区",
                        "value": "320117",
                        "cityCode": "320100",
                        "provinceCode": "320000",
                        "lon": 119.03955092741,
                        "lat": 31.59098879063
                    },
                    {
                        "label": "高淳区",
                        "value": "320118",
                        "cityCode": "320100",
                        "provinceCode": "320000",
                        "lon": 118.9648579166,
                        "lat": 31.363673442531
                    }
                ]
            },
            {
                "label": "无锡市",
                "value": "320200",
                "provinceCode": "320000",
                "lon": 120.30545590054,
                "lat": 31.570037451923,
                "children": [
                    {
                        "label": "锡山区",
                        "value": "320205",
                        "cityCode": "320200",
                        "provinceCode": "320000",
                        "lon": 120.49100821099,
                        "lat": 31.615587416408
                    },
                    {
                        "label": "惠山区",
                        "value": "320206",
                        "cityCode": "320200",
                        "provinceCode": "320000",
                        "lon": 120.21529447552,
                        "lat": 31.656376333546
                    },
                    {
                        "label": "滨湖区",
                        "value": "320211",
                        "cityCode": "320200",
                        "provinceCode": "320000",
                        "lon": 120.24850182101,
                        "lat": 31.466578565031
                    },
                    {
                        "label": "梁溪区",
                        "value": "320213",
                        "cityCode": "320200",
                        "provinceCode": "320000",
                        "lon": 120.30311934862,
                        "lat": 31.57842412658
                    },
                    {
                        "label": "新吴区",
                        "value": "320214",
                        "cityCode": "320200",
                        "provinceCode": "320000",
                        "lon": 120.43882764569,
                        "lat": 31.519399416228
                    },
                    {
                        "label": "江阴市",
                        "value": "320281",
                        "cityCode": "320200",
                        "provinceCode": "320000",
                        "lon": 120.31067896716,
                        "lat": 31.837425422051
                    },
                    {
                        "label": "宜兴市",
                        "value": "320282",
                        "cityCode": "320200",
                        "provinceCode": "320000",
                        "lon": 119.79026529658,
                        "lat": 31.362244911879
                    }
                ]
            },
            {
                "label": "徐州市",
                "value": "320300",
                "provinceCode": "320000",
                "lon": 117.18810662318,
                "lat": 34.271553431092,
                "children": [
                    {
                        "label": "鼓楼区",
                        "value": "320302",
                        "cityCode": "320300",
                        "provinceCode": "320000",
                        "lon": 118.76505691316,
                        "lat": 32.068604458801
                    },
                    {
                        "label": "云龙区",
                        "value": "320303",
                        "cityCode": "320300",
                        "provinceCode": "320000",
                        "lon": 117.27617608552,
                        "lat": 34.22248667954
                    },
                    {
                        "label": "贾汪区",
                        "value": "320305",
                        "cityCode": "320300",
                        "provinceCode": "320000",
                        "lon": 117.49824588411,
                        "lat": 34.410527773608
                    },
                    {
                        "label": "泉山区",
                        "value": "320311",
                        "cityCode": "320300",
                        "provinceCode": "320000",
                        "lon": 117.1755840183,
                        "lat": 34.241946575704
                    },
                    {
                        "label": "铜山区",
                        "value": "320312",
                        "cityCode": "320300",
                        "provinceCode": "320000",
                        "lon": 117.22940160979,
                        "lat": 34.348981539618
                    },
                    {
                        "label": "丰县",
                        "value": "320321",
                        "cityCode": "320300",
                        "provinceCode": "320000",
                        "lon": 116.61573315373,
                        "lat": 34.695773328628
                    },
                    {
                        "label": "沛县",
                        "value": "320322",
                        "cityCode": "320300",
                        "provinceCode": "320000",
                        "lon": 116.91146840815,
                        "lat": 34.700648164694
                    },
                    {
                        "label": "睢宁县",
                        "value": "320324",
                        "cityCode": "320300",
                        "provinceCode": "320000",
                        "lon": 117.89036426969,
                        "lat": 33.946570640866
                    },
                    {
                        "label": "新沂市",
                        "value": "320381",
                        "cityCode": "320300",
                        "provinceCode": "320000",
                        "lon": 118.34412147229,
                        "lat": 34.284442736534
                    },
                    {
                        "label": "邳州市",
                        "value": "320382",
                        "cityCode": "320300",
                        "provinceCode": "320000",
                        "lon": 117.90306004276,
                        "lat": 34.402946394877
                    }
                ]
            },
            {
                "label": "常州市",
                "value": "320400",
                "provinceCode": "320000",
                "lon": 119.98186101346,
                "lat": 31.771396744684,
                "children": [
                    {
                        "label": "天宁区",
                        "value": "320402",
                        "cityCode": "320400",
                        "provinceCode": "320000",
                        "lon": 120.00176576036,
                        "lat": 31.777803256373
                    },
                    {
                        "label": "钟楼区",
                        "value": "320404",
                        "cityCode": "320400",
                        "provinceCode": "320000",
                        "lon": 119.91243874189,
                        "lat": 31.79851137455
                    },
                    {
                        "label": "新北区",
                        "value": "320411",
                        "cityCode": "320400",
                        "provinceCode": "320000",
                        "lon": 119.90315390841,
                        "lat": 31.939946043961
                    },
                    {
                        "label": "武进区",
                        "value": "320412",
                        "cityCode": "320400",
                        "provinceCode": "320000",
                        "lon": 119.94343167667,
                        "lat": 31.672903473648
                    },
                    {
                        "label": "金坛区",
                        "value": "320413",
                        "cityCode": "320400",
                        "provinceCode": "320000",
                        "lon": 119.53415121469,
                        "lat": 31.728356462124
                    },
                    {
                        "label": "溧阳市",
                        "value": "320481",
                        "cityCode": "320400",
                        "provinceCode": "320000",
                        "lon": 119.38283894831,
                        "lat": 31.425241931012
                    }
                ]
            },
            {
                "label": "苏州市",
                "value": "320500",
                "provinceCode": "320000",
                "lon": 120.61990711549,
                "lat": 31.317987367952,
                "children": [
                    {
                        "label": "虎丘区",
                        "value": "320505",
                        "cityCode": "320500",
                        "provinceCode": "320000",
                        "lon": 120.47842441781,
                        "lat": 31.351869327642
                    },
                    {
                        "label": "吴中区",
                        "value": "320506",
                        "cityCode": "320500",
                        "provinceCode": "320000",
                        "lon": 120.36577637267,
                        "lat": 31.179869740166
                    },
                    {
                        "label": "相城区",
                        "value": "320507",
                        "cityCode": "320500",
                        "provinceCode": "320000",
                        "lon": 120.64685298258,
                        "lat": 31.450775031111
                    },
                    {
                        "label": "姑苏区",
                        "value": "320508",
                        "cityCode": "320500",
                        "provinceCode": "320000",
                        "lon": 120.61427934735,
                        "lat": 31.326429631222
                    },
                    {
                        "label": "吴江区",
                        "value": "320509",
                        "cityCode": "320500",
                        "provinceCode": "320000",
                        "lon": 120.65734994979,
                        "lat": 31.000093080624
                    },
                    {
                        "label": "常熟市",
                        "value": "320581",
                        "cityCode": "320500",
                        "provinceCode": "320000",
                        "lon": 120.83148596516,
                        "lat": 31.669446047798
                    },
                    {
                        "label": "张家港市",
                        "value": "320582",
                        "cityCode": "320500",
                        "provinceCode": "320000",
                        "lon": 120.62727852834,
                        "lat": 31.907812337769
                    },
                    {
                        "label": "昆山市",
                        "value": "320583",
                        "cityCode": "320500",
                        "provinceCode": "320000",
                        "lon": 120.96580778411,
                        "lat": 31.328936795497
                    },
                    {
                        "label": "太仓市",
                        "value": "320585",
                        "cityCode": "320500",
                        "provinceCode": "320000",
                        "lon": 121.15897767248,
                        "lat": 31.571904296415
                    }
                ]
            },
            {
                "label": "南通市",
                "value": "320600",
                "provinceCode": "320000",
                "lon": 120.87380095093,
                "lat": 32.014664540823,
                "children": [
                    {
                        "label": "崇川区",
                        "value": "320602",
                        "cityCode": "320600",
                        "provinceCode": "320000",
                        "lon": 120.88759857738,
                        "lat": 31.962660695271
                    },
                    {
                        "label": "港闸区",
                        "value": "320611",
                        "cityCode": "320600",
                        "provinceCode": "320000",
                        "lon": 120.82387483505,
                        "lat": 32.071256422788
                    },
                    {
                        "label": "通州区",
                        "value": "320612",
                        "cityCode": "320600",
                        "provinceCode": "320000",
                        "lon": 121.07249442751,
                        "lat": 32.067098964254
                    },
                    {
                        "label": "如东县",
                        "value": "320623",
                        "cityCode": "320600",
                        "provinceCode": "320000",
                        "lon": 121.05924442185,
                        "lat": 32.387662145338
                    },
                    {
                        "label": "启东市",
                        "value": "320681",
                        "cityCode": "320600",
                        "provinceCode": "320000",
                        "lon": 121.67882229665,
                        "lat": 31.871301838383
                    },
                    {
                        "label": "如皋市",
                        "value": "320682",
                        "cityCode": "320600",
                        "provinceCode": "320000",
                        "lon": 120.580143985,
                        "lat": 32.273616272606
                    },
                    {
                        "label": "海门市",
                        "value": "320684",
                        "cityCode": "320600",
                        "provinceCode": "320000",
                        "lon": 121.31247014367,
                        "lat": 31.956038868177
                    }
                ]
            },
            {
                "label": "连云港市",
                "value": "320700",
                "provinceCode": "320000",
                "lon": 119.17387221742,
                "lat": 34.60154896701,
                "children": [
                    {
                        "label": "连云区",
                        "value": "320703",
                        "cityCode": "320700",
                        "provinceCode": "320000",
                        "lon": 119.46701669742,
                        "lat": 34.638921829102
                    },
                    {
                        "label": "海州区",
                        "value": "320706",
                        "cityCode": "320700",
                        "provinceCode": "320000",
                        "lon": 119.16219625272,
                        "lat": 34.514160144549
                    },
                    {
                        "label": "赣榆区",
                        "value": "320707",
                        "cityCode": "320700",
                        "provinceCode": "320000",
                        "lon": 119.07859315245,
                        "lat": 34.921103960847
                    },
                    {
                        "label": "东海县",
                        "value": "320722",
                        "cityCode": "320700",
                        "provinceCode": "320000",
                        "lon": 118.79230964695,
                        "lat": 34.556383225488
                    },
                    {
                        "label": "灌云县",
                        "value": "320723",
                        "cityCode": "320700",
                        "provinceCode": "320000",
                        "lon": 119.39277519918,
                        "lat": 34.406832167104
                    },
                    {
                        "label": "灌南县",
                        "value": "320724",
                        "cityCode": "320700",
                        "provinceCode": "320000",
                        "lon": 119.44639688138,
                        "lat": 34.175194871764
                    }
                ]
            },
            {
                "label": "淮安市",
                "value": "320800",
                "provinceCode": "320000",
                "lon": 119.03018636466,
                "lat": 33.606512739276,
                "children": [
                    {
                        "label": "淮安区",
                        "value": "320803",
                        "cityCode": "320800",
                        "provinceCode": "320000",
                        "lon": 119.31329513264,
                        "lat": 33.528348966942
                    },
                    {
                        "label": "淮阴区",
                        "value": "320804",
                        "cityCode": "320800",
                        "provinceCode": "320000",
                        "lon": 118.93566378046,
                        "lat": 33.664059258402
                    },
                    {
                        "label": "清江浦区",
                        "value": "320812",
                        "cityCode": "320800",
                        "provinceCode": "320000",
                        "lon": 119.04477992516,
                        "lat": 33.494331166176
                    },
                    {
                        "label": "洪泽区",
                        "value": "320813",
                        "cityCode": "320800",
                        "provinceCode": "320000",
                        "lon": 118.83000637571,
                        "lat": 33.230193969134
                    },
                    {
                        "label": "涟水县",
                        "value": "320826",
                        "cityCode": "320800",
                        "provinceCode": "320000",
                        "lon": 119.32495655858,
                        "lat": 33.884155184174
                    },
                    {
                        "label": "盱眙县",
                        "value": "320830",
                        "cityCode": "320800",
                        "provinceCode": "320000",
                        "lon": 118.53823246743,
                        "lat": 32.971613125783
                    },
                    {
                        "label": "金湖县",
                        "value": "320831",
                        "cityCode": "320800",
                        "provinceCode": "320000",
                        "lon": 119.14563113528,
                        "lat": 33.02583443776
                    }
                ]
            },
            {
                "label": "盐城市",
                "value": "320900",
                "provinceCode": "320000",
                "lon": 120.14887181794,
                "lat": 33.379861877121,
                "children": [
                    {
                        "label": "亭湖区",
                        "value": "320902",
                        "cityCode": "320900",
                        "provinceCode": "320000",
                        "lon": 120.20635135183,
                        "lat": 33.378948242447
                    },
                    {
                        "label": "盐都区",
                        "value": "320903",
                        "cityCode": "320900",
                        "provinceCode": "320000",
                        "lon": 119.96850073907,
                        "lat": 33.265898266894
                    },
                    {
                        "label": "大丰区",
                        "value": "320904",
                        "cityCode": "320900",
                        "provinceCode": "320000",
                        "lon": 120.58506449027,
                        "lat": 33.265908526078
                    },
                    {
                        "label": "响水县",
                        "value": "320921",
                        "cityCode": "320900",
                        "provinceCode": "320000",
                        "lon": 119.79760156833,
                        "lat": 34.232797426966
                    },
                    {
                        "label": "滨海县",
                        "value": "320922",
                        "cityCode": "320900",
                        "provinceCode": "320000",
                        "lon": 120.02660867811,
                        "lat": 34.092317176392
                    },
                    {
                        "label": "阜宁县",
                        "value": "320923",
                        "cityCode": "320900",
                        "provinceCode": "320000",
                        "lon": 119.70499024879,
                        "lat": 33.71197604815
                    },
                    {
                        "label": "射阳县",
                        "value": "320924",
                        "cityCode": "320900",
                        "provinceCode": "320000",
                        "lon": 120.27950474858,
                        "lat": 33.745462250481
                    },
                    {
                        "label": "建湖县",
                        "value": "320925",
                        "cityCode": "320900",
                        "provinceCode": "320000",
                        "lon": 119.83649673997,
                        "lat": 33.488907986634
                    },
                    {
                        "label": "东台市",
                        "value": "320981",
                        "cityCode": "320900",
                        "provinceCode": "320000",
                        "lon": 120.56376947144,
                        "lat": 32.791442548289
                    }
                ]
            },
            {
                "label": "扬州市",
                "value": "321000",
                "provinceCode": "320000",
                "lon": 119.42777755117,
                "lat": 32.408505254568,
                "children": [
                    {
                        "label": "广陵区",
                        "value": "321002",
                        "cityCode": "321000",
                        "provinceCode": "320000",
                        "lon": 119.48667775758,
                        "lat": 32.395670095608
                    },
                    {
                        "label": "邗江区",
                        "value": "321003",
                        "cityCode": "321000",
                        "provinceCode": "320000",
                        "lon": 119.45826385876,
                        "lat": 32.425830218252
                    },
                    {
                        "label": "江都区",
                        "value": "321012",
                        "cityCode": "321000",
                        "provinceCode": "320000",
                        "lon": 119.71731808779,
                        "lat": 32.549160271061
                    },
                    {
                        "label": "宝应县",
                        "value": "321023",
                        "cityCode": "321000",
                        "provinceCode": "320000",
                        "lon": 119.45565078384,
                        "lat": 33.225833658364
                    },
                    {
                        "label": "仪征市",
                        "value": "321081",
                        "cityCode": "321000",
                        "provinceCode": "320000",
                        "lon": 119.20095502034,
                        "lat": 32.392636465119
                    },
                    {
                        "label": "高邮市",
                        "value": "321084",
                        "cityCode": "321000",
                        "provinceCode": "320000",
                        "lon": 119.50340701788,
                        "lat": 32.835943695939
                    }
                ]
            },
            {
                "label": "镇江市",
                "value": "321100",
                "provinceCode": "320000",
                "lon": 119.45583540513,
                "lat": 32.204409443599,
                "children": [
                    {
                        "label": "京口区",
                        "value": "321102",
                        "cityCode": "321100",
                        "provinceCode": "320000",
                        "lon": 119.5848217021,
                        "lat": 32.201996095087
                    },
                    {
                        "label": "润州区",
                        "value": "321111",
                        "cityCode": "321100",
                        "provinceCode": "320000",
                        "lon": 119.43092031591,
                        "lat": 32.19664652864
                    },
                    {
                        "label": "丹徒区",
                        "value": "321112",
                        "cityCode": "321100",
                        "provinceCode": "320000",
                        "lon": 119.4989723505,
                        "lat": 32.114041364762
                    },
                    {
                        "label": "丹阳市",
                        "value": "321181",
                        "cityCode": "321100",
                        "provinceCode": "320000",
                        "lon": 119.64430350829,
                        "lat": 31.960263455083
                    },
                    {
                        "label": "扬中市",
                        "value": "321182",
                        "cityCode": "321100",
                        "provinceCode": "320000",
                        "lon": 119.84513751029,
                        "lat": 32.189469410323
                    },
                    {
                        "label": "句容市",
                        "value": "321183",
                        "cityCode": "321100",
                        "provinceCode": "320000",
                        "lon": 119.20707980344,
                        "lat": 31.932634957798
                    }
                ]
            },
            {
                "label": "泰州市",
                "value": "321200",
                "provinceCode": "320000",
                "lon": 119.91960601619,
                "lat": 32.47605327483,
                "children": [
                    {
                        "label": "海陵区",
                        "value": "321202",
                        "cityCode": "321200",
                        "provinceCode": "320000",
                        "lon": 119.92117442715,
                        "lat": 32.488257837661
                    },
                    {
                        "label": "高港区",
                        "value": "321203",
                        "cityCode": "321200",
                        "provinceCode": "320000",
                        "lon": 119.92574377278,
                        "lat": 32.330075314459
                    },
                    {
                        "label": "姜堰区",
                        "value": "321204",
                        "cityCode": "321200",
                        "provinceCode": "320000",
                        "lon": 120.06704535319,
                        "lat": 32.532466165694
                    },
                    {
                        "label": "兴化市",
                        "value": "321281",
                        "cityCode": "321200",
                        "provinceCode": "320000",
                        "lon": 119.99641814069,
                        "lat": 32.961954308808
                    },
                    {
                        "label": "靖江市",
                        "value": "321282",
                        "cityCode": "321200",
                        "provinceCode": "320000",
                        "lon": 120.27689862725,
                        "lat": 32.039442789049
                    },
                    {
                        "label": "泰兴市",
                        "value": "321283",
                        "cityCode": "321200",
                        "provinceCode": "320000",
                        "lon": 120.135346292,
                        "lat": 32.213678940627
                    }
                ]
            },
            {
                "label": "宿迁市",
                "value": "321300",
                "provinceCode": "320000",
                "lon": 118.29689337855,
                "lat": 33.952049733709,
                "children": [
                    {
                        "label": "宿城区",
                        "value": "321302",
                        "cityCode": "321300",
                        "provinceCode": "320000",
                        "lon": 118.27463983758,
                        "lat": 33.862829055956
                    },
                    {
                        "label": "宿豫区",
                        "value": "321311",
                        "cityCode": "321300",
                        "provinceCode": "320000",
                        "lon": 118.34369284322,
                        "lat": 34.009529591744
                    },
                    {
                        "label": "沭阳县",
                        "value": "321322",
                        "cityCode": "321300",
                        "provinceCode": "320000",
                        "lon": 118.85774971753,
                        "lat": 34.154013659597
                    },
                    {
                        "label": "泗阳县",
                        "value": "321323",
                        "cityCode": "321300",
                        "provinceCode": "320000",
                        "lon": 118.65694128685,
                        "lat": 33.708800542074
                    },
                    {
                        "label": "泗洪县",
                        "value": "321324",
                        "cityCode": "321300",
                        "provinceCode": "320000",
                        "lon": 118.3125512525,
                        "lat": 33.425955266134
                    }
                ]
            }
        ],
        "label": "江苏省",
        "value": "320000"
    },
    {
        "country": "china",
        "lon": 119.95720242066,
        "lat": 29.159494120761,
        "children": [
            {
                "label": "杭州市",
                "value": "330100",
                "provinceCode": "330000",
                "lon": 120.21937541572,
                "lat": 30.259244461536,
                "children": [
                    {
                        "label": "上城区",
                        "value": "330102",
                        "cityCode": "330100",
                        "provinceCode": "330000",
                        "lon": 120.18012613889,
                        "lat": 30.232357639233
                    },
                    {
                        "label": "下城区",
                        "value": "330103",
                        "cityCode": "330100",
                        "provinceCode": "330000",
                        "lon": 120.18653502974,
                        "lat": 30.310287874904
                    },
                    {
                        "label": "江干区",
                        "value": "330104",
                        "cityCode": "330100",
                        "provinceCode": "330000",
                        "lon": 120.30382324371,
                        "lat": 30.315832099954
                    },
                    {
                        "label": "拱墅区",
                        "value": "330105",
                        "cityCode": "330100",
                        "provinceCode": "330000",
                        "lon": 120.15884493257,
                        "lat": 30.344732010358
                    },
                    {
                        "label": "西湖区",
                        "value": "330106",
                        "cityCode": "330100",
                        "provinceCode": "330000",
                        "lon": 120.08899292561,
                        "lat": 30.207036169515
                    },
                    {
                        "label": "滨江区",
                        "value": "330108",
                        "cityCode": "330100",
                        "provinceCode": "330000",
                        "lon": 120.19237042946,
                        "lat": 30.187587607727
                    },
                    {
                        "label": "萧山区",
                        "value": "330109",
                        "cityCode": "330100",
                        "provinceCode": "330000",
                        "lon": 120.38908074858,
                        "lat": 30.172893839066
                    },
                    {
                        "label": "余杭区",
                        "value": "330110",
                        "cityCode": "330100",
                        "provinceCode": "330000",
                        "lon": 119.99808906005,
                        "lat": 30.388119980754
                    },
                    {
                        "label": "富阳区",
                        "value": "330111",
                        "cityCode": "330100",
                        "provinceCode": "330000",
                        "lon": 119.81096609176,
                        "lat": 29.977808419757
                    },
                    {
                        "label": "桐庐县",
                        "value": "330122",
                        "cityCode": "330100",
                        "provinceCode": "330000",
                        "lon": 119.5604618667,
                        "lat": 29.836582478934
                    },
                    {
                        "label": "淳安县",
                        "value": "330127",
                        "cityCode": "330100",
                        "provinceCode": "330000",
                        "lon": 118.89576489835,
                        "lat": 29.614714225509
                    },
                    {
                        "label": "建德市",
                        "value": "330182",
                        "cityCode": "330100",
                        "provinceCode": "330000",
                        "lon": 119.37953322636,
                        "lat": 29.487115319259
                    }
                ]
            },
            {
                "label": "宁波市",
                "value": "330200",
                "provinceCode": "330000",
                "lon": 121.57900597259,
                "lat": 29.885258965918,
                "children": [
                    {
                        "label": "海曙区",
                        "value": "330203",
                        "cityCode": "330200",
                        "provinceCode": "330000",
                        "lon": 121.5353945773,
                        "lat": 29.876800511994
                    },
                    {
                        "label": "江北区",
                        "value": "330205",
                        "cityCode": "330200",
                        "provinceCode": "330000",
                        "lon": 121.49329902932,
                        "lat": 29.96639219001
                    },
                    {
                        "label": "北仑区",
                        "value": "330206",
                        "cityCode": "330200",
                        "provinceCode": "330000",
                        "lon": 121.88941885595,
                        "lat": 29.868332319465
                    },
                    {
                        "label": "镇海区",
                        "value": "330211",
                        "cityCode": "330200",
                        "provinceCode": "330000",
                        "lon": 121.61663045279,
                        "lat": 29.995449382446
                    },
                    {
                        "label": "鄞州区",
                        "value": "330212",
                        "cityCode": "330200",
                        "provinceCode": "330000",
                        "lon": 121.53783481355,
                        "lat": 29.78545893326
                    },
                    {
                        "label": "象山县",
                        "value": "330225",
                        "cityCode": "330200",
                        "provinceCode": "330000",
                        "lon": 121.85866557564,
                        "lat": 29.378771009449
                    },
                    {
                        "label": "宁海县",
                        "value": "330226",
                        "cityCode": "330200",
                        "provinceCode": "330000",
                        "lon": 121.46362436946,
                        "lat": 29.314474088639
                    },
                    {
                        "label": "余姚市",
                        "value": "330281",
                        "cityCode": "330200",
                        "provinceCode": "330000",
                        "lon": 121.15277918829,
                        "lat": 29.996456719011
                    },
                    {
                        "label": "慈溪市",
                        "value": "330282",
                        "cityCode": "330200",
                        "provinceCode": "330000",
                        "lon": 121.33840825932,
                        "lat": 30.189257122714
                    }
                ]
            },
            {
                "label": "温州市",
                "value": "330300",
                "provinceCode": "330000",
                "lon": 120.69063473371,
                "lat": 28.002837594041,
                "children": [
                    {
                        "label": "鹿城区",
                        "value": "330302",
                        "cityCode": "330300",
                        "provinceCode": "330000",
                        "lon": 120.56579853224,
                        "lat": 28.067865050513
                    },
                    {
                        "label": "龙湾区",
                        "value": "330303",
                        "cityCode": "330300",
                        "provinceCode": "330000",
                        "lon": 120.81107773683,
                        "lat": 27.913340713281
                    },
                    {
                        "label": "瓯海区",
                        "value": "330304",
                        "cityCode": "330300",
                        "provinceCode": "330000",
                        "lon": 120.55840358596,
                        "lat": 27.972177190591
                    },
                    {
                        "label": "洞头区",
                        "value": "330305",
                        "cityCode": "330300",
                        "provinceCode": "330000",
                        "lon": 121.15231818926,
                        "lat": 27.884883705563
                    },
                    {
                        "label": "永嘉县",
                        "value": "330324",
                        "cityCode": "330300",
                        "provinceCode": "330000",
                        "lon": 120.66880872172,
                        "lat": 28.336390468031
                    },
                    {
                        "label": "平阳县",
                        "value": "330326",
                        "cityCode": "330300",
                        "provinceCode": "330000",
                        "lon": 120.38938725481,
                        "lat": 27.637700763436
                    },
                    {
                        "label": "苍南县",
                        "value": "330327",
                        "cityCode": "330300",
                        "provinceCode": "330000",
                        "lon": 120.44554278341,
                        "lat": 27.434436382653
                    },
                    {
                        "label": "文成县",
                        "value": "330328",
                        "cityCode": "330300",
                        "provinceCode": "330000",
                        "lon": 120.02842209847,
                        "lat": 27.81271343668
                    },
                    {
                        "label": "泰顺县",
                        "value": "330329",
                        "cityCode": "330300",
                        "provinceCode": "330000",
                        "lon": 119.88486761051,
                        "lat": 27.536406837073
                    },
                    {
                        "label": "瑞安市",
                        "value": "330381",
                        "cityCode": "330300",
                        "provinceCode": "330000",
                        "lon": 120.46834036335,
                        "lat": 27.82923052833
                    },
                    {
                        "label": "乐清市",
                        "value": "330382",
                        "cityCode": "330300",
                        "provinceCode": "330000",
                        "lon": 121.01617490318,
                        "lat": 28.26183898877
                    }
                ]
            },
            {
                "label": "嘉兴市",
                "value": "330400",
                "provinceCode": "330000",
                "lon": 120.76042769896,
                "lat": 30.773992239582,
                "children": [
                    {
                        "label": "南湖区",
                        "value": "330402",
                        "cityCode": "330400",
                        "provinceCode": "330000",
                        "lon": 120.84453542647,
                        "lat": 30.716357921235
                    },
                    {
                        "label": "秀洲区",
                        "value": "330411",
                        "cityCode": "330400",
                        "provinceCode": "330000",
                        "lon": 120.69190746888,
                        "lat": 30.777678969089
                    },
                    {
                        "label": "嘉善县",
                        "value": "330421",
                        "cityCode": "330400",
                        "provinceCode": "330000",
                        "lon": 120.90887281597,
                        "lat": 30.905748069187
                    },
                    {
                        "label": "海盐县",
                        "value": "330424",
                        "cityCode": "330400",
                        "provinceCode": "330000",
                        "lon": 120.88557558868,
                        "lat": 30.526042585394
                    },
                    {
                        "label": "海宁市",
                        "value": "330481",
                        "cityCode": "330400",
                        "provinceCode": "330000",
                        "lon": 120.61872710778,
                        "lat": 30.442176799317
                    },
                    {
                        "label": "平湖市",
                        "value": "330482",
                        "cityCode": "330400",
                        "provinceCode": "330000",
                        "lon": 121.10583903762,
                        "lat": 30.716528587208
                    },
                    {
                        "label": "桐乡市",
                        "value": "330483",
                        "cityCode": "330400",
                        "provinceCode": "330000",
                        "lon": 120.49041120216,
                        "lat": 30.612341030328
                    }
                ]
            },
            {
                "label": "湖州市",
                "value": "330500",
                "provinceCode": "330000",
                "lon": 120.13724316328,
                "lat": 30.877925155691,
                "children": [
                    {
                        "label": "吴兴区",
                        "value": "330502",
                        "cityCode": "330500",
                        "provinceCode": "330000",
                        "lon": 120.08891886954,
                        "lat": 30.808545234564
                    },
                    {
                        "label": "南浔区",
                        "value": "330503",
                        "cityCode": "330500",
                        "provinceCode": "330000",
                        "lon": 120.30914675944,
                        "lat": 30.766830865515
                    },
                    {
                        "label": "德清县",
                        "value": "330521",
                        "cityCode": "330500",
                        "provinceCode": "330000",
                        "lon": 120.04983138985,
                        "lat": 30.567582881042
                    },
                    {
                        "label": "长兴县",
                        "value": "330522",
                        "cityCode": "330500",
                        "provinceCode": "330000",
                        "lon": 119.81941984715,
                        "lat": 30.983352787535
                    },
                    {
                        "label": "安吉县",
                        "value": "330523",
                        "cityCode": "330500",
                        "provinceCode": "330000",
                        "lon": 119.58315792627,
                        "lat": 30.626370494334
                    }
                ]
            },
            {
                "label": "绍兴市",
                "value": "330600",
                "provinceCode": "330000",
                "lon": 120.59246738555,
                "lat": 30.002364580528,
                "children": [
                    {
                        "label": "越城区",
                        "value": "330602",
                        "cityCode": "330600",
                        "provinceCode": "330000",
                        "lon": 120.61832665179,
                        "lat": 30.015792939952
                    },
                    {
                        "label": "柯桥区",
                        "value": "330603",
                        "cityCode": "330600",
                        "provinceCode": "330000",
                        "lon": 120.54020524674,
                        "lat": 29.999366392659
                    },
                    {
                        "label": "上虞区",
                        "value": "330604",
                        "cityCode": "330600",
                        "provinceCode": "330000",
                        "lon": 120.87986642651,
                        "lat": 30.00645910703
                    },
                    {
                        "label": "新昌县",
                        "value": "330624",
                        "cityCode": "330600",
                        "provinceCode": "330000",
                        "lon": 120.97570154218,
                        "lat": 29.414313976622
                    },
                    {
                        "label": "诸暨市",
                        "value": "330681",
                        "cityCode": "330600",
                        "provinceCode": "330000",
                        "lon": 120.28143440994,
                        "lat": 29.699399516981
                    },
                    {
                        "label": "嵊州市",
                        "value": "330683",
                        "cityCode": "330600",
                        "provinceCode": "330000",
                        "lon": 120.76143097735,
                        "lat": 29.591008031468
                    }
                ]
            },
            {
                "label": "金华市",
                "value": "330700",
                "provinceCode": "330000",
                "lon": 119.65257570368,
                "lat": 29.102899105391,
                "children": [
                    {
                        "label": "婺城区",
                        "value": "330702",
                        "cityCode": "330700",
                        "provinceCode": "330000",
                        "lon": 119.51757234284,
                        "lat": 28.984539673649
                    },
                    {
                        "label": "金东区",
                        "value": "330703",
                        "cityCode": "330700",
                        "provinceCode": "330000",
                        "lon": 119.80922749595,
                        "lat": 29.155526265081
                    },
                    {
                        "label": "武义县",
                        "value": "330723",
                        "cityCode": "330700",
                        "provinceCode": "330000",
                        "lon": 119.72083317224,
                        "lat": 28.774055561598
                    },
                    {
                        "label": "浦江县",
                        "value": "330726",
                        "cityCode": "330700",
                        "provinceCode": "330000",
                        "lon": 119.91048752626,
                        "lat": 29.526266410155
                    },
                    {
                        "label": "磐安县",
                        "value": "330727",
                        "cityCode": "330700",
                        "provinceCode": "330000",
                        "lon": 120.56744721648,
                        "lat": 29.04420249188
                    },
                    {
                        "label": "兰溪市",
                        "value": "330781",
                        "cityCode": "330700",
                        "provinceCode": "330000",
                        "lon": 119.53333759742,
                        "lat": 29.284102536325
                    },
                    {
                        "label": "义乌市",
                        "value": "330782",
                        "cityCode": "330700",
                        "provinceCode": "330000",
                        "lon": 120.06729564867,
                        "lat": 29.306443911839
                    },
                    {
                        "label": "东阳市",
                        "value": "330783",
                        "cityCode": "330700",
                        "provinceCode": "330000",
                        "lon": 120.38081772668,
                        "lat": 29.237426947341
                    },
                    {
                        "label": "永康市",
                        "value": "330784",
                        "cityCode": "330700",
                        "provinceCode": "330000",
                        "lon": 120.10868352215,
                        "lat": 28.940176566983
                    }
                ]
            },
            {
                "label": "衢州市",
                "value": "330800",
                "provinceCode": "330000",
                "lon": 118.87584165151,
                "lat": 28.956910447536,
                "children": [
                    {
                        "label": "柯城区",
                        "value": "330802",
                        "cityCode": "330800",
                        "provinceCode": "330000",
                        "lon": 118.8130029548,
                        "lat": 28.998535292058
                    },
                    {
                        "label": "衢江区",
                        "value": "330803",
                        "cityCode": "330800",
                        "provinceCode": "330000",
                        "lon": 118.93904421103,
                        "lat": 28.941983087299
                    },
                    {
                        "label": "常山县",
                        "value": "330822",
                        "cityCode": "330800",
                        "provinceCode": "330000",
                        "lon": 118.54767046745,
                        "lat": 28.973666155532
                    },
                    {
                        "label": "开化县",
                        "value": "330824",
                        "cityCode": "330800",
                        "provinceCode": "330000",
                        "lon": 118.33165006627,
                        "lat": 29.18993794143
                    },
                    {
                        "label": "龙游县",
                        "value": "330825",
                        "cityCode": "330800",
                        "provinceCode": "330000",
                        "lon": 119.19866420604,
                        "lat": 28.997079389242
                    },
                    {
                        "label": "江山市",
                        "value": "330881",
                        "cityCode": "330800",
                        "provinceCode": "330000",
                        "lon": 118.60708619901,
                        "lat": 28.581969944141
                    }
                ]
            },
            {
                "label": "舟山市",
                "value": "330900",
                "provinceCode": "330000",
                "lon": 122.16987209835,
                "lat": 30.036010302554,
                "children": [
                    {
                        "label": "定海区",
                        "value": "330902",
                        "cityCode": "330900",
                        "provinceCode": "330000",
                        "lon": 122.07302446869,
                        "lat": 30.06484716159
                    },
                    {
                        "label": "普陀区",
                        "value": "330903",
                        "cityCode": "330900",
                        "provinceCode": "330000",
                        "lon": 122.27876474766,
                        "lat": 29.871101375771
                    },
                    {
                        "label": "岱山县",
                        "value": "330921",
                        "cityCode": "330900",
                        "provinceCode": "330000",
                        "lon": 122.26035914727,
                        "lat": 30.319415586505
                    },
                    {
                        "label": "嵊泗县",
                        "value": "330922",
                        "cityCode": "330900",
                        "provinceCode": "330000",
                        "lon": 122.48168649477,
                        "lat": 30.705003931261
                    }
                ]
            },
            {
                "label": "台州市",
                "value": "331000",
                "provinceCode": "330000",
                "lon": 121.44061293594,
                "lat": 28.668283285674,
                "children": [
                    {
                        "label": "椒江区",
                        "value": "331002",
                        "cityCode": "331000",
                        "provinceCode": "330000",
                        "lon": 121.46737635254,
                        "lat": 28.657015656331
                    },
                    {
                        "label": "黄岩区",
                        "value": "331003",
                        "cityCode": "331000",
                        "provinceCode": "330000",
                        "lon": 121.08831775253,
                        "lat": 28.604655275769
                    },
                    {
                        "label": "路桥区",
                        "value": "331004",
                        "cityCode": "331000",
                        "provinceCode": "330000",
                        "lon": 121.45024245576,
                        "lat": 28.548659438247
                    },
                    {
                        "label": "三门县",
                        "value": "331022",
                        "cityCode": "331000",
                        "provinceCode": "330000",
                        "lon": 121.48822880178,
                        "lat": 29.017744246024
                    },
                    {
                        "label": "天台县",
                        "value": "331023",
                        "cityCode": "331000",
                        "provinceCode": "330000",
                        "lon": 120.98556322305,
                        "lat": 29.151778640761
                    },
                    {
                        "label": "仙居县",
                        "value": "331024",
                        "cityCode": "331000",
                        "provinceCode": "330000",
                        "lon": 120.64060572539,
                        "lat": 28.738741988629
                    },
                    {
                        "label": "温岭市",
                        "value": "331081",
                        "cityCode": "331000",
                        "provinceCode": "330000",
                        "lon": 121.42104597878,
                        "lat": 28.400553817107
                    },
                    {
                        "label": "临海市",
                        "value": "331082",
                        "cityCode": "331000",
                        "provinceCode": "330000",
                        "lon": 121.22191927302,
                        "lat": 28.857388590573
                    }
                ]
            },
            {
                "label": "丽水市",
                "value": "331100",
                "provinceCode": "330000",
                "lon": 119.92957584319,
                "lat": 28.456299552144,
                "children": [
                    {
                        "label": "莲都区",
                        "value": "331102",
                        "cityCode": "331100",
                        "provinceCode": "330000",
                        "lon": 119.84995169272,
                        "lat": 28.447361330679
                    },
                    {
                        "label": "青田县",
                        "value": "331121",
                        "cityCode": "331100",
                        "provinceCode": "330000",
                        "lon": 120.14673815822,
                        "lat": 28.208428623515
                    },
                    {
                        "label": "缙云县",
                        "value": "331122",
                        "cityCode": "331100",
                        "provinceCode": "330000",
                        "lon": 120.19188183536,
                        "lat": 28.666326291231
                    },
                    {
                        "label": "遂昌县",
                        "value": "331123",
                        "cityCode": "331100",
                        "provinceCode": "330000",
                        "lon": 119.08934238361,
                        "lat": 28.525410332354
                    },
                    {
                        "label": "松阳县",
                        "value": "331124",
                        "cityCode": "331100",
                        "provinceCode": "330000",
                        "lon": 119.44101320226,
                        "lat": 28.41158038279
                    },
                    {
                        "label": "云和县",
                        "value": "331125",
                        "cityCode": "331100",
                        "provinceCode": "330000",
                        "lon": 119.54173007925,
                        "lat": 28.131320418187
                    },
                    {
                        "label": "庆元县",
                        "value": "331126",
                        "cityCode": "331100",
                        "provinceCode": "330000",
                        "lon": 119.15761923529,
                        "lat": 27.62804612399
                    },
                    {
                        "label": "景宁畲族自治县",
                        "value": "331127",
                        "cityCode": "331100",
                        "provinceCode": "330000",
                        "lon": 119.61928969769,
                        "lat": 27.896052631241
                    },
                    {
                        "label": "龙泉市",
                        "value": "331181",
                        "cityCode": "331100",
                        "provinceCode": "330000",
                        "lon": 119.08229725532,
                        "lat": 28.050639306133
                    }
                ]
            }
        ],
        "label": "浙江省",
        "value": "330000"
    },
    {
        "country": "china",
        "lon": 117.21600520757,
        "lat": 31.859252417079,
        "children": [
            {
                "label": "合肥市",
                "value": "340100",
                "provinceCode": "340000",
                "lon": 117.28269909168,
                "lat": 31.866942260687,
                "children": [
                    {
                        "label": "瑶海区",
                        "value": "340102",
                        "cityCode": "340100",
                        "provinceCode": "340000",
                        "lon": 117.33122366889,
                        "lat": 31.905375399342
                    },
                    {
                        "label": "庐阳区",
                        "value": "340103",
                        "cityCode": "340100",
                        "provinceCode": "340000",
                        "lon": 117.24783468704,
                        "lat": 31.912901051134
                    },
                    {
                        "label": "蜀山区",
                        "value": "340104",
                        "cityCode": "340100",
                        "provinceCode": "340000",
                        "lon": 117.23128044361,
                        "lat": 31.838184928803
                    },
                    {
                        "label": "包河区",
                        "value": "340111",
                        "cityCode": "340100",
                        "provinceCode": "340000",
                        "lon": 117.35391279997,
                        "lat": 31.790724288122
                    },
                    {
                        "label": "长丰县",
                        "value": "340121",
                        "cityCode": "340100",
                        "provinceCode": "340000",
                        "lon": 117.17443835982,
                        "lat": 32.286111151904
                    },
                    {
                        "label": "肥东县",
                        "value": "340122",
                        "cityCode": "340100",
                        "provinceCode": "340000",
                        "lon": 117.57585687571,
                        "lat": 32.003189086973
                    },
                    {
                        "label": "肥西县",
                        "value": "340123",
                        "cityCode": "340100",
                        "provinceCode": "340000",
                        "lon": 117.03626088173,
                        "lat": 31.732638067993
                    },
                    {
                        "label": "庐江县",
                        "value": "340124",
                        "cityCode": "340100",
                        "provinceCode": "340000",
                        "lon": 117.33587636592,
                        "lat": 31.228413825483
                    },
                    {
                        "label": "巢湖市",
                        "value": "340181",
                        "cityCode": "340100",
                        "provinceCode": "340000",
                        "lon": 117.7717833762,
                        "lat": 31.676058567558
                    }
                ]
            },
            {
                "label": "芜湖市",
                "value": "340200",
                "provinceCode": "340000",
                "lon": 118.38410842323,
                "lat": 31.366019787543,
                "children": [
                    {
                        "label": "镜湖区",
                        "value": "340202",
                        "cityCode": "340200",
                        "provinceCode": "340000",
                        "lon": 118.38724548573,
                        "lat": 31.351965582559
                    },
                    {
                        "label": "弋江区",
                        "value": "340203",
                        "cityCode": "340200",
                        "provinceCode": "340000",
                        "lon": 118.33596966824,
                        "lat": 31.216676779902
                    },
                    {
                        "label": "鸠江区",
                        "value": "340207",
                        "cityCode": "340200",
                        "provinceCode": "340000",
                        "lon": 118.49397424134,
                        "lat": 31.375481957255
                    },
                    {
                        "label": "三山区",
                        "value": "340208",
                        "cityCode": "340200",
                        "provinceCode": "340000",
                        "lon": 118.3117984229,
                        "lat": 31.212824987426
                    },
                    {
                        "label": "芜湖县",
                        "value": "340221",
                        "cityCode": "340200",
                        "provinceCode": "340000",
                        "lon": 118.53246218925,
                        "lat": 31.191698969307
                    },
                    {
                        "label": "繁昌县",
                        "value": "340222",
                        "cityCode": "340200",
                        "provinceCode": "340000",
                        "lon": 118.2001179722,
                        "lat": 31.12832958697
                    },
                    {
                        "label": "南陵县",
                        "value": "340223",
                        "cityCode": "340200",
                        "provinceCode": "340000",
                        "lon": 118.28821596372,
                        "lat": 30.8959818627
                    },
                    {
                        "label": "无为县",
                        "value": "340225",
                        "cityCode": "340200",
                        "provinceCode": "340000",
                        "lon": 117.82005160307,
                        "lat": 31.22249365658
                    }
                ]
            },
            {
                "label": "蚌埠市",
                "value": "340300",
                "provinceCode": "340000",
                "lon": 117.35707986588,
                "lat": 32.929498906698,
                "children": [
                    {
                        "label": "龙子湖区",
                        "value": "340302",
                        "cityCode": "340300",
                        "provinceCode": "340000",
                        "lon": 117.47832568768,
                        "lat": 32.926342521363
                    },
                    {
                        "label": "蚌山区",
                        "value": "340303",
                        "cityCode": "340300",
                        "provinceCode": "340000",
                        "lon": 117.35635619096,
                        "lat": 32.881522954878
                    },
                    {
                        "label": "禹会区",
                        "value": "340304",
                        "cityCode": "340300",
                        "provinceCode": "340000",
                        "lon": 117.3055150635,
                        "lat": 32.889696360476
                    },
                    {
                        "label": "淮上区",
                        "value": "340311",
                        "cityCode": "340300",
                        "provinceCode": "340000",
                        "lon": 117.38818423314,
                        "lat": 33.023815185908
                    },
                    {
                        "label": "怀远县",
                        "value": "340321",
                        "cityCode": "340300",
                        "provinceCode": "340000",
                        "lon": 117.04208647136,
                        "lat": 33.037130745984
                    },
                    {
                        "label": "五河县",
                        "value": "340322",
                        "cityCode": "340300",
                        "provinceCode": "340000",
                        "lon": 117.764210401,
                        "lat": 33.138465310137
                    },
                    {
                        "label": "固镇县",
                        "value": "340323",
                        "cityCode": "340300",
                        "provinceCode": "340000",
                        "lon": 117.35403405942,
                        "lat": 33.272840934373
                    }
                ]
            },
            {
                "label": "淮南市",
                "value": "340400",
                "provinceCode": "340000",
                "lon": 117.01863886329,
                "lat": 32.642811823748,
                "children": [
                    {
                        "label": "大通区",
                        "value": "340402",
                        "cityCode": "340400",
                        "provinceCode": "340000",
                        "lon": 117.11713761331,
                        "lat": 32.643535866152
                    },
                    {
                        "label": "田家庵区",
                        "value": "340403",
                        "cityCode": "340400",
                        "provinceCode": "340000",
                        "lon": 117.01468721736,
                        "lat": 32.564363767687
                    },
                    {
                        "label": "谢家集区",
                        "value": "340404",
                        "cityCode": "340400",
                        "provinceCode": "340000",
                        "lon": 116.90877214688,
                        "lat": 32.544400181652
                    },
                    {
                        "label": "八公山区",
                        "value": "340405",
                        "cityCode": "340400",
                        "provinceCode": "340000",
                        "lon": 116.82552132442,
                        "lat": 32.652390199515
                    },
                    {
                        "label": "潘集区",
                        "value": "340406",
                        "cityCode": "340400",
                        "provinceCode": "340000",
                        "lon": 116.86619300469,
                        "lat": 32.800694621968
                    },
                    {
                        "label": "凤台县",
                        "value": "340421",
                        "cityCode": "340400",
                        "provinceCode": "340000",
                        "lon": 116.58490534783,
                        "lat": 32.791416300893
                    },
                    {
                        "label": "寿县",
                        "value": "340422",
                        "cityCode": "340400",
                        "provinceCode": "340000",
                        "lon": 116.77854729708,
                        "lat": 32.287816164667
                    }
                ]
            },
            {
                "label": "马鞍山市",
                "value": "340500",
                "provinceCode": "340000",
                "lon": 118.51588184662,
                "lat": 31.68852815888,
                "children": [
                    {
                        "label": "花山区",
                        "value": "340503",
                        "cityCode": "340500",
                        "provinceCode": "340000",
                        "lon": 118.57834785585,
                        "lat": 31.711627118315
                    },
                    {
                        "label": "雨山区",
                        "value": "340504",
                        "cityCode": "340500",
                        "provinceCode": "340000",
                        "lon": 118.55455812086,
                        "lat": 31.659719310829
                    },
                    {
                        "label": "博望区",
                        "value": "340506",
                        "cityCode": "340500",
                        "provinceCode": "340000",
                        "lon": 118.85133588367,
                        "lat": 31.56550080289
                    },
                    {
                        "label": "当涂县",
                        "value": "340521",
                        "cityCode": "340500",
                        "provinceCode": "340000",
                        "lon": 118.64667323993,
                        "lat": 31.503024380618
                    },
                    {
                        "label": "含山县",
                        "value": "340522",
                        "cityCode": "340500",
                        "provinceCode": "340000",
                        "lon": 118.51588184662,
                        "lat": 31.68852815888
                    },
                    {
                        "label": "和县",
                        "value": "340523",
                        "cityCode": "340500",
                        "provinceCode": "340000",
                        "lon": 118.29986391138,
                        "lat": 31.757568623793
                    }
                ]
            },
            {
                "label": "淮北市",
                "value": "340600",
                "provinceCode": "340000",
                "lon": 116.79144742863,
                "lat": 33.960023305364,
                "children": [
                    {
                        "label": "杜集区",
                        "value": "340602",
                        "cityCode": "340600",
                        "provinceCode": "340000",
                        "lon": 116.95496714841,
                        "lat": 34.113251414374
                    },
                    {
                        "label": "相山区",
                        "value": "340603",
                        "cityCode": "340600",
                        "provinceCode": "340000",
                        "lon": 116.72896156685,
                        "lat": 33.988334722309
                    },
                    {
                        "label": "烈山区",
                        "value": "340604",
                        "cityCode": "340600",
                        "provinceCode": "340000",
                        "lon": 116.9081817805,
                        "lat": 33.84405351094
                    },
                    {
                        "label": "濉溪县",
                        "value": "340621",
                        "cityCode": "340600",
                        "provinceCode": "340000",
                        "lon": 116.73689934705,
                        "lat": 33.693204649044
                    }
                ]
            },
            {
                "label": "铜陵市",
                "value": "340700",
                "provinceCode": "340000",
                "lon": 117.81942872881,
                "lat": 30.940929694666,
                "children": [
                    {
                        "label": "铜官区",
                        "value": "340705",
                        "cityCode": "340700",
                        "provinceCode": "340000",
                        "lon": 117.83324857069,
                        "lat": 30.943050294456
                    },
                    {
                        "label": "义安区",
                        "value": "340706",
                        "cityCode": "340700",
                        "provinceCode": "340000",
                        "lon": 117.95780890267,
                        "lat": 30.944585477816
                    },
                    {
                        "label": "郊区",
                        "value": "340711",
                        "cityCode": "340700",
                        "provinceCode": "340000",
                        "lon": 117.64155067342,
                        "lat": 30.754631362428
                    },
                    {
                        "label": "枞阳县",
                        "value": "340722",
                        "cityCode": "340700",
                        "provinceCode": "340000",
                        "lon": 117.41703591878,
                        "lat": 30.863982478208
                    }
                ]
            },
            {
                "label": "安庆市",
                "value": "340800",
                "provinceCode": "340000",
                "lon": 117.05873877211,
                "lat": 30.537897817381,
                "children": [
                    {
                        "label": "迎江区",
                        "value": "340802",
                        "cityCode": "340800",
                        "provinceCode": "340000",
                        "lon": 117.15254234871,
                        "lat": 30.541457598958
                    },
                    {
                        "label": "大观区",
                        "value": "340803",
                        "cityCode": "340800",
                        "provinceCode": "340000",
                        "lon": 116.9809683319,
                        "lat": 30.532487247564
                    },
                    {
                        "label": "宜秀区",
                        "value": "340811",
                        "cityCode": "340800",
                        "provinceCode": "340000",
                        "lon": 117.05612964375,
                        "lat": 30.614339999814
                    },
                    {
                        "label": "怀宁县",
                        "value": "340822",
                        "cityCode": "340800",
                        "provinceCode": "340000",
                        "lon": 116.80352690196,
                        "lat": 30.579024527459
                    },
                    {
                        "label": "太湖县",
                        "value": "340825",
                        "cityCode": "340800",
                        "provinceCode": "340000",
                        "lon": 116.18253924827,
                        "lat": 30.50109966504
                    },
                    {
                        "label": "宿松县",
                        "value": "340826",
                        "cityCode": "340800",
                        "provinceCode": "340000",
                        "lon": 116.25351835628,
                        "lat": 30.108216635083
                    },
                    {
                        "label": "望江县",
                        "value": "340827",
                        "cityCode": "340800",
                        "provinceCode": "340000",
                        "lon": 116.68809225224,
                        "lat": 30.242568216534
                    },
                    {
                        "label": "岳西县",
                        "value": "340828",
                        "cityCode": "340800",
                        "provinceCode": "340000",
                        "lon": 116.22007036688,
                        "lat": 30.901821144678
                    },
                    {
                        "label": "桐城市",
                        "value": "340881",
                        "cityCode": "340800",
                        "provinceCode": "340000",
                        "lon": 116.95355904596,
                        "lat": 30.972567972107
                    }
                ]
            },
            {
                "label": "黄山市",
                "value": "341000",
                "provinceCode": "340000",
                "lon": 118.293569632,
                "lat": 29.734434856163,
                "children": [
                    {
                        "label": "屯溪区",
                        "value": "341002",
                        "cityCode": "341000",
                        "provinceCode": "340000",
                        "lon": 118.30963663452,
                        "lat": 29.716534699341
                    },
                    {
                        "label": "黄山区",
                        "value": "341003",
                        "cityCode": "341000",
                        "provinceCode": "340000",
                        "lon": 118.07754612726,
                        "lat": 30.27774589512
                    },
                    {
                        "label": "徽州区",
                        "value": "341004",
                        "cityCode": "341000",
                        "provinceCode": "340000",
                        "lon": 118.27859128593,
                        "lat": 29.902140398578
                    },
                    {
                        "label": "歙县",
                        "value": "341021",
                        "cityCode": "341000",
                        "provinceCode": "340000",
                        "lon": 118.57515564084,
                        "lat": 29.871177014075
                    },
                    {
                        "label": "休宁县",
                        "value": "341022",
                        "cityCode": "341000",
                        "provinceCode": "340000",
                        "lon": 118.09308178818,
                        "lat": 29.669120361013
                    },
                    {
                        "label": "黟县",
                        "value": "341023",
                        "cityCode": "341000",
                        "provinceCode": "340000",
                        "lon": 117.91075047481,
                        "lat": 30.014778480875
                    },
                    {
                        "label": "祁门县",
                        "value": "341024",
                        "cityCode": "341000",
                        "provinceCode": "340000",
                        "lon": 117.60052812882,
                        "lat": 29.873705688292
                    }
                ]
            },
            {
                "label": "滁州市",
                "value": "341100",
                "provinceCode": "340000",
                "lon": 118.32457035098,
                "lat": 32.317350595384,
                "children": [
                    {
                        "label": "琅琊区",
                        "value": "341102",
                        "cityCode": "341100",
                        "provinceCode": "340000",
                        "lon": 118.33756892154,
                        "lat": 32.338458080903
                    },
                    {
                        "label": "南谯区",
                        "value": "341103",
                        "cityCode": "341100",
                        "provinceCode": "340000",
                        "lon": 118.27082841537,
                        "lat": 32.310209092866
                    },
                    {
                        "label": "来安县",
                        "value": "341122",
                        "cityCode": "341100",
                        "provinceCode": "340000",
                        "lon": 118.53562960741,
                        "lat": 32.473711637442
                    },
                    {
                        "label": "全椒县",
                        "value": "341124",
                        "cityCode": "341100",
                        "provinceCode": "340000",
                        "lon": 118.10577829394,
                        "lat": 32.069932749958
                    },
                    {
                        "label": "定远县",
                        "value": "341125",
                        "cityCode": "341100",
                        "provinceCode": "340000",
                        "lon": 117.66596452497,
                        "lat": 32.473258599425
                    },
                    {
                        "label": "凤阳县",
                        "value": "341126",
                        "cityCode": "341100",
                        "provinceCode": "340000",
                        "lon": 117.61147230278,
                        "lat": 32.792214955967
                    },
                    {
                        "label": "天长市",
                        "value": "341181",
                        "cityCode": "341100",
                        "provinceCode": "340000",
                        "lon": 118.9729126449,
                        "lat": 32.721213784185
                    },
                    {
                        "label": "明光市",
                        "value": "341182",
                        "cityCode": "341100",
                        "provinceCode": "340000",
                        "lon": 118.14072656734,
                        "lat": 32.81183581812
                    }
                ]
            },
            {
                "label": "阜阳市",
                "value": "341200",
                "provinceCode": "340000",
                "lon": 115.82093225905,
                "lat": 32.90121133057,
                "children": [
                    {
                        "label": "颍州区",
                        "value": "341202",
                        "cityCode": "341200",
                        "provinceCode": "340000",
                        "lon": 115.72772731323,
                        "lat": 32.867688563381
                    },
                    {
                        "label": "颍东区",
                        "value": "341203",
                        "cityCode": "341200",
                        "provinceCode": "340000",
                        "lon": 116.03998540511,
                        "lat": 32.941585109575
                    },
                    {
                        "label": "颍泉区",
                        "value": "341204",
                        "cityCode": "341200",
                        "provinceCode": "340000",
                        "lon": 115.73402623147,
                        "lat": 33.073509996971
                    },
                    {
                        "label": "临泉县",
                        "value": "341221",
                        "cityCode": "341200",
                        "provinceCode": "340000",
                        "lon": 115.24846137013,
                        "lat": 32.909769412643
                    },
                    {
                        "label": "太和县",
                        "value": "341222",
                        "cityCode": "341200",
                        "provinceCode": "340000",
                        "lon": 115.64875595615,
                        "lat": 33.33774827164
                    },
                    {
                        "label": "阜南县",
                        "value": "341225",
                        "cityCode": "341200",
                        "provinceCode": "340000",
                        "lon": 115.65409851632,
                        "lat": 32.655881179954
                    },
                    {
                        "label": "颍上县",
                        "value": "341226",
                        "cityCode": "341200",
                        "provinceCode": "340000",
                        "lon": 116.26531418265,
                        "lat": 32.662460220803
                    },
                    {
                        "label": "界首市",
                        "value": "341282",
                        "cityCode": "341200",
                        "provinceCode": "340000",
                        "lon": 115.39864296673,
                        "lat": 33.226192689105
                    }
                ]
            },
            {
                "label": "宿州市",
                "value": "341300",
                "provinceCode": "340000",
                "lon": 116.98869241183,
                "lat": 33.636772385781,
                "children": [
                    {
                        "label": "埇桥区",
                        "value": "341302",
                        "cityCode": "341300",
                        "provinceCode": "340000",
                        "lon": 117.15907588963,
                        "lat": 33.726032251705
                    },
                    {
                        "label": "砀山县",
                        "value": "341321",
                        "cityCode": "341300",
                        "provinceCode": "340000",
                        "lon": 116.42028227207,
                        "lat": 34.454057242308
                    },
                    {
                        "label": "萧县",
                        "value": "341322",
                        "cityCode": "341300",
                        "provinceCode": "340000",
                        "lon": 116.81242175884,
                        "lat": 34.208529641052
                    },
                    {
                        "label": "灵璧县",
                        "value": "341323",
                        "cityCode": "341300",
                        "provinceCode": "340000",
                        "lon": 117.54312668944,
                        "lat": 33.690737031018
                    },
                    {
                        "label": "泗县",
                        "value": "341324",
                        "cityCode": "341300",
                        "provinceCode": "340000",
                        "lon": 117.89035897388,
                        "lat": 33.544346537362
                    }
                ]
            },
            {
                "label": "六安市",
                "value": "341500",
                "provinceCode": "340000",
                "lon": 116.50525268298,
                "lat": 31.755558355198,
                "children": [
                    {
                        "label": "金安区",
                        "value": "341502",
                        "cityCode": "341500",
                        "provinceCode": "340000",
                        "lon": 116.66194105885,
                        "lat": 31.631258470539
                    },
                    {
                        "label": "裕安区",
                        "value": "341503",
                        "cityCode": "341500",
                        "provinceCode": "340000",
                        "lon": 116.30257286162,
                        "lat": 31.753038540484
                    },
                    {
                        "label": "叶集区",
                        "value": "341504",
                        "cityCode": "341500",
                        "provinceCode": "340000",
                        "lon": 116.50525268298,
                        "lat": 31.755558355198
                    },
                    {
                        "label": "霍邱县",
                        "value": "341522",
                        "cityCode": "341500",
                        "provinceCode": "340000",
                        "lon": 116.17352091075,
                        "lat": 32.201507325967
                    },
                    {
                        "label": "舒城县",
                        "value": "341523",
                        "cityCode": "341500",
                        "provinceCode": "340000",
                        "lon": 116.82855911938,
                        "lat": 31.310003081421
                    },
                    {
                        "label": "金寨县",
                        "value": "341524",
                        "cityCode": "341500",
                        "provinceCode": "340000",
                        "lon": 115.77931490356,
                        "lat": 31.47909281966
                    },
                    {
                        "label": "霍山县",
                        "value": "341525",
                        "cityCode": "341500",
                        "provinceCode": "340000",
                        "lon": 116.24667502387,
                        "lat": 31.287055799576
                    }
                ]
            },
            {
                "label": "亳州市",
                "value": "341600",
                "provinceCode": "340000",
                "lon": 115.78792824512,
                "lat": 33.871210565302,
                "children": [
                    {
                        "label": "谯城区",
                        "value": "341602",
                        "cityCode": "341600",
                        "provinceCode": "340000",
                        "lon": 115.81281423257,
                        "lat": 33.782924407833
                    },
                    {
                        "label": "涡阳县",
                        "value": "341621",
                        "cityCode": "341600",
                        "provinceCode": "340000",
                        "lon": 116.22355045352,
                        "lat": 33.557949046136
                    },
                    {
                        "label": "蒙城县",
                        "value": "341622",
                        "cityCode": "341600",
                        "provinceCode": "340000",
                        "lon": 116.5915120873,
                        "lat": 33.22304396133
                    },
                    {
                        "label": "利辛县",
                        "value": "341623",
                        "cityCode": "341600",
                        "provinceCode": "340000",
                        "lon": 116.16627183049,
                        "lat": 33.157375760354
                    }
                ]
            },
            {
                "label": "池州市",
                "value": "341700",
                "provinceCode": "340000",
                "lon": 117.49447677159,
                "lat": 30.660019248161,
                "children": [
                    {
                        "label": "贵池区",
                        "value": "341702",
                        "cityCode": "341700",
                        "provinceCode": "340000",
                        "lon": 117.50847770852,
                        "lat": 30.514085692989
                    },
                    {
                        "label": "东至县",
                        "value": "341721",
                        "cityCode": "341700",
                        "provinceCode": "340000",
                        "lon": 117.00682739944,
                        "lat": 30.034069906871
                    },
                    {
                        "label": "石台县",
                        "value": "341722",
                        "cityCode": "341700",
                        "provinceCode": "340000",
                        "lon": 117.53828189034,
                        "lat": 30.199160540051
                    },
                    {
                        "label": "青阳县",
                        "value": "341723",
                        "cityCode": "341700",
                        "provinceCode": "340000",
                        "lon": 117.90815913595,
                        "lat": 30.602013463857
                    }
                ]
            },
            {
                "label": "宣城市",
                "value": "341800",
                "provinceCode": "340000",
                "lon": 118.75209631098,
                "lat": 30.951642354296,
                "children": [
                    {
                        "label": "宣州区",
                        "value": "341802",
                        "cityCode": "341800",
                        "provinceCode": "340000",
                        "lon": 118.7978027295,
                        "lat": 30.943631043255
                    },
                    {
                        "label": "郎溪县",
                        "value": "341821",
                        "cityCode": "341800",
                        "provinceCode": "340000",
                        "lon": 119.16790406676,
                        "lat": 31.100123797933
                    },
                    {
                        "label": "泾县",
                        "value": "341823",
                        "cityCode": "341800",
                        "provinceCode": "340000",
                        "lon": 118.37604020629,
                        "lat": 30.599286819492
                    },
                    {
                        "label": "绩溪县",
                        "value": "341824",
                        "cityCode": "341800",
                        "provinceCode": "340000",
                        "lon": 118.6637768779,
                        "lat": 30.162401081144
                    },
                    {
                        "label": "旌德县",
                        "value": "341825",
                        "cityCode": "341800",
                        "provinceCode": "340000",
                        "lon": 118.48289793271,
                        "lat": 30.321833135921
                    },
                    {
                        "label": "宁国市",
                        "value": "341881",
                        "cityCode": "341800",
                        "provinceCode": "340000",
                        "lon": 118.99702452598,
                        "lat": 30.502936034943
                    }
                ]
            }
        ],
        "label": "安徽省",
        "value": "340000"
    },
    {
        "country": "china",
        "lon": 117.98494311991,
        "lat": 26.050118295661,
        "children": [
            {
                "label": "福州市",
                "value": "350100",
                "provinceCode": "350000",
                "lon": 119.33022110713,
                "lat": 26.047125496573,
                "children": [
                    {
                        "label": "鼓楼区",
                        "value": "350102",
                        "cityCode": "350100",
                        "provinceCode": "350000",
                        "lon": 119.29063293961,
                        "lat": 26.097871106548
                    },
                    {
                        "label": "台江区",
                        "value": "350103",
                        "cityCode": "350100",
                        "provinceCode": "350000",
                        "lon": 119.32406268487,
                        "lat": 26.062153767548
                    },
                    {
                        "label": "仓山区",
                        "value": "350104",
                        "cityCode": "350100",
                        "provinceCode": "350000",
                        "lon": 119.33493643794,
                        "lat": 26.019664381274
                    },
                    {
                        "label": "马尾区",
                        "value": "350105",
                        "cityCode": "350100",
                        "provinceCode": "350000",
                        "lon": 119.51080249492,
                        "lat": 26.082650321112
                    },
                    {
                        "label": "晋安区",
                        "value": "350111",
                        "cityCode": "350100",
                        "provinceCode": "350000",
                        "lon": 119.31492287341,
                        "lat": 26.221752079694
                    },
                    {
                        "label": "闽侯县",
                        "value": "350121",
                        "cityCode": "350100",
                        "provinceCode": "350000",
                        "lon": 119.12238323588,
                        "lat": 26.182432187564
                    },
                    {
                        "label": "连江县",
                        "value": "350122",
                        "cityCode": "350100",
                        "provinceCode": "350000",
                        "lon": 119.5683393031,
                        "lat": 26.301591411273
                    },
                    {
                        "label": "罗源县",
                        "value": "350123",
                        "cityCode": "350100",
                        "provinceCode": "350000",
                        "lon": 119.46523419293,
                        "lat": 26.506325719276
                    },
                    {
                        "label": "闽清县",
                        "value": "350124",
                        "cityCode": "350100",
                        "provinceCode": "350000",
                        "lon": 118.77880310691,
                        "lat": 26.212273389994
                    },
                    {
                        "label": "永泰县",
                        "value": "350125",
                        "cityCode": "350100",
                        "provinceCode": "350000",
                        "lon": 118.79474057257,
                        "lat": 25.857384057085
                    },
                    {
                        "label": "平潭县",
                        "value": "350128",
                        "cityCode": "350100",
                        "provinceCode": "350000",
                        "lon": 119.76645322176,
                        "lat": 25.537737674887
                    },
                    {
                        "label": "福清市",
                        "value": "350181",
                        "cityCode": "350100",
                        "provinceCode": "350000",
                        "lon": 119.37754701319,
                        "lat": 25.638120577122
                    }
                ]
            },
            {
                "label": "厦门市",
                "value": "350200",
                "provinceCode": "350000",
                "lon": 118.10388604566,
                "lat": 24.489230612469,
                "children": [
                    {
                        "label": "思明区",
                        "value": "350203",
                        "cityCode": "350200",
                        "provinceCode": "350000",
                        "lon": 118.13453488213,
                        "lat": 24.468728076403
                    },
                    {
                        "label": "海沧区",
                        "value": "350205",
                        "cityCode": "350200",
                        "provinceCode": "350000",
                        "lon": 117.98395590267,
                        "lat": 24.53619033141
                    },
                    {
                        "label": "湖里区",
                        "value": "350206",
                        "cityCode": "350200",
                        "provinceCode": "350000",
                        "lon": 118.14467575095,
                        "lat": 24.521973931072
                    },
                    {
                        "label": "集美区",
                        "value": "350211",
                        "cityCode": "350200",
                        "provinceCode": "350000",
                        "lon": 118.02941167016,
                        "lat": 24.640972798479
                    },
                    {
                        "label": "同安区",
                        "value": "350212",
                        "cityCode": "350200",
                        "provinceCode": "350000",
                        "lon": 118.11468496447,
                        "lat": 24.781704734783
                    },
                    {
                        "label": "翔安区",
                        "value": "350213",
                        "cityCode": "350200",
                        "provinceCode": "350000",
                        "lon": 118.28080317925,
                        "lat": 24.675484915197
                    }
                ]
            },
            {
                "label": "莆田市",
                "value": "350300",
                "provinceCode": "350000",
                "lon": 119.07773096396,
                "lat": 25.448450136734,
                "children": [
                    {
                        "label": "城厢区",
                        "value": "350302",
                        "cityCode": "350300",
                        "provinceCode": "350000",
                        "lon": 118.95444257513,
                        "lat": 25.433374872116
                    },
                    {
                        "label": "涵江区",
                        "value": "350303",
                        "cityCode": "350300",
                        "provinceCode": "350000",
                        "lon": 119.07903889678,
                        "lat": 25.604741724857
                    },
                    {
                        "label": "荔城区",
                        "value": "350304",
                        "cityCode": "350300",
                        "provinceCode": "350000",
                        "lon": 119.07410333682,
                        "lat": 25.427591842484
                    },
                    {
                        "label": "秀屿区",
                        "value": "350305",
                        "cityCode": "350300",
                        "provinceCode": "350000",
                        "lon": 119.13146589277,
                        "lat": 25.276364535891
                    },
                    {
                        "label": "仙游县",
                        "value": "350322",
                        "cityCode": "350300",
                        "provinceCode": "350000",
                        "lon": 118.70462563885,
                        "lat": 25.468258336396
                    }
                ]
            },
            {
                "label": "三明市",
                "value": "350400",
                "provinceCode": "350000",
                "lon": 117.64219393404,
                "lat": 26.270835279362,
                "children": [
                    {
                        "label": "梅列区",
                        "value": "350402",
                        "cityCode": "350400",
                        "provinceCode": "350000",
                        "lon": 117.63050069122,
                        "lat": 26.307448553348
                    },
                    {
                        "label": "三元区",
                        "value": "350403",
                        "cityCode": "350400",
                        "provinceCode": "350000",
                        "lon": 117.51689648494,
                        "lat": 26.173967139255
                    },
                    {
                        "label": "明溪县",
                        "value": "350421",
                        "cityCode": "350400",
                        "provinceCode": "350000",
                        "lon": 117.21859881719,
                        "lat": 26.418484134559
                    },
                    {
                        "label": "清流县",
                        "value": "350423",
                        "cityCode": "350400",
                        "provinceCode": "350000",
                        "lon": 116.9211934366,
                        "lat": 26.099297668335
                    },
                    {
                        "label": "宁化县",
                        "value": "350424",
                        "cityCode": "350400",
                        "provinceCode": "350000",
                        "lon": 116.67811816013,
                        "lat": 26.310073098848
                    },
                    {
                        "label": "大田县",
                        "value": "350425",
                        "cityCode": "350400",
                        "provinceCode": "350000",
                        "lon": 117.81799668394,
                        "lat": 25.797449314745
                    },
                    {
                        "label": "尤溪县",
                        "value": "350426",
                        "cityCode": "350400",
                        "provinceCode": "350000",
                        "lon": 118.25386835128,
                        "lat": 26.150593850717
                    },
                    {
                        "label": "沙县",
                        "value": "350427",
                        "cityCode": "350400",
                        "provinceCode": "350000",
                        "lon": 117.81884600477,
                        "lat": 26.446505905088
                    },
                    {
                        "label": "将乐县",
                        "value": "350428",
                        "cityCode": "350400",
                        "provinceCode": "350000",
                        "lon": 117.40083967575,
                        "lat": 26.732328679548
                    },
                    {
                        "label": "泰宁县",
                        "value": "350429",
                        "cityCode": "350400",
                        "provinceCode": "350000",
                        "lon": 117.12565958885,
                        "lat": 26.865476881883
                    },
                    {
                        "label": "建宁县",
                        "value": "350430",
                        "cityCode": "350400",
                        "provinceCode": "350000",
                        "lon": 116.79307136804,
                        "lat": 26.817741252365
                    },
                    {
                        "label": "永安市",
                        "value": "350481",
                        "cityCode": "350400",
                        "provinceCode": "350000",
                        "lon": 117.32853545664,
                        "lat": 25.919433151382
                    }
                ]
            },
            {
                "label": "泉州市",
                "value": "350500",
                "provinceCode": "350000",
                "lon": 118.60036234323,
                "lat": 24.901652383991,
                "children": [
                    {
                        "label": "鲤城区",
                        "value": "350502",
                        "cityCode": "350500",
                        "provinceCode": "350000",
                        "lon": 118.56845525017,
                        "lat": 24.905744690408
                    },
                    {
                        "label": "丰泽区",
                        "value": "350503",
                        "cityCode": "350500",
                        "provinceCode": "350000",
                        "lon": 118.6074317381,
                        "lat": 24.936275095413
                    },
                    {
                        "label": "洛江区",
                        "value": "350504",
                        "cityCode": "350500",
                        "provinceCode": "350000",
                        "lon": 118.64345333988,
                        "lat": 25.133414113301
                    },
                    {
                        "label": "泉港区",
                        "value": "350505",
                        "cityCode": "350500",
                        "provinceCode": "350000",
                        "lon": 118.81901718056,
                        "lat": 25.173479375703
                    },
                    {
                        "label": "惠安县",
                        "value": "350521",
                        "cityCode": "350500",
                        "provinceCode": "350000",
                        "lon": 118.80947288339,
                        "lat": 24.991871443315
                    },
                    {
                        "label": "安溪县",
                        "value": "350524",
                        "cityCode": "350500",
                        "provinceCode": "350000",
                        "lon": 117.91163244343,
                        "lat": 25.125684138245
                    },
                    {
                        "label": "永春县",
                        "value": "350525",
                        "cityCode": "350500",
                        "provinceCode": "350000",
                        "lon": 118.14097079846,
                        "lat": 25.395598523493
                    },
                    {
                        "label": "德化县",
                        "value": "350526",
                        "cityCode": "350500",
                        "provinceCode": "350000",
                        "lon": 118.2580388856,
                        "lat": 25.674049363102
                    },
                    {
                        "label": "金门县",
                        "value": "350527",
                        "cityCode": "350500",
                        "provinceCode": "350000",
                        "lon": 118.3797724059,
                        "lat": 24.453685081793
                    },
                    {
                        "label": "石狮市",
                        "value": "350581",
                        "cityCode": "350500",
                        "provinceCode": "350000",
                        "lon": 118.69248092208,
                        "lat": 24.744894247253
                    },
                    {
                        "label": "晋江市",
                        "value": "350582",
                        "cityCode": "350500",
                        "provinceCode": "350000",
                        "lon": 118.55865054225,
                        "lat": 24.729638297698
                    },
                    {
                        "label": "南安市",
                        "value": "350583",
                        "cityCode": "350500",
                        "provinceCode": "350000",
                        "lon": 118.38898065958,
                        "lat": 25.017972545094
                    }
                ]
            },
            {
                "label": "漳州市",
                "value": "350600",
                "provinceCode": "350000",
                "lon": 117.67620467895,
                "lat": 24.517064779808,
                "children": [
                    {
                        "label": "芗城区",
                        "value": "350602",
                        "cityCode": "350600",
                        "provinceCode": "350000",
                        "lon": 117.63336610614,
                        "lat": 24.575089413411
                    },
                    {
                        "label": "龙文区",
                        "value": "350603",
                        "cityCode": "350600",
                        "provinceCode": "350000",
                        "lon": 117.70403687855,
                        "lat": 24.537177249549
                    },
                    {
                        "label": "云霄县",
                        "value": "350622",
                        "cityCode": "350600",
                        "provinceCode": "350000",
                        "lon": 117.3381105564,
                        "lat": 23.984924590871
                    },
                    {
                        "label": "漳浦县",
                        "value": "350623",
                        "cityCode": "350600",
                        "provinceCode": "350000",
                        "lon": 117.69145555574,
                        "lat": 24.134610348852
                    },
                    {
                        "label": "诏安县",
                        "value": "350624",
                        "cityCode": "350600",
                        "provinceCode": "350000",
                        "lon": 117.13294195697,
                        "lat": 23.87404072539
                    },
                    {
                        "label": "长泰县",
                        "value": "350625",
                        "cityCode": "350600",
                        "provinceCode": "350000",
                        "lon": 117.81298738987,
                        "lat": 24.744593711082
                    },
                    {
                        "label": "东山县",
                        "value": "350626",
                        "cityCode": "350600",
                        "provinceCode": "350000",
                        "lon": 117.42541646767,
                        "lat": 23.691110309815
                    },
                    {
                        "label": "南靖县",
                        "value": "350627",
                        "cityCode": "350600",
                        "provinceCode": "350000",
                        "lon": 117.29305472699,
                        "lat": 24.668805586956
                    },
                    {
                        "label": "平和县",
                        "value": "350628",
                        "cityCode": "350600",
                        "provinceCode": "350000",
                        "lon": 117.20072092242,
                        "lat": 24.324490604831
                    },
                    {
                        "label": "华安县",
                        "value": "350629",
                        "cityCode": "350600",
                        "provinceCode": "350000",
                        "lon": 117.54380454982,
                        "lat": 24.918688094608
                    },
                    {
                        "label": "龙海市",
                        "value": "350681",
                        "cityCode": "350600",
                        "provinceCode": "350000",
                        "lon": 117.80759027663,
                        "lat": 24.398816824823
                    }
                ]
            },
            {
                "label": "南平市",
                "value": "350700",
                "provinceCode": "350000",
                "lon": 118.18188294866,
                "lat": 26.643626474198,
                "children": [
                    {
                        "label": "延平区",
                        "value": "350702",
                        "cityCode": "350700",
                        "provinceCode": "350000",
                        "lon": 118.25473662436,
                        "lat": 26.590155096909
                    },
                    {
                        "label": "建阳区",
                        "value": "350703",
                        "cityCode": "350700",
                        "provinceCode": "350000",
                        "lon": 118.09503169529,
                        "lat": 27.42298490861
                    },
                    {
                        "label": "顺昌县",
                        "value": "350721",
                        "cityCode": "350700",
                        "provinceCode": "350000",
                        "lon": 117.87368081029,
                        "lat": 26.908712277835
                    },
                    {
                        "label": "浦城县",
                        "value": "350722",
                        "cityCode": "350700",
                        "provinceCode": "350000",
                        "lon": 118.52429759856,
                        "lat": 27.945164125785
                    },
                    {
                        "label": "光泽县",
                        "value": "350723",
                        "cityCode": "350700",
                        "provinceCode": "350000",
                        "lon": 117.3555359708,
                        "lat": 27.655597572386
                    },
                    {
                        "label": "松溪县",
                        "value": "350724",
                        "cityCode": "350700",
                        "provinceCode": "350000",
                        "lon": 118.76568912522,
                        "lat": 27.610704490355
                    },
                    {
                        "label": "政和县",
                        "value": "350725",
                        "cityCode": "350700",
                        "provinceCode": "350000",
                        "lon": 118.97167122766,
                        "lat": 27.324781791328
                    },
                    {
                        "label": "邵武市",
                        "value": "350781",
                        "cityCode": "350700",
                        "provinceCode": "350000",
                        "lon": 117.48057222854,
                        "lat": 27.235197069611
                    },
                    {
                        "label": "武夷山市",
                        "value": "350782",
                        "cityCode": "350700",
                        "provinceCode": "350000",
                        "lon": 118.01154264632,
                        "lat": 27.748135171112
                    },
                    {
                        "label": "建瓯市",
                        "value": "350783",
                        "cityCode": "350700",
                        "provinceCode": "350000",
                        "lon": 118.48514716959,
                        "lat": 27.044913662799
                    }
                ]
            },
            {
                "label": "龙岩市",
                "value": "350800",
                "provinceCode": "350000",
                "lon": 117.01799673877,
                "lat": 25.078685433515,
                "children": [
                    {
                        "label": "新罗区",
                        "value": "350802",
                        "cityCode": "350800",
                        "provinceCode": "350000",
                        "lon": 117.08632241393,
                        "lat": 25.22220637939
                    },
                    {
                        "label": "永定区",
                        "value": "350803",
                        "cityCode": "350800",
                        "provinceCode": "350000",
                        "lon": 116.75552020871,
                        "lat": 24.733216812374
                    },
                    {
                        "label": "长汀县",
                        "value": "350821",
                        "cityCode": "350800",
                        "provinceCode": "350000",
                        "lon": 116.37188399052,
                        "lat": 25.696958495476
                    },
                    {
                        "label": "上杭县",
                        "value": "350823",
                        "cityCode": "350800",
                        "provinceCode": "350000",
                        "lon": 116.56866906668,
                        "lat": 25.126526144211
                    },
                    {
                        "label": "武平县",
                        "value": "350824",
                        "cityCode": "350800",
                        "provinceCode": "350000",
                        "lon": 116.13591657582,
                        "lat": 25.139021186901
                    },
                    {
                        "label": "连城县",
                        "value": "350825",
                        "cityCode": "350800",
                        "provinceCode": "350000",
                        "lon": 116.82144796403,
                        "lat": 25.60417681052
                    },
                    {
                        "label": "漳平市",
                        "value": "350881",
                        "cityCode": "350800",
                        "provinceCode": "350000",
                        "lon": 117.45172162006,
                        "lat": 25.379998346458
                    }
                ]
            },
            {
                "label": "宁德市",
                "value": "350900",
                "provinceCode": "350000",
                "lon": 119.54208214972,
                "lat": 26.656527419159,
                "children": [
                    {
                        "label": "蕉城区",
                        "value": "350902",
                        "cityCode": "350900",
                        "provinceCode": "350000",
                        "lon": 119.45455949068,
                        "lat": 26.763865425402
                    },
                    {
                        "label": "霞浦县",
                        "value": "350921",
                        "cityCode": "350900",
                        "provinceCode": "350000",
                        "lon": 119.99055111407,
                        "lat": 26.868876533651
                    },
                    {
                        "label": "古田县",
                        "value": "350922",
                        "cityCode": "350900",
                        "provinceCode": "350000",
                        "lon": 118.87954004139,
                        "lat": 26.618899035408
                    },
                    {
                        "label": "屏南县",
                        "value": "350923",
                        "cityCode": "350900",
                        "provinceCode": "350000",
                        "lon": 118.98929146416,
                        "lat": 26.921561586231
                    },
                    {
                        "label": "寿宁县",
                        "value": "350924",
                        "cityCode": "350900",
                        "provinceCode": "350000",
                        "lon": 119.5055198374,
                        "lat": 27.426229516207
                    },
                    {
                        "label": "周宁县",
                        "value": "350925",
                        "cityCode": "350900",
                        "provinceCode": "350000",
                        "lon": 119.31332559174,
                        "lat": 27.094312780593
                    },
                    {
                        "label": "柘荣县",
                        "value": "350926",
                        "cityCode": "350900",
                        "provinceCode": "350000",
                        "lon": 119.88752229998,
                        "lat": 27.207067709716
                    },
                    {
                        "label": "福安市",
                        "value": "350981",
                        "cityCode": "350900",
                        "provinceCode": "350000",
                        "lon": 119.65627713286,
                        "lat": 27.055896714799
                    },
                    {
                        "label": "福鼎市",
                        "value": "350982",
                        "cityCode": "350900",
                        "provinceCode": "350000",
                        "lon": 120.19830746412,
                        "lat": 27.224828701234
                    }
                ]
            }
        ],
        "label": "福建省",
        "value": "350000"
    },
    {
        "country": "china",
        "lon": 115.6760823667,
        "lat": 27.757258443441,
        "children": [
            {
                "label": "南昌市",
                "value": "360100",
                "provinceCode": "360000",
                "lon": 115.89352754584,
                "lat": 28.689578000141,
                "children": [
                    {
                        "label": "东湖区",
                        "value": "360102",
                        "cityCode": "360100",
                        "provinceCode": "360000",
                        "lon": 115.91014826387,
                        "lat": 28.692375145425
                    },
                    {
                        "label": "西湖区",
                        "value": "360103",
                        "cityCode": "360100",
                        "provinceCode": "360000",
                        "lon": 115.89894765179,
                        "lat": 28.657325885604
                    },
                    {
                        "label": "青云谱区",
                        "value": "360104",
                        "cityCode": "360100",
                        "provinceCode": "360000",
                        "lon": 115.9219541542,
                        "lat": 28.636601455215
                    },
                    {
                        "label": "湾里区",
                        "value": "360105",
                        "cityCode": "360100",
                        "provinceCode": "360000",
                        "lon": 115.75048047817,
                        "lat": 28.800556903151
                    },
                    {
                        "label": "青山湖区",
                        "value": "360111",
                        "cityCode": "360100",
                        "provinceCode": "360000",
                        "lon": 115.93090639742,
                        "lat": 28.700848503487
                    },
                    {
                        "label": "新建区",
                        "value": "360112",
                        "cityCode": "360100",
                        "provinceCode": "360000",
                        "lon": 115.97766347318,
                        "lat": 28.762510375641
                    },
                    {
                        "label": "南昌县",
                        "value": "360121",
                        "cityCode": "360100",
                        "provinceCode": "360000",
                        "lon": 116.07126087416,
                        "lat": 28.620772037399
                    },
                    {
                        "label": "安义县",
                        "value": "360123",
                        "cityCode": "360100",
                        "provinceCode": "360000",
                        "lon": 115.59520240179,
                        "lat": 28.836411855907
                    },
                    {
                        "label": "进贤县",
                        "value": "360124",
                        "cityCode": "360100",
                        "provinceCode": "360000",
                        "lon": 116.3174577813,
                        "lat": 28.441758032984
                    }
                ]
            },
            {
                "label": "景德镇市",
                "value": "360200",
                "provinceCode": "360000",
                "lon": 117.18652262527,
                "lat": 29.303562768448,
                "children": [
                    {
                        "label": "昌江区",
                        "value": "360202",
                        "cityCode": "360200",
                        "provinceCode": "360000",
                        "lon": 117.1861998641,
                        "lat": 29.272154837188
                    },
                    {
                        "label": "珠山区",
                        "value": "360203",
                        "cityCode": "360200",
                        "provinceCode": "360000",
                        "lon": 117.23411943253,
                        "lat": 29.303230556708
                    },
                    {
                        "label": "浮梁县",
                        "value": "360222",
                        "cityCode": "360200",
                        "provinceCode": "360000",
                        "lon": 117.30897851315,
                        "lat": 29.556555537931
                    },
                    {
                        "label": "乐平市",
                        "value": "360281",
                        "cityCode": "360200",
                        "provinceCode": "360000",
                        "lon": 117.27327879748,
                        "lat": 28.969928213838
                    }
                ]
            },
            {
                "label": "萍乡市",
                "value": "360300",
                "provinceCode": "360000",
                "lon": 113.85991703301,
                "lat": 27.639544222952,
                "children": [
                    {
                        "label": "安源区",
                        "value": "360302",
                        "cityCode": "360300",
                        "provinceCode": "360000",
                        "lon": 113.87886885384,
                        "lat": 27.645394991779
                    },
                    {
                        "label": "湘东区",
                        "value": "360313",
                        "cityCode": "360300",
                        "provinceCode": "360000",
                        "lon": 113.73981816772,
                        "lat": 27.53370963141
                    },
                    {
                        "label": "莲花县",
                        "value": "360321",
                        "cityCode": "360300",
                        "provinceCode": "360000",
                        "lon": 113.95977686775,
                        "lat": 27.223445481289
                    },
                    {
                        "label": "上栗县",
                        "value": "360322",
                        "cityCode": "360300",
                        "provinceCode": "360000",
                        "lon": 113.86780638258,
                        "lat": 27.832260223294
                    },
                    {
                        "label": "芦溪县",
                        "value": "360323",
                        "cityCode": "360300",
                        "provinceCode": "360000",
                        "lon": 114.07000665468,
                        "lat": 27.578022564845
                    }
                ]
            },
            {
                "label": "九江市",
                "value": "360400",
                "provinceCode": "360000",
                "lon": 115.99984802155,
                "lat": 29.719639526122,
                "children": [
                    {
                        "label": "濂溪区",
                        "value": "360402",
                        "cityCode": "360400",
                        "provinceCode": "360000",
                        "lon": 115.99984802155,
                        "lat": 29.719639526122
                    },
                    {
                        "label": "浔阳区",
                        "value": "360403",
                        "cityCode": "360400",
                        "provinceCode": "360000",
                        "lon": 116.00276787378,
                        "lat": 29.717848894949
                    },
                    {
                        "label": "武宁县",
                        "value": "360423",
                        "cityCode": "360400",
                        "provinceCode": "360000",
                        "lon": 115.02315949078,
                        "lat": 29.263844028424
                    },
                    {
                        "label": "修水县",
                        "value": "360424",
                        "cityCode": "360400",
                        "provinceCode": "360000",
                        "lon": 114.4461918569,
                        "lat": 29.000021311275
                    },
                    {
                        "label": "永修县",
                        "value": "360425",
                        "cityCode": "360400",
                        "provinceCode": "360000",
                        "lon": 115.74247538366,
                        "lat": 29.141310623242
                    },
                    {
                        "label": "德安县",
                        "value": "360426",
                        "cityCode": "360400",
                        "provinceCode": "360000",
                        "lon": 115.63408426446,
                        "lat": 29.401728483728
                    },
                    {
                        "label": "都昌县",
                        "value": "360428",
                        "cityCode": "360400",
                        "provinceCode": "360000",
                        "lon": 116.34204769578,
                        "lat": 29.356214912479
                    },
                    {
                        "label": "湖口县",
                        "value": "360429",
                        "cityCode": "360400",
                        "provinceCode": "360000",
                        "lon": 116.29256118736,
                        "lat": 29.66806050769
                    },
                    {
                        "label": "彭泽县",
                        "value": "360430",
                        "cityCode": "360400",
                        "provinceCode": "360000",
                        "lon": 116.62933206226,
                        "lat": 29.834597412665
                    },
                    {
                        "label": "瑞昌市",
                        "value": "360481",
                        "cityCode": "360400",
                        "provinceCode": "360000",
                        "lon": 115.45968602847,
                        "lat": 29.628544625483
                    },
                    {
                        "label": "共青城市",
                        "value": "360482",
                        "cityCode": "360400",
                        "provinceCode": "360000",
                        "lon": 115.820204477,
                        "lat": 29.236083846739
                    },
                    {
                        "label": "庐山市",
                        "value": "360483",
                        "cityCode": "360400",
                        "provinceCode": "360000",
                        "lon": 115.98274999338,
                        "lat": 29.347769476561
                    }
                ]
            },
            {
                "label": "新余市",
                "value": "360500",
                "provinceCode": "360000",
                "lon": 114.94711741679,
                "lat": 27.822321558629,
                "children": [
                    {
                        "label": "渝水区",
                        "value": "360502",
                        "cityCode": "360500",
                        "provinceCode": "360000",
                        "lon": 115.00785062298,
                        "lat": 27.850578117027
                    },
                    {
                        "label": "分宜县",
                        "value": "360521",
                        "cityCode": "360500",
                        "provinceCode": "360000",
                        "lon": 114.67816306735,
                        "lat": 27.844993335525
                    }
                ]
            },
            {
                "label": "鹰潭市",
                "value": "360600",
                "provinceCode": "360000",
                "lon": 117.03545018601,
                "lat": 28.241309597182,
                "children": [
                    {
                        "label": "月湖区",
                        "value": "360602",
                        "cityCode": "360600",
                        "provinceCode": "360000",
                        "lon": 117.05770601694,
                        "lat": 28.2472053807
                    },
                    {
                        "label": "贵溪市",
                        "value": "360681",
                        "cityCode": "360600",
                        "provinceCode": "360000",
                        "lon": 117.19787036817,
                        "lat": 28.190604458955
                    }
                ]
            },
            {
                "label": "赣州市",
                "value": "360700",
                "provinceCode": "360000",
                "lon": 114.93590907928,
                "lat": 25.845295536347,
                "children": [
                    {
                        "label": "章贡区",
                        "value": "360702",
                        "cityCode": "360700",
                        "provinceCode": "360000",
                        "lon": 114.93736527747,
                        "lat": 25.838710922212
                    },
                    {
                        "label": "南康区",
                        "value": "360703",
                        "cityCode": "360700",
                        "provinceCode": "360000",
                        "lon": 114.70979725341,
                        "lat": 25.857651685208
                    },
                    {
                        "label": "信丰县",
                        "value": "360722",
                        "cityCode": "360700",
                        "provinceCode": "360000",
                        "lon": 114.98179982408,
                        "lat": 25.286018342725
                    },
                    {
                        "label": "大余县",
                        "value": "360723",
                        "cityCode": "360700",
                        "provinceCode": "360000",
                        "lon": 114.36649000169,
                        "lat": 25.44847167429
                    },
                    {
                        "label": "上犹县",
                        "value": "360724",
                        "cityCode": "360700",
                        "provinceCode": "360000",
                        "lon": 114.402605282,
                        "lat": 25.939253373895
                    },
                    {
                        "label": "崇义县",
                        "value": "360725",
                        "cityCode": "360700",
                        "provinceCode": "360000",
                        "lon": 114.19933700414,
                        "lat": 25.679632268061
                    },
                    {
                        "label": "安远县",
                        "value": "360726",
                        "cityCode": "360700",
                        "provinceCode": "360000",
                        "lon": 115.39661257033,
                        "lat": 25.238854104103
                    },
                    {
                        "label": "龙南县",
                        "value": "360727",
                        "cityCode": "360700",
                        "provinceCode": "360000",
                        "lon": 114.73182493834,
                        "lat": 24.772706198589
                    },
                    {
                        "label": "定南县",
                        "value": "360728",
                        "cityCode": "360700",
                        "provinceCode": "360000",
                        "lon": 115.09388033666,
                        "lat": 24.824160396247
                    },
                    {
                        "label": "全南县",
                        "value": "360729",
                        "cityCode": "360700",
                        "provinceCode": "360000",
                        "lon": 114.52234265684,
                        "lat": 24.853232801668
                    },
                    {
                        "label": "宁都县",
                        "value": "360730",
                        "cityCode": "360700",
                        "provinceCode": "360000",
                        "lon": 116.01211627388,
                        "lat": 26.590232461651
                    },
                    {
                        "label": "于都县",
                        "value": "360731",
                        "cityCode": "360700",
                        "provinceCode": "360000",
                        "lon": 115.50889266701,
                        "lat": 25.936771660723
                    },
                    {
                        "label": "兴国县",
                        "value": "360732",
                        "cityCode": "360700",
                        "provinceCode": "360000",
                        "lon": 115.44650725812,
                        "lat": 26.425200601326
                    },
                    {
                        "label": "会昌县",
                        "value": "360733",
                        "cityCode": "360700",
                        "provinceCode": "360000",
                        "lon": 115.76515116427,
                        "lat": 25.505756516053
                    },
                    {
                        "label": "寻乌县",
                        "value": "360734",
                        "cityCode": "360700",
                        "provinceCode": "360000",
                        "lon": 115.66514812504,
                        "lat": 24.905101066212
                    },
                    {
                        "label": "石城县",
                        "value": "360735",
                        "cityCode": "360700",
                        "provinceCode": "360000",
                        "lon": 116.37232152813,
                        "lat": 26.305565307867
                    },
                    {
                        "label": "瑞金市",
                        "value": "360781",
                        "cityCode": "360700",
                        "provinceCode": "360000",
                        "lon": 115.98586699622,
                        "lat": 25.92183136176
                    }
                ]
            },
            {
                "label": "吉安市",
                "value": "360800",
                "provinceCode": "360000",
                "lon": 114.99203871092,
                "lat": 27.113847650157,
                "children": [
                    {
                        "label": "吉州区",
                        "value": "360802",
                        "cityCode": "360800",
                        "provinceCode": "360000",
                        "lon": 114.96043668241,
                        "lat": 27.160925346239
                    },
                    {
                        "label": "青原区",
                        "value": "360803",
                        "cityCode": "360800",
                        "provinceCode": "360000",
                        "lon": 115.2661672372,
                        "lat": 26.859217102443
                    },
                    {
                        "label": "吉安县",
                        "value": "360821",
                        "cityCode": "360800",
                        "provinceCode": "360000",
                        "lon": 114.75127781381,
                        "lat": 27.144039043235
                    },
                    {
                        "label": "吉水县",
                        "value": "360822",
                        "cityCode": "360800",
                        "provinceCode": "360000",
                        "lon": 115.2546383758,
                        "lat": 27.19746539341
                    },
                    {
                        "label": "峡江县",
                        "value": "360823",
                        "cityCode": "360800",
                        "provinceCode": "360000",
                        "lon": 115.2144367887,
                        "lat": 27.589281248366
                    },
                    {
                        "label": "新干县",
                        "value": "360824",
                        "cityCode": "360800",
                        "provinceCode": "360000",
                        "lon": 115.50683935381,
                        "lat": 27.73857991921
                    },
                    {
                        "label": "永丰县",
                        "value": "360825",
                        "cityCode": "360800",
                        "provinceCode": "360000",
                        "lon": 115.59283108743,
                        "lat": 27.097544566001
                    },
                    {
                        "label": "泰和县",
                        "value": "360826",
                        "cityCode": "360800",
                        "provinceCode": "360000",
                        "lon": 114.90935609718,
                        "lat": 26.744020657469
                    },
                    {
                        "label": "遂川县",
                        "value": "360827",
                        "cityCode": "360800",
                        "provinceCode": "360000",
                        "lon": 114.37058927285,
                        "lat": 26.344268552348
                    },
                    {
                        "label": "万安县",
                        "value": "360828",
                        "cityCode": "360800",
                        "provinceCode": "360000",
                        "lon": 114.82501601739,
                        "lat": 26.444632606143
                    },
                    {
                        "label": "安福县",
                        "value": "360829",
                        "cityCode": "360800",
                        "provinceCode": "360000",
                        "lon": 114.45559104078,
                        "lat": 27.361338381942
                    },
                    {
                        "label": "永新县",
                        "value": "360830",
                        "cityCode": "360800",
                        "provinceCode": "360000",
                        "lon": 114.18844710958,
                        "lat": 26.973089209998
                    },
                    {
                        "label": "井冈山市",
                        "value": "360881",
                        "cityCode": "360800",
                        "provinceCode": "360000",
                        "lon": 114.12543918071,
                        "lat": 26.633149538063
                    }
                ]
            },
            {
                "label": "宜春市",
                "value": "360900",
                "provinceCode": "360000",
                "lon": 114.40003867156,
                "lat": 27.811129895843,
                "children": [
                    {
                        "label": "袁州区",
                        "value": "360902",
                        "cityCode": "360900",
                        "provinceCode": "360000",
                        "lon": 114.29035792969,
                        "lat": 27.839383216183
                    },
                    {
                        "label": "奉新县",
                        "value": "360921",
                        "cityCode": "360900",
                        "provinceCode": "360000",
                        "lon": 115.18007761153,
                        "lat": 28.714689488559
                    },
                    {
                        "label": "万载县",
                        "value": "360922",
                        "cityCode": "360900",
                        "provinceCode": "360000",
                        "lon": 114.33614285625,
                        "lat": 28.209464188761
                    },
                    {
                        "label": "上高县",
                        "value": "360923",
                        "cityCode": "360900",
                        "provinceCode": "360000",
                        "lon": 114.86095818884,
                        "lat": 28.199053404375
                    },
                    {
                        "label": "宜丰县",
                        "value": "360924",
                        "cityCode": "360900",
                        "provinceCode": "360000",
                        "lon": 114.77436594756,
                        "lat": 28.454955048263
                    },
                    {
                        "label": "靖安县",
                        "value": "360925",
                        "cityCode": "360900",
                        "provinceCode": "360000",
                        "lon": 115.23770855063,
                        "lat": 28.946083546903
                    },
                    {
                        "label": "铜鼓县",
                        "value": "360926",
                        "cityCode": "360900",
                        "provinceCode": "360000",
                        "lon": 114.37013409066,
                        "lat": 28.615515536873
                    },
                    {
                        "label": "丰城市",
                        "value": "360981",
                        "cityCode": "360900",
                        "provinceCode": "360000",
                        "lon": 115.8234035155,
                        "lat": 28.11151587847
                    },
                    {
                        "label": "樟树市",
                        "value": "360982",
                        "cityCode": "360900",
                        "provinceCode": "360000",
                        "lon": 115.42134592031,
                        "lat": 28.002513613496
                    },
                    {
                        "label": "高安市",
                        "value": "360983",
                        "cityCode": "360900",
                        "provinceCode": "360000",
                        "lon": 115.30448193078,
                        "lat": 28.365231807956
                    }
                ]
            },
            {
                "label": "抚州市",
                "value": "361000",
                "provinceCode": "360000",
                "lon": 116.36091886693,
                "lat": 27.95454517027,
                "children": [
                    {
                        "label": "临川区",
                        "value": "361002",
                        "cityCode": "361000",
                        "provinceCode": "360000",
                        "lon": 116.36297445174,
                        "lat": 27.924731514346
                    },
                    {
                        "label": "南城县",
                        "value": "361021",
                        "cityCode": "361000",
                        "provinceCode": "360000",
                        "lon": 116.68173230038,
                        "lat": 27.518966176458
                    },
                    {
                        "label": "黎川县",
                        "value": "361022",
                        "cityCode": "361000",
                        "provinceCode": "360000",
                        "lon": 116.93171710122,
                        "lat": 27.261522440114
                    },
                    {
                        "label": "南丰县",
                        "value": "361023",
                        "cityCode": "361000",
                        "provinceCode": "360000",
                        "lon": 116.50036153348,
                        "lat": 27.114896155721
                    },
                    {
                        "label": "崇仁县",
                        "value": "361024",
                        "cityCode": "361000",
                        "provinceCode": "360000",
                        "lon": 116.0663364594,
                        "lat": 27.714537232977
                    },
                    {
                        "label": "乐安县",
                        "value": "361025",
                        "cityCode": "361000",
                        "provinceCode": "360000",
                        "lon": 115.8433235072,
                        "lat": 27.372428601937
                    },
                    {
                        "label": "宜黄县",
                        "value": "361026",
                        "cityCode": "361000",
                        "provinceCode": "360000",
                        "lon": 116.25124162127,
                        "lat": 27.393066587894
                    },
                    {
                        "label": "金溪县",
                        "value": "361027",
                        "cityCode": "361000",
                        "provinceCode": "360000",
                        "lon": 116.7577119166,
                        "lat": 27.931491559982
                    },
                    {
                        "label": "资溪县",
                        "value": "361028",
                        "cityCode": "361000",
                        "provinceCode": "360000",
                        "lon": 117.03576739532,
                        "lat": 27.745228535574
                    },
                    {
                        "label": "广昌县",
                        "value": "361030",
                        "cityCode": "361000",
                        "provinceCode": "360000",
                        "lon": 116.36311652024,
                        "lat": 26.761885358703
                    }
                ]
            },
            {
                "label": "上饶市",
                "value": "361100",
                "provinceCode": "360000",
                "lon": 117.95546387715,
                "lat": 28.457622553937,
                "children": [
                    {
                        "label": "信州区",
                        "value": "361102",
                        "cityCode": "361100",
                        "provinceCode": "360000",
                        "lon": 118.05057821628,
                        "lat": 28.497223477761
                    },
                    {
                        "label": "广丰区",
                        "value": "361103",
                        "cityCode": "361100",
                        "provinceCode": "360000",
                        "lon": 118.2644206827,
                        "lat": 28.344342110797
                    },
                    {
                        "label": "玉山县",
                        "value": "361123",
                        "cityCode": "361100",
                        "provinceCode": "360000",
                        "lon": 118.16891675165,
                        "lat": 28.759339988568
                    },
                    {
                        "label": "铅山县",
                        "value": "361124",
                        "cityCode": "361100",
                        "provinceCode": "360000",
                        "lon": 117.71346110788,
                        "lat": 28.109822141358
                    },
                    {
                        "label": "横峰县",
                        "value": "361125",
                        "cityCode": "361100",
                        "provinceCode": "360000",
                        "lon": 117.64519741314,
                        "lat": 28.513847494908
                    },
                    {
                        "label": "弋阳县",
                        "value": "361126",
                        "cityCode": "361100",
                        "provinceCode": "360000",
                        "lon": 117.41664984164,
                        "lat": 28.452236031909
                    },
                    {
                        "label": "余干县",
                        "value": "361127",
                        "cityCode": "361100",
                        "provinceCode": "360000",
                        "lon": 116.62132713524,
                        "lat": 28.682775556852
                    },
                    {
                        "label": "鄱阳县",
                        "value": "361128",
                        "cityCode": "361100",
                        "provinceCode": "360000",
                        "lon": 116.78769263036,
                        "lat": 29.243055725231
                    },
                    {
                        "label": "万年县",
                        "value": "361129",
                        "cityCode": "361100",
                        "provinceCode": "360000",
                        "lon": 117.01441274225,
                        "lat": 28.703236407929
                    },
                    {
                        "label": "婺源县",
                        "value": "361130",
                        "cityCode": "361100",
                        "provinceCode": "360000",
                        "lon": 117.78748504184,
                        "lat": 29.327231721148
                    },
                    {
                        "label": "德兴市",
                        "value": "361181",
                        "cityCode": "361100",
                        "provinceCode": "360000",
                        "lon": 117.75325925179,
                        "lat": 28.940751536947
                    }
                ]
            }
        ],
        "label": "江西省",
        "value": "360000"
    },
    {
        "country": "china",
        "lon": 118.52766339288,
        "lat": 36.099289929728,
        "children": [
            {
                "label": "济南市",
                "value": "370100",
                "provinceCode": "370000",
                "lon": 117.02496706629,
                "lat": 36.682784727161,
                "children": [
                    {
                        "label": "历下区",
                        "value": "370102",
                        "cityCode": "370100",
                        "provinceCode": "370000",
                        "lon": 117.10158579685,
                        "lat": 36.659338577102
                    },
                    {
                        "label": "市中区",
                        "value": "370103",
                        "cityCode": "370100",
                        "provinceCode": "370000",
                        "lon": 116.97943490154,
                        "lat": 36.584025608593
                    },
                    {
                        "label": "槐荫区",
                        "value": "370104",
                        "cityCode": "370100",
                        "provinceCode": "370000",
                        "lon": 116.89119924147,
                        "lat": 36.682531368156
                    },
                    {
                        "label": "天桥区",
                        "value": "370105",
                        "cityCode": "370100",
                        "provinceCode": "370000",
                        "lon": 116.98315714712,
                        "lat": 36.778077694991
                    },
                    {
                        "label": "历城区",
                        "value": "370112",
                        "cityCode": "370100",
                        "provinceCode": "370000",
                        "lon": 117.1908183999,
                        "lat": 36.612688160201
                    },
                    {
                        "label": "长清区",
                        "value": "370113",
                        "cityCode": "370100",
                        "provinceCode": "370000",
                        "lon": 116.8035523233,
                        "lat": 36.428570220761
                    },
                    {
                        "label": "钢城区",
                        "value": "370117",
                        "cityCode": "370100",
                        "provinceCode": "370000",
                        "lon": 117.8275371813,
                        "lat": 36.092835887233
                    },
                    {
                        "label": "平阴县",
                        "value": "370124",
                        "cityCode": "370100",
                        "provinceCode": "370000",
                        "lon": 116.42250204992,
                        "lat": 36.203933440502
                    },
                    {
                        "label": "商河县",
                        "value": "370126",
                        "cityCode": "370100",
                        "provinceCode": "370000",
                        "lon": 117.20871442383,
                        "lat": 37.32594723869
                    }
                ]
            },
            {
                "label": "青岛市",
                "value": "370200",
                "provinceCode": "370000",
                "lon": 120.38442818368,
                "lat": 36.105214901274,
                "children": [
                    {
                        "label": "市南区",
                        "value": "370202",
                        "cityCode": "370200",
                        "provinceCode": "370000",
                        "lon": 120.37618412944,
                        "lat": 36.072517005321
                    },
                    {
                        "label": "市北区",
                        "value": "370203",
                        "cityCode": "370200",
                        "provinceCode": "370000",
                        "lon": 120.37849501736,
                        "lat": 36.100057507009
                    },
                    {
                        "label": "黄岛区",
                        "value": "370211",
                        "cityCode": "370200",
                        "provinceCode": "370000",
                        "lon": 120.16954109898,
                        "lat": 36.005019406172
                    },
                    {
                        "label": "崂山区",
                        "value": "370212",
                        "cityCode": "370200",
                        "provinceCode": "370000",
                        "lon": 120.58490643507,
                        "lat": 36.195587169547
                    },
                    {
                        "label": "李沧区",
                        "value": "370213",
                        "cityCode": "370200",
                        "provinceCode": "370000",
                        "lon": 120.43114552866,
                        "lat": 36.192897252321
                    },
                    {
                        "label": "城阳区",
                        "value": "370214",
                        "cityCode": "370200",
                        "provinceCode": "370000",
                        "lon": 120.34632618533,
                        "lat": 36.284246909785
                    },
                    {
                        "label": "胶州市",
                        "value": "370281",
                        "cityCode": "370200",
                        "provinceCode": "370000",
                        "lon": 119.95942122689,
                        "lat": 36.248031458483
                    },
                    {
                        "label": "平度市",
                        "value": "370283",
                        "cityCode": "370200",
                        "provinceCode": "370000",
                        "lon": 119.95106201677,
                        "lat": 36.788550047135
                    },
                    {
                        "label": "莱西市",
                        "value": "370285",
                        "cityCode": "370200",
                        "provinceCode": "370000",
                        "lon": 120.44283105064,
                        "lat": 36.863636936232
                    }
                ]
            },
            {
                "label": "淄博市",
                "value": "370300",
                "provinceCode": "370000",
                "lon": 118.05913427787,
                "lat": 36.804684854212,
                "children": [
                    {
                        "label": "淄川区",
                        "value": "370302",
                        "cityCode": "370300",
                        "provinceCode": "370000",
                        "lon": 118.02018132413,
                        "lat": 36.58546320707
                    },
                    {
                        "label": "张店区",
                        "value": "370303",
                        "cityCode": "370300",
                        "provinceCode": "370000",
                        "lon": 118.07715128035,
                        "lat": 36.816096523468
                    },
                    {
                        "label": "博山区",
                        "value": "370304",
                        "cityCode": "370300",
                        "provinceCode": "370000",
                        "lon": 117.96555278725,
                        "lat": 36.425426903116
                    },
                    {
                        "label": "临淄区",
                        "value": "370305",
                        "cityCode": "370300",
                        "provinceCode": "370000",
                        "lon": 118.30069695082,
                        "lat": 36.854244021624
                    },
                    {
                        "label": "周村区",
                        "value": "370306",
                        "cityCode": "370300",
                        "provinceCode": "370000",
                        "lon": 117.87510840602,
                        "lat": 36.771218733055
                    },
                    {
                        "label": "桓台县",
                        "value": "370321",
                        "cityCode": "370300",
                        "provinceCode": "370000",
                        "lon": 118.0343674972,
                        "lat": 36.996290174374
                    },
                    {
                        "label": "高青县",
                        "value": "370322",
                        "cityCode": "370300",
                        "provinceCode": "370000",
                        "lon": 117.82824157972,
                        "lat": 37.171377591723
                    },
                    {
                        "label": "沂源县",
                        "value": "370323",
                        "cityCode": "370300",
                        "provinceCode": "370000",
                        "lon": 118.20397204172,
                        "lat": 36.135641879756
                    }
                ]
            },
            {
                "label": "枣庄市",
                "value": "370400",
                "provinceCode": "370000",
                "lon": 117.2793053833,
                "lat": 34.807883078386,
                "children": [
                    {
                        "label": "市中区",
                        "value": "370402",
                        "cityCode": "370400",
                        "provinceCode": "370000",
                        "lon": 116.97943490154,
                        "lat": 36.584025608593
                    },
                    {
                        "label": "薛城区",
                        "value": "370403",
                        "cityCode": "370400",
                        "provinceCode": "370000",
                        "lon": 117.35850706735,
                        "lat": 34.796330499958
                    },
                    {
                        "label": "峄城区",
                        "value": "370404",
                        "cityCode": "370400",
                        "provinceCode": "370000",
                        "lon": 117.60355623943,
                        "lat": 34.716097133125
                    },
                    {
                        "label": "台儿庄区",
                        "value": "370405",
                        "cityCode": "370400",
                        "provinceCode": "370000",
                        "lon": 117.63824339976,
                        "lat": 34.587964202085
                    },
                    {
                        "label": "山亭区",
                        "value": "370406",
                        "cityCode": "370400",
                        "provinceCode": "370000",
                        "lon": 117.48403628836,
                        "lat": 35.093150446743
                    },
                    {
                        "label": "滕州市",
                        "value": "370481",
                        "cityCode": "370400",
                        "provinceCode": "370000",
                        "lon": 117.1476161953,
                        "lat": 35.065790871862
                    }
                ]
            },
            {
                "label": "东营市",
                "value": "370500",
                "provinceCode": "370000",
                "lon": 118.58392633307,
                "lat": 37.487121155276,
                "children": [
                    {
                        "label": "东营区",
                        "value": "370502",
                        "cityCode": "370500",
                        "provinceCode": "370000",
                        "lon": 118.61264305188,
                        "lat": 37.408666288041
                    },
                    {
                        "label": "河口区",
                        "value": "370503",
                        "cityCode": "370500",
                        "provinceCode": "370000",
                        "lon": 118.62001162992,
                        "lat": 37.969499930854
                    },
                    {
                        "label": "垦利区",
                        "value": "370505",
                        "cityCode": "370500",
                        "provinceCode": "370000",
                        "lon": 118.80543474393,
                        "lat": 37.708139143783
                    },
                    {
                        "label": "利津县",
                        "value": "370522",
                        "cityCode": "370500",
                        "provinceCode": "370000",
                        "lon": 118.40033677253,
                        "lat": 37.655326413663
                    },
                    {
                        "label": "广饶县",
                        "value": "370523",
                        "cityCode": "370500",
                        "provinceCode": "370000",
                        "lon": 118.53856931196,
                        "lat": 37.162071119184
                    }
                ]
            },
            {
                "label": "烟台市",
                "value": "370600",
                "provinceCode": "370000",
                "lon": 121.30955503009,
                "lat": 37.53656156286,
                "children": [
                    {
                        "label": "芝罘区",
                        "value": "370602",
                        "cityCode": "370600",
                        "provinceCode": "370000",
                        "lon": 121.36415635471,
                        "lat": 37.520933396965
                    },
                    {
                        "label": "福山区",
                        "value": "370611",
                        "cityCode": "370600",
                        "provinceCode": "370000",
                        "lon": 121.20346125307,
                        "lat": 37.4810742238
                    },
                    {
                        "label": "牟平区",
                        "value": "370612",
                        "cityCode": "370600",
                        "provinceCode": "370000",
                        "lon": 121.56924005155,
                        "lat": 37.272445856085
                    },
                    {
                        "label": "莱山区",
                        "value": "370613",
                        "cityCode": "370600",
                        "provinceCode": "370000",
                        "lon": 121.45153473051,
                        "lat": 37.407476077054
                    },
                    {
                        "label": "长岛县",
                        "value": "370634",
                        "cityCode": "370600",
                        "provinceCode": "370000",
                        "lon": 120.75599624581,
                        "lat": 38.07745626718
                    },
                    {
                        "label": "龙口市",
                        "value": "370681",
                        "cityCode": "370600",
                        "provinceCode": "370000",
                        "lon": 120.5227995064,
                        "lat": 37.610401281677
                    },
                    {
                        "label": "莱阳市",
                        "value": "370682",
                        "cityCode": "370600",
                        "provinceCode": "370000",
                        "lon": 120.75134338103,
                        "lat": 36.905533169255
                    },
                    {
                        "label": "莱州市",
                        "value": "370683",
                        "cityCode": "370600",
                        "provinceCode": "370000",
                        "lon": 120.00134352944,
                        "lat": 37.190401374398
                    },
                    {
                        "label": "蓬莱市",
                        "value": "370684",
                        "cityCode": "370600",
                        "provinceCode": "370000",
                        "lon": 120.86269428184,
                        "lat": 37.661160410834
                    },
                    {
                        "label": "招远市",
                        "value": "370685",
                        "cityCode": "370600",
                        "provinceCode": "370000",
                        "lon": 120.40051706225,
                        "lat": 37.344145870524
                    },
                    {
                        "label": "栖霞市",
                        "value": "370686",
                        "cityCode": "370600",
                        "provinceCode": "370000",
                        "lon": 120.9015556194,
                        "lat": 37.311748207049
                    },
                    {
                        "label": "海阳市",
                        "value": "370687",
                        "cityCode": "370600",
                        "provinceCode": "370000",
                        "lon": 121.11361421128,
                        "lat": 36.861587988875
                    }
                ]
            },
            {
                "label": "潍坊市",
                "value": "370700",
                "provinceCode": "370000",
                "lon": 119.14263382297,
                "lat": 36.716114873051,
                "children": [
                    {
                        "label": "潍城区",
                        "value": "370702",
                        "cityCode": "370700",
                        "provinceCode": "370000",
                        "lon": 119.03430547775,
                        "lat": 36.70198215587
                    },
                    {
                        "label": "寒亭区",
                        "value": "370703",
                        "cityCode": "370700",
                        "provinceCode": "370000",
                        "lon": 119.17913537725,
                        "lat": 36.908365760671
                    },
                    {
                        "label": "坊子区",
                        "value": "370704",
                        "cityCode": "370700",
                        "provinceCode": "370000",
                        "lon": 119.25846542234,
                        "lat": 36.625674339008
                    },
                    {
                        "label": "奎文区",
                        "value": "370705",
                        "cityCode": "370700",
                        "provinceCode": "370000",
                        "lon": 119.19697218249,
                        "lat": 36.691227364273
                    },
                    {
                        "label": "临朐县",
                        "value": "370724",
                        "cityCode": "370700",
                        "provinceCode": "370000",
                        "lon": 118.55825637254,
                        "lat": 36.365388839543
                    },
                    {
                        "label": "昌乐县",
                        "value": "370725",
                        "cityCode": "370700",
                        "provinceCode": "370000",
                        "lon": 118.91391393621,
                        "lat": 36.535532052698
                    },
                    {
                        "label": "青州市",
                        "value": "370781",
                        "cityCode": "370700",
                        "provinceCode": "370000",
                        "lon": 118.47018708791,
                        "lat": 36.680584425831
                    },
                    {
                        "label": "诸城市",
                        "value": "370782",
                        "cityCode": "370700",
                        "provinceCode": "370000",
                        "lon": 119.41616966208,
                        "lat": 36.016657533378
                    },
                    {
                        "label": "寿光市",
                        "value": "370783",
                        "cityCode": "370700",
                        "provinceCode": "370000",
                        "lon": 118.85253352124,
                        "lat": 37.029891849506
                    },
                    {
                        "label": "安丘市",
                        "value": "370784",
                        "cityCode": "370700",
                        "provinceCode": "370000",
                        "lon": 119.15599227984,
                        "lat": 36.335046466579
                    },
                    {
                        "label": "高密市",
                        "value": "370785",
                        "cityCode": "370700",
                        "provinceCode": "370000",
                        "lon": 119.70251223974,
                        "lat": 36.387317992315
                    },
                    {
                        "label": "昌邑市",
                        "value": "370786",
                        "cityCode": "370700",
                        "provinceCode": "370000",
                        "lon": 119.44991748822,
                        "lat": 36.834234247985
                    }
                ]
            },
            {
                "label": "济宁市",
                "value": "370800",
                "provinceCode": "370000",
                "lon": 116.60079762482,
                "lat": 35.402121664331,
                "children": [
                    {
                        "label": "任城区",
                        "value": "370811",
                        "cityCode": "370800",
                        "provinceCode": "370000",
                        "lon": 116.57219935158,
                        "lat": 35.380134737043
                    },
                    {
                        "label": "兖州区",
                        "value": "370812",
                        "cityCode": "370800",
                        "provinceCode": "370000",
                        "lon": 116.75256014243,
                        "lat": 35.564429514451
                    },
                    {
                        "label": "微山县",
                        "value": "370826",
                        "cityCode": "370800",
                        "provinceCode": "370000",
                        "lon": 116.99240869227,
                        "lat": 34.892715408071
                    },
                    {
                        "label": "鱼台县",
                        "value": "370827",
                        "cityCode": "370800",
                        "provinceCode": "370000",
                        "lon": 116.57843727094,
                        "lat": 35.01985835793
                    },
                    {
                        "label": "金乡县",
                        "value": "370828",
                        "cityCode": "370800",
                        "provinceCode": "370000",
                        "lon": 116.31512496802,
                        "lat": 35.051246098924
                    },
                    {
                        "label": "嘉祥县",
                        "value": "370829",
                        "cityCode": "370800",
                        "provinceCode": "370000",
                        "lon": 116.30729105899,
                        "lat": 35.434199027209
                    },
                    {
                        "label": "汶上县",
                        "value": "370830",
                        "cityCode": "370800",
                        "provinceCode": "370000",
                        "lon": 116.50644367868,
                        "lat": 35.715701266031
                    },
                    {
                        "label": "泗水县",
                        "value": "370831",
                        "cityCode": "370800",
                        "provinceCode": "370000",
                        "lon": 117.34526415391,
                        "lat": 35.640740666213
                    },
                    {
                        "label": "梁山县",
                        "value": "370832",
                        "cityCode": "370800",
                        "provinceCode": "370000",
                        "lon": 116.12480570072,
                        "lat": 35.801606249716
                    },
                    {
                        "label": "曲阜市",
                        "value": "370881",
                        "cityCode": "370800",
                        "provinceCode": "370000",
                        "lon": 117.03178985128,
                        "lat": 35.615760566258
                    },
                    {
                        "label": "邹城市",
                        "value": "370883",
                        "cityCode": "370800",
                        "provinceCode": "370000",
                        "lon": 117.08958175113,
                        "lat": 35.354042540878
                    }
                ]
            },
            {
                "label": "泰安市",
                "value": "370900",
                "provinceCode": "370000",
                "lon": 117.08941491714,
                "lat": 36.188077758948,
                "children": [
                    {
                        "label": "泰山区",
                        "value": "370902",
                        "cityCode": "370900",
                        "provinceCode": "370000",
                        "lon": 117.18390217966,
                        "lat": 36.215457241311
                    },
                    {
                        "label": "岱岳区",
                        "value": "370911",
                        "cityCode": "370900",
                        "provinceCode": "370000",
                        "lon": 117.19048736581,
                        "lat": 36.148101133087
                    },
                    {
                        "label": "宁阳县",
                        "value": "370921",
                        "cityCode": "370900",
                        "provinceCode": "370000",
                        "lon": 116.93293882598,
                        "lat": 35.833600319907
                    },
                    {
                        "label": "东平县",
                        "value": "370923",
                        "cityCode": "370900",
                        "provinceCode": "370000",
                        "lon": 116.34295320558,
                        "lat": 35.97516090244
                    },
                    {
                        "label": "新泰市",
                        "value": "370982",
                        "cityCode": "370900",
                        "provinceCode": "370000",
                        "lon": 117.61301622046,
                        "lat": 35.89581023511
                    },
                    {
                        "label": "肥城市",
                        "value": "370983",
                        "cityCode": "370900",
                        "provinceCode": "370000",
                        "lon": 116.74476246765,
                        "lat": 36.112514344701
                    }
                ]
            },
            {
                "label": "威海市",
                "value": "371000",
                "provinceCode": "370000",
                "lon": 122.09395836581,
                "lat": 37.528787081251,
                "children": [
                    {
                        "label": "环翠区",
                        "value": "371002",
                        "cityCode": "371000",
                        "provinceCode": "370000",
                        "lon": 122.15207450216,
                        "lat": 37.399343698592
                    },
                    {
                        "label": "文登区",
                        "value": "371003",
                        "cityCode": "371000",
                        "provinceCode": "370000",
                        "lon": 121.96829072766,
                        "lat": 37.16608344728
                    },
                    {
                        "label": "荣成市",
                        "value": "371082",
                        "cityCode": "371000",
                        "provinceCode": "370000",
                        "lon": 122.40692581532,
                        "lat": 37.128686091876
                    },
                    {
                        "label": "乳山市",
                        "value": "371083",
                        "cityCode": "371000",
                        "provinceCode": "370000",
                        "lon": 121.52978797795,
                        "lat": 36.976575050291
                    }
                ]
            },
            {
                "label": "日照市",
                "value": "371100",
                "provinceCode": "370000",
                "lon": 119.50717994299,
                "lat": 35.420225193144,
                "children": [
                    {
                        "label": "东港区",
                        "value": "371102",
                        "cityCode": "371100",
                        "provinceCode": "370000",
                        "lon": 119.37785169728,
                        "lat": 35.469377334235
                    },
                    {
                        "label": "岚山区",
                        "value": "371103",
                        "cityCode": "371100",
                        "provinceCode": "370000",
                        "lon": 119.25182522442,
                        "lat": 35.292714155339
                    },
                    {
                        "label": "五莲县",
                        "value": "371121",
                        "cityCode": "371100",
                        "provinceCode": "370000",
                        "lon": 119.2494328324,
                        "lat": 35.744382733588
                    },
                    {
                        "label": "莒县",
                        "value": "371122",
                        "cityCode": "371100",
                        "provinceCode": "370000",
                        "lon": 118.8935850849,
                        "lat": 35.655874955573
                    }
                ]
            },
            {
                "label": "临沂市",
                "value": "371300",
                "provinceCode": "370000",
                "lon": 118.34076823661,
                "lat": 35.072409074391,
                "children": [
                    {
                        "label": "兰山区",
                        "value": "371302",
                        "cityCode": "371300",
                        "provinceCode": "370000",
                        "lon": 118.31224292902,
                        "lat": 35.174844704086
                    },
                    {
                        "label": "罗庄区",
                        "value": "371311",
                        "cityCode": "371300",
                        "provinceCode": "370000",
                        "lon": 118.29727935276,
                        "lat": 34.964343085469
                    },
                    {
                        "label": "河东区",
                        "value": "371312",
                        "cityCode": "371300",
                        "provinceCode": "370000",
                        "lon": 118.51731091285,
                        "lat": 35.127030975379
                    },
                    {
                        "label": "沂南县",
                        "value": "371321",
                        "cityCode": "371300",
                        "provinceCode": "370000",
                        "lon": 118.41758556843,
                        "lat": 35.536723374853
                    },
                    {
                        "label": "郯城县",
                        "value": "371322",
                        "cityCode": "371300",
                        "provinceCode": "370000",
                        "lon": 118.32443065841,
                        "lat": 34.649855053512
                    },
                    {
                        "label": "沂水县",
                        "value": "371323",
                        "cityCode": "371300",
                        "provinceCode": "370000",
                        "lon": 118.60935780958,
                        "lat": 35.914368629366
                    },
                    {
                        "label": "兰陵县",
                        "value": "371324",
                        "cityCode": "371300",
                        "provinceCode": "370000",
                        "lon": 118.00750944174,
                        "lat": 34.862619866599
                    },
                    {
                        "label": "费县",
                        "value": "371325",
                        "cityCode": "371300",
                        "provinceCode": "370000",
                        "lon": 117.98583765075,
                        "lat": 35.254970793112
                    },
                    {
                        "label": "平邑县",
                        "value": "371326",
                        "cityCode": "371300",
                        "provinceCode": "370000",
                        "lon": 117.68244768554,
                        "lat": 35.434249996001
                    },
                    {
                        "label": "莒南县",
                        "value": "371327",
                        "cityCode": "371300",
                        "provinceCode": "370000",
                        "lon": 118.89007890268,
                        "lat": 35.213123220035
                    },
                    {
                        "label": "蒙阴县",
                        "value": "371328",
                        "cityCode": "371300",
                        "provinceCode": "370000",
                        "lon": 118.03674237099,
                        "lat": 35.747440083102
                    },
                    {
                        "label": "临沭县",
                        "value": "371329",
                        "cityCode": "371300",
                        "provinceCode": "370000",
                        "lon": 118.65944529359,
                        "lat": 34.885484018739
                    }
                ]
            },
            {
                "label": "德州市",
                "value": "371400",
                "provinceCode": "370000",
                "lon": 116.32816136356,
                "lat": 37.460825926305,
                "children": [
                    {
                        "label": "德城区",
                        "value": "371402",
                        "cityCode": "371400",
                        "provinceCode": "370000",
                        "lon": 116.33291247583,
                        "lat": 37.45743710416
                    },
                    {
                        "label": "陵城区",
                        "value": "371403",
                        "cityCode": "371400",
                        "provinceCode": "370000",
                        "lon": 116.67557519942,
                        "lat": 37.418030354096
                    },
                    {
                        "label": "宁津县",
                        "value": "371422",
                        "cityCode": "371400",
                        "provinceCode": "370000",
                        "lon": 116.81455550432,
                        "lat": 37.68562160185
                    },
                    {
                        "label": "庆云县",
                        "value": "371423",
                        "cityCode": "371400",
                        "provinceCode": "370000",
                        "lon": 117.46273738393,
                        "lat": 37.801823529258
                    },
                    {
                        "label": "临邑县",
                        "value": "371424",
                        "cityCode": "371400",
                        "provinceCode": "370000",
                        "lon": 116.89959541702,
                        "lat": 37.235892912121
                    },
                    {
                        "label": "齐河县",
                        "value": "371425",
                        "cityCode": "371400",
                        "provinceCode": "370000",
                        "lon": 116.67825351242,
                        "lat": 36.723454326503
                    },
                    {
                        "label": "平原县",
                        "value": "371426",
                        "cityCode": "371400",
                        "provinceCode": "370000",
                        "lon": 116.43007889018,
                        "lat": 37.156617614138
                    },
                    {
                        "label": "夏津县",
                        "value": "371427",
                        "cityCode": "371400",
                        "provinceCode": "370000",
                        "lon": 116.03732249608,
                        "lat": 37.016688548156
                    },
                    {
                        "label": "武城县",
                        "value": "371428",
                        "cityCode": "371400",
                        "provinceCode": "370000",
                        "lon": 116.09122537249,
                        "lat": 37.243982507441
                    },
                    {
                        "label": "乐陵市",
                        "value": "371481",
                        "cityCode": "371400",
                        "provinceCode": "370000",
                        "lon": 117.14555333466,
                        "lat": 37.674416911054
                    },
                    {
                        "label": "禹城市",
                        "value": "371482",
                        "cityCode": "371400",
                        "provinceCode": "370000",
                        "lon": 116.58133068117,
                        "lat": 36.919142889593
                    }
                ]
            },
            {
                "label": "聊城市",
                "value": "371500",
                "provinceCode": "370000",
                "lon": 115.98686913929,
                "lat": 36.455828514728,
                "children": [
                    {
                        "label": "东昌府区",
                        "value": "371502",
                        "cityCode": "371500",
                        "provinceCode": "370000",
                        "lon": 115.90770556753,
                        "lat": 36.455829587246
                    },
                    {
                        "label": "阳谷县",
                        "value": "371521",
                        "cityCode": "371500",
                        "provinceCode": "370000",
                        "lon": 115.87350298472,
                        "lat": 36.146774001697
                    },
                    {
                        "label": "莘县",
                        "value": "371522",
                        "cityCode": "371500",
                        "provinceCode": "370000",
                        "lon": 115.55267289485,
                        "lat": 36.139121538984
                    },
                    {
                        "label": "东阿县",
                        "value": "371524",
                        "cityCode": "371500",
                        "provinceCode": "370000",
                        "lon": 116.2831984139,
                        "lat": 36.331642489915
                    },
                    {
                        "label": "冠县",
                        "value": "371525",
                        "cityCode": "371500",
                        "provinceCode": "370000",
                        "lon": 115.54083712129,
                        "lat": 36.53635700997
                    },
                    {
                        "label": "高唐县",
                        "value": "371526",
                        "cityCode": "371500",
                        "provinceCode": "370000",
                        "lon": 116.25743002174,
                        "lat": 36.839764457085
                    },
                    {
                        "label": "临清市",
                        "value": "371581",
                        "cityCode": "371500",
                        "provinceCode": "370000",
                        "lon": 115.78260175173,
                        "lat": 36.782069473113
                    }
                ]
            },
            {
                "label": "滨州市",
                "value": "371600",
                "provinceCode": "370000",
                "lon": 117.96829241453,
                "lat": 37.405313941826,
                "children": [
                    {
                        "label": "滨城区",
                        "value": "371602",
                        "cityCode": "371600",
                        "provinceCode": "370000",
                        "lon": 117.98121111677,
                        "lat": 37.424890835984
                    },
                    {
                        "label": "沾化区",
                        "value": "371603",
                        "cityCode": "371600",
                        "provinceCode": "370000",
                        "lon": 118.05636772417,
                        "lat": 37.868312497909
                    },
                    {
                        "label": "惠民县",
                        "value": "371621",
                        "cityCode": "371600",
                        "provinceCode": "370000",
                        "lon": 117.57898363784,
                        "lat": 37.375971318454
                    },
                    {
                        "label": "阳信县",
                        "value": "371622",
                        "cityCode": "371600",
                        "provinceCode": "370000",
                        "lon": 117.57342951076,
                        "lat": 37.605500456412
                    },
                    {
                        "label": "无棣县",
                        "value": "371623",
                        "cityCode": "371600",
                        "provinceCode": "370000",
                        "lon": 117.79778189995,
                        "lat": 37.942568300077
                    },
                    {
                        "label": "博兴县",
                        "value": "371625",
                        "cityCode": "371600",
                        "provinceCode": "370000",
                        "lon": 118.22571531705,
                        "lat": 37.19135384581
                    }
                ]
            },
            {
                "label": "菏泽市",
                "value": "371700",
                "provinceCode": "370000",
                "lon": 115.46335977453,
                "lat": 35.262440496075,
                "children": [
                    {
                        "label": "牡丹区",
                        "value": "371702",
                        "cityCode": "371700",
                        "provinceCode": "370000",
                        "lon": 115.47002526505,
                        "lat": 35.283536562407
                    },
                    {
                        "label": "定陶区",
                        "value": "371703",
                        "cityCode": "371700",
                        "provinceCode": "370000",
                        "lon": 115.57403571958,
                        "lat": 35.111855206745
                    },
                    {
                        "label": "曹县",
                        "value": "371721",
                        "cityCode": "371700",
                        "provinceCode": "370000",
                        "lon": 115.55360067628,
                        "lat": 34.827952767182
                    },
                    {
                        "label": "单县",
                        "value": "371722",
                        "cityCode": "371700",
                        "provinceCode": "370000",
                        "lon": 116.122984618,
                        "lat": 34.738238141223
                    },
                    {
                        "label": "成武县",
                        "value": "371723",
                        "cityCode": "371700",
                        "provinceCode": "370000",
                        "lon": 115.94498857738,
                        "lat": 34.989110950657
                    },
                    {
                        "label": "巨野县",
                        "value": "371724",
                        "cityCode": "371700",
                        "provinceCode": "370000",
                        "lon": 116.04113122185,
                        "lat": 35.279400360462
                    },
                    {
                        "label": "郓城县",
                        "value": "371725",
                        "cityCode": "371700",
                        "provinceCode": "370000",
                        "lon": 115.89463235246,
                        "lat": 35.612979519727
                    },
                    {
                        "label": "鄄城县",
                        "value": "371726",
                        "cityCode": "371700",
                        "provinceCode": "370000",
                        "lon": 115.55287125102,
                        "lat": 35.555043149647
                    },
                    {
                        "label": "东明县",
                        "value": "371728",
                        "cityCode": "371700",
                        "provinceCode": "370000",
                        "lon": 115.07411464426,
                        "lat": 35.182435455789
                    }
                ]
            }
        ],
        "label": "山东省",
        "value": "370000"
    },
    {
        "country": "china",
        "lon": 113.48680405753,
        "lat": 34.157183767956,
        "children": [
            {
                "label": "郑州市",
                "value": "410100",
                "provinceCode": "410000",
                "lon": 113.64964384986,
                "lat": 34.75661006414,
                "children": [
                    {
                        "label": "中原区",
                        "value": "410102",
                        "cityCode": "410100",
                        "provinceCode": "410000",
                        "lon": 113.55728142479,
                        "lat": 34.779474293205
                    },
                    {
                        "label": "二七区",
                        "value": "410103",
                        "cityCode": "410100",
                        "provinceCode": "410000",
                        "lon": 113.64964384986,
                        "lat": 34.75661006414
                    },
                    {
                        "label": "管城回族区",
                        "value": "410104",
                        "cityCode": "410100",
                        "provinceCode": "410000",
                        "lon": 113.72186105524,
                        "lat": 34.70900380778
                    },
                    {
                        "label": "金水区",
                        "value": "410105",
                        "cityCode": "410100",
                        "provinceCode": "410000",
                        "lon": 113.70801125038,
                        "lat": 34.797406405145
                    },
                    {
                        "label": "上街区",
                        "value": "410106",
                        "cityCode": "410100",
                        "provinceCode": "410000",
                        "lon": 113.29818225705,
                        "lat": 34.822088918243
                    },
                    {
                        "label": "惠济区",
                        "value": "410108",
                        "cityCode": "410100",
                        "provinceCode": "410000",
                        "lon": 113.62834116351,
                        "lat": 34.869446814666
                    },
                    {
                        "label": "中牟县",
                        "value": "410122",
                        "cityCode": "410100",
                        "provinceCode": "410000",
                        "lon": 114.01122240275,
                        "lat": 34.720319012422
                    },
                    {
                        "label": "巩义市",
                        "value": "410181",
                        "cityCode": "410100",
                        "provinceCode": "410000",
                        "lon": 113.03959002892,
                        "lat": 34.703798883243
                    },
                    {
                        "label": "荥阳市",
                        "value": "410182",
                        "cityCode": "410100",
                        "provinceCode": "410000",
                        "lon": 113.35180180957,
                        "lat": 34.806179937519
                    },
                    {
                        "label": "新密市",
                        "value": "410183",
                        "cityCode": "410100",
                        "provinceCode": "410000",
                        "lon": 113.43985443365,
                        "lat": 34.514074899467
                    },
                    {
                        "label": "新郑市",
                        "value": "410184",
                        "cityCode": "410100",
                        "provinceCode": "410000",
                        "lon": 113.73611501497,
                        "lat": 34.459442752589
                    },
                    {
                        "label": "登封市",
                        "value": "410185",
                        "cityCode": "410100",
                        "provinceCode": "410000",
                        "lon": 113.04174933248,
                        "lat": 34.418362166819
                    }
                ]
            },
            {
                "label": "开封市",
                "value": "410200",
                "provinceCode": "410000",
                "lon": 114.35164211776,
                "lat": 34.801854175837,
                "children": [
                    {
                        "label": "龙亭区",
                        "value": "410202",
                        "cityCode": "410200",
                        "provinceCode": "410000",
                        "lon": 114.34098849918,
                        "lat": 34.860572766851
                    },
                    {
                        "label": "顺河回族区",
                        "value": "410203",
                        "cityCode": "410200",
                        "provinceCode": "410000",
                        "lon": 114.42852744048,
                        "lat": 34.81777146999
                    },
                    {
                        "label": "鼓楼区",
                        "value": "410204",
                        "cityCode": "410200",
                        "provinceCode": "410000",
                        "lon": 114.34190563407,
                        "lat": 34.797982546084
                    },
                    {
                        "label": "禹王台区",
                        "value": "410205",
                        "cityCode": "410200",
                        "provinceCode": "410000",
                        "lon": 114.38560958232,
                        "lat": 34.75102886185
                    },
                    {
                        "label": "祥符区",
                        "value": "410212",
                        "cityCode": "410200",
                        "provinceCode": "410000",
                        "lon": 114.43805957404,
                        "lat": 34.725946945916
                    },
                    {
                        "label": "杞县",
                        "value": "410221",
                        "cityCode": "410200",
                        "provinceCode": "410000",
                        "lon": 114.76878210877,
                        "lat": 34.505963464038
                    },
                    {
                        "label": "通许县",
                        "value": "410222",
                        "cityCode": "410200",
                        "provinceCode": "410000",
                        "lon": 114.50219933719,
                        "lat": 34.441630948349
                    },
                    {
                        "label": "尉氏县",
                        "value": "410223",
                        "cityCode": "410200",
                        "provinceCode": "410000",
                        "lon": 114.16103722407,
                        "lat": 34.388437240132
                    },
                    {
                        "label": "兰考县",
                        "value": "410225",
                        "cityCode": "410200",
                        "provinceCode": "410000",
                        "lon": 114.98029307097,
                        "lat": 34.879764140336
                    }
                ]
            },
            {
                "label": "洛阳市",
                "value": "410300",
                "provinceCode": "410000",
                "lon": 112.44752476895,
                "lat": 34.657367817651,
                "children": [
                    {
                        "label": "老城区",
                        "value": "410302",
                        "cityCode": "410300",
                        "provinceCode": "410000",
                        "lon": 112.45917255752,
                        "lat": 34.704033141562
                    },
                    {
                        "label": "西工区",
                        "value": "410303",
                        "cityCode": "410300",
                        "provinceCode": "410000",
                        "lon": 112.4071257244,
                        "lat": 34.689693743302
                    },
                    {
                        "label": "瀍河回族区",
                        "value": "410304",
                        "cityCode": "410300",
                        "provinceCode": "410000",
                        "lon": 112.50509438434,
                        "lat": 34.702931706602
                    },
                    {
                        "label": "涧西区",
                        "value": "410305",
                        "cityCode": "410300",
                        "provinceCode": "410000",
                        "lon": 112.39075320818,
                        "lat": 34.671667591915
                    },
                    {
                        "label": "吉利区",
                        "value": "410306",
                        "cityCode": "410300",
                        "provinceCode": "410000",
                        "lon": 112.58976455586,
                        "lat": 34.905378745091
                    },
                    {
                        "label": "洛龙区",
                        "value": "410311",
                        "cityCode": "410300",
                        "provinceCode": "410000",
                        "lon": 112.46709264771,
                        "lat": 34.638792103903
                    },
                    {
                        "label": "孟津县",
                        "value": "410322",
                        "cityCode": "410300",
                        "provinceCode": "410000",
                        "lon": 112.47699634585,
                        "lat": 34.831148181123
                    },
                    {
                        "label": "新安县",
                        "value": "410323",
                        "cityCode": "410300",
                        "provinceCode": "410000",
                        "lon": 112.12774350044,
                        "lat": 34.837606946675
                    },
                    {
                        "label": "栾川县",
                        "value": "410324",
                        "cityCode": "410300",
                        "provinceCode": "410000",
                        "lon": 111.61701356274,
                        "lat": 33.912392483904
                    },
                    {
                        "label": "嵩县",
                        "value": "410325",
                        "cityCode": "410300",
                        "provinceCode": "410000",
                        "lon": 112.04951135131,
                        "lat": 34.010600110067
                    },
                    {
                        "label": "汝阳县",
                        "value": "410326",
                        "cityCode": "410300",
                        "provinceCode": "410000",
                        "lon": 112.4355439591,
                        "lat": 34.06296675028
                    },
                    {
                        "label": "宜阳县",
                        "value": "410327",
                        "cityCode": "410300",
                        "provinceCode": "410000",
                        "lon": 112.04046789874,
                        "lat": 34.486036200799
                    },
                    {
                        "label": "洛宁县",
                        "value": "410328",
                        "cityCode": "410300",
                        "provinceCode": "410000",
                        "lon": 111.50679130206,
                        "lat": 34.345208388992
                    },
                    {
                        "label": "伊川县",
                        "value": "410329",
                        "cityCode": "410300",
                        "provinceCode": "410000",
                        "lon": 112.46887702474,
                        "lat": 34.407088177948
                    },
                    {
                        "label": "偃师市",
                        "value": "410381",
                        "cityCode": "410300",
                        "provinceCode": "410000",
                        "lon": 112.73482167429,
                        "lat": 34.630801858346
                    }
                ]
            },
            {
                "label": "平顶山市",
                "value": "410400",
                "provinceCode": "410000",
                "lon": 113.30084897798,
                "lat": 33.745301456524,
                "children": [
                    {
                        "label": "新华区",
                        "value": "410402",
                        "cityCode": "410400",
                        "provinceCode": "410000",
                        "lon": 113.20808222559,
                        "lat": 33.771546437308
                    },
                    {
                        "label": "卫东区",
                        "value": "410403",
                        "cityCode": "410400",
                        "provinceCode": "410000",
                        "lon": 113.36538845598,
                        "lat": 33.769107814671
                    },
                    {
                        "label": "石龙区",
                        "value": "410404",
                        "cityCode": "410400",
                        "provinceCode": "410000",
                        "lon": 112.89469073779,
                        "lat": 33.892093587751
                    },
                    {
                        "label": "湛河区",
                        "value": "410411",
                        "cityCode": "410400",
                        "provinceCode": "410000",
                        "lon": 113.27818922149,
                        "lat": 33.71234144492
                    },
                    {
                        "label": "宝丰县",
                        "value": "410421",
                        "cityCode": "410400",
                        "provinceCode": "410000",
                        "lon": 113.03577147499,
                        "lat": 33.915497347446
                    },
                    {
                        "label": "叶县",
                        "value": "410422",
                        "cityCode": "410400",
                        "provinceCode": "410000",
                        "lon": 113.3506762416,
                        "lat": 33.551013481912
                    },
                    {
                        "label": "鲁山县",
                        "value": "410423",
                        "cityCode": "410400",
                        "provinceCode": "410000",
                        "lon": 112.74030934124,
                        "lat": 33.748697388191
                    },
                    {
                        "label": "郏县",
                        "value": "410425",
                        "cityCode": "410400",
                        "provinceCode": "410000",
                        "lon": 113.23328182561,
                        "lat": 34.005498968871
                    },
                    {
                        "label": "舞钢市",
                        "value": "410481",
                        "cityCode": "410400",
                        "provinceCode": "410000",
                        "lon": 113.52599604654,
                        "lat": 33.289605497055
                    },
                    {
                        "label": "汝州市",
                        "value": "410482",
                        "cityCode": "410400",
                        "provinceCode": "410000",
                        "lon": 112.8127174803,
                        "lat": 34.162777545453
                    }
                ]
            },
            {
                "label": "安阳市",
                "value": "410500",
                "provinceCode": "410000",
                "lon": 114.35180650767,
                "lat": 36.110266722181,
                "children": [
                    {
                        "label": "文峰区",
                        "value": "410502",
                        "cityCode": "410500",
                        "provinceCode": "410000",
                        "lon": 114.41852222061,
                        "lat": 36.034147665845
                    },
                    {
                        "label": "北关区",
                        "value": "410503",
                        "cityCode": "410500",
                        "provinceCode": "410000",
                        "lon": 114.39143588406,
                        "lat": 36.141695896219
                    },
                    {
                        "label": "殷都区",
                        "value": "410505",
                        "cityCode": "410500",
                        "provinceCode": "410000",
                        "lon": 114.29712997501,
                        "lat": 36.135573231517
                    },
                    {
                        "label": "龙安区",
                        "value": "410506",
                        "cityCode": "410500",
                        "provinceCode": "410000",
                        "lon": 114.25660364057,
                        "lat": 36.056024537571
                    },
                    {
                        "label": "安阳县",
                        "value": "410522",
                        "cityCode": "410500",
                        "provinceCode": "410000",
                        "lon": 114.31712430011,
                        "lat": 36.125134517065
                    },
                    {
                        "label": "汤阴县",
                        "value": "410523",
                        "cityCode": "410500",
                        "provinceCode": "410000",
                        "lon": 114.46206281377,
                        "lat": 35.907982338855
                    },
                    {
                        "label": "滑县",
                        "value": "410526",
                        "cityCode": "410500",
                        "provinceCode": "410000",
                        "lon": 114.67364721954,
                        "lat": 35.471733779112
                    },
                    {
                        "label": "内黄县",
                        "value": "410527",
                        "cityCode": "410500",
                        "provinceCode": "410000",
                        "lon": 114.82334356443,
                        "lat": 35.906569063676
                    },
                    {
                        "label": "林州市",
                        "value": "410581",
                        "cityCode": "410500",
                        "provinceCode": "410000",
                        "lon": 113.86108354948,
                        "lat": 36.016561032268
                    }
                ]
            },
            {
                "label": "鹤壁市",
                "value": "410600",
                "provinceCode": "410000",
                "lon": 114.29776983802,
                "lat": 35.755425874224,
                "children": [
                    {
                        "label": "鹤山区",
                        "value": "410602",
                        "cityCode": "410600",
                        "provinceCode": "410000",
                        "lon": 114.09845417079,
                        "lat": 35.973345969386
                    },
                    {
                        "label": "山城区",
                        "value": "410603",
                        "cityCode": "410600",
                        "provinceCode": "410000",
                        "lon": 114.25302901346,
                        "lat": 35.927453768113
                    },
                    {
                        "label": "淇滨区",
                        "value": "410611",
                        "cityCode": "410600",
                        "provinceCode": "410000",
                        "lon": 114.19951434914,
                        "lat": 35.812418921012
                    },
                    {
                        "label": "浚县",
                        "value": "410621",
                        "cityCode": "410600",
                        "provinceCode": "410000",
                        "lon": 114.46718581475,
                        "lat": 35.686206113273
                    },
                    {
                        "label": "淇县",
                        "value": "410622",
                        "cityCode": "410600",
                        "provinceCode": "410000",
                        "lon": 114.16903374394,
                        "lat": 35.667571747251
                    }
                ]
            },
            {
                "label": "新乡市",
                "value": "410700",
                "provinceCode": "410000",
                "lon": 113.91269016082,
                "lat": 35.307257557661,
                "children": [
                    {
                        "label": "红旗区",
                        "value": "410702",
                        "cityCode": "410700",
                        "provinceCode": "410000",
                        "lon": 113.91461891258,
                        "lat": 35.286150085139
                    },
                    {
                        "label": "卫滨区",
                        "value": "410703",
                        "cityCode": "410700",
                        "provinceCode": "410000",
                        "lon": 113.86463773299,
                        "lat": 35.294831576876
                    },
                    {
                        "label": "凤泉区",
                        "value": "410704",
                        "cityCode": "410700",
                        "provinceCode": "410000",
                        "lon": 113.86418902939,
                        "lat": 35.399318437608
                    },
                    {
                        "label": "牧野区",
                        "value": "410711",
                        "cityCode": "410700",
                        "provinceCode": "410000",
                        "lon": 113.89672215157,
                        "lat": 35.338890167673
                    },
                    {
                        "label": "新乡县",
                        "value": "410721",
                        "cityCode": "410700",
                        "provinceCode": "410000",
                        "lon": 113.84824573704,
                        "lat": 35.220522070112
                    },
                    {
                        "label": "获嘉县",
                        "value": "410724",
                        "cityCode": "410700",
                        "provinceCode": "410000",
                        "lon": 113.65196887023,
                        "lat": 35.203480558843
                    },
                    {
                        "label": "原阳县",
                        "value": "410725",
                        "cityCode": "410700",
                        "provinceCode": "410000",
                        "lon": 113.95316420007,
                        "lat": 35.029035610429
                    },
                    {
                        "label": "延津县",
                        "value": "410726",
                        "cityCode": "410700",
                        "provinceCode": "410000",
                        "lon": 114.23135664543,
                        "lat": 35.279607523872
                    },
                    {
                        "label": "封丘县",
                        "value": "410727",
                        "cityCode": "410700",
                        "provinceCode": "410000",
                        "lon": 114.48767812651,
                        "lat": 35.040384096253
                    },
                    {
                        "label": "卫辉市",
                        "value": "410781",
                        "cityCode": "410700",
                        "provinceCode": "410000",
                        "lon": 114.07811240389,
                        "lat": 35.499572079266
                    },
                    {
                        "label": "辉县市",
                        "value": "410782",
                        "cityCode": "410700",
                        "provinceCode": "410000",
                        "lon": 113.68789198968,
                        "lat": 35.543594465927
                    }
                ]
            },
            {
                "label": "焦作市",
                "value": "410800",
                "provinceCode": "410000",
                "lon": 113.21183588499,
                "lat": 35.234607554986,
                "children": [
                    {
                        "label": "解放区",
                        "value": "410802",
                        "cityCode": "410800",
                        "provinceCode": "410000",
                        "lon": 113.23080396516,
                        "lat": 35.241712363011
                    },
                    {
                        "label": "中站区",
                        "value": "410803",
                        "cityCode": "410800",
                        "provinceCode": "410000",
                        "lon": 113.16153562728,
                        "lat": 35.257023702543
                    },
                    {
                        "label": "马村区",
                        "value": "410804",
                        "cityCode": "410800",
                        "provinceCode": "410000",
                        "lon": 113.36732116029,
                        "lat": 35.304171016133
                    },
                    {
                        "label": "山阳区",
                        "value": "410811",
                        "cityCode": "410800",
                        "provinceCode": "410000",
                        "lon": 113.27635056977,
                        "lat": 35.241160124283
                    },
                    {
                        "label": "修武县",
                        "value": "410821",
                        "cityCode": "410800",
                        "provinceCode": "410000",
                        "lon": 113.36352820836,
                        "lat": 35.309677964198
                    },
                    {
                        "label": "博爱县",
                        "value": "410822",
                        "cityCode": "410800",
                        "provinceCode": "410000",
                        "lon": 113.07507819608,
                        "lat": 35.186007002113
                    },
                    {
                        "label": "武陟县",
                        "value": "410823",
                        "cityCode": "410800",
                        "provinceCode": "410000",
                        "lon": 113.39993452059,
                        "lat": 35.057332269363
                    },
                    {
                        "label": "温县",
                        "value": "410825",
                        "cityCode": "410800",
                        "provinceCode": "410000",
                        "lon": 113.05529612566,
                        "lat": 34.950259905072
                    },
                    {
                        "label": "沁阳市",
                        "value": "410882",
                        "cityCode": "410800",
                        "provinceCode": "410000",
                        "lon": 112.8883049259,
                        "lat": 35.133826023222
                    },
                    {
                        "label": "孟州市",
                        "value": "410883",
                        "cityCode": "410800",
                        "provinceCode": "410000",
                        "lon": 112.76969911916,
                        "lat": 34.925884390003
                    }
                ]
            },
            {
                "label": "濮阳市",
                "value": "410900",
                "provinceCode": "410000",
                "lon": 115.02662744067,
                "lat": 35.753297888208,
                "children": [
                    {
                        "label": "华龙区",
                        "value": "410902",
                        "cityCode": "410900",
                        "provinceCode": "410000",
                        "lon": 115.04809659609,
                        "lat": 35.77193370823
                    },
                    {
                        "label": "清丰县",
                        "value": "410922",
                        "cityCode": "410900",
                        "provinceCode": "410000",
                        "lon": 115.1612013425,
                        "lat": 35.924381925846
                    },
                    {
                        "label": "南乐县",
                        "value": "410923",
                        "cityCode": "410900",
                        "provinceCode": "410000",
                        "lon": 115.24982310475,
                        "lat": 36.097697402715
                    },
                    {
                        "label": "范县",
                        "value": "410926",
                        "cityCode": "410900",
                        "provinceCode": "410000",
                        "lon": 115.53840075342,
                        "lat": 35.801404731968
                    },
                    {
                        "label": "台前县",
                        "value": "410927",
                        "cityCode": "410900",
                        "provinceCode": "410000",
                        "lon": 115.88573804863,
                        "lat": 35.966389126572
                    },
                    {
                        "label": "濮阳县",
                        "value": "410928",
                        "cityCode": "410900",
                        "provinceCode": "410000",
                        "lon": 115.15660204659,
                        "lat": 35.59228702617
                    }
                ]
            },
            {
                "label": "许昌市",
                "value": "411000",
                "provinceCode": "410000",
                "lon": 113.83531245979,
                "lat": 34.026739588655,
                "children": [
                    {
                        "label": "魏都区",
                        "value": "411002",
                        "cityCode": "411000",
                        "provinceCode": "410000",
                        "lon": 113.82531644192,
                        "lat": 34.043477065508
                    },
                    {
                        "label": "鄢陵县",
                        "value": "411024",
                        "cityCode": "411000",
                        "provinceCode": "410000",
                        "lon": 114.20240879522,
                        "lat": 34.01192963976
                    },
                    {
                        "label": "襄城县",
                        "value": "411025",
                        "cityCode": "411000",
                        "provinceCode": "410000",
                        "lon": 113.56898289597,
                        "lat": 33.86190518971
                    },
                    {
                        "label": "禹州市",
                        "value": "411081",
                        "cityCode": "411000",
                        "provinceCode": "410000",
                        "lon": 113.39269360872,
                        "lat": 34.200307558026
                    },
                    {
                        "label": "长葛市",
                        "value": "411082",
                        "cityCode": "411000",
                        "provinceCode": "410000",
                        "lon": 113.85556820652,
                        "lat": 34.236601226737
                    }
                ]
            },
            {
                "label": "漯河市",
                "value": "411100",
                "provinceCode": "410000",
                "lon": 114.04606140023,
                "lat": 33.576278688483,
                "children": [
                    {
                        "label": "源汇区",
                        "value": "411102",
                        "cityCode": "411100",
                        "provinceCode": "410000",
                        "lon": 113.92360106938,
                        "lat": 33.53475547247
                    },
                    {
                        "label": "郾城区",
                        "value": "411103",
                        "cityCode": "411100",
                        "provinceCode": "410000",
                        "lon": 113.94136182694,
                        "lat": 33.670703809923
                    },
                    {
                        "label": "召陵区",
                        "value": "411104",
                        "cityCode": "411100",
                        "provinceCode": "410000",
                        "lon": 114.18514173047,
                        "lat": 33.57798961468
                    },
                    {
                        "label": "舞阳县",
                        "value": "411121",
                        "cityCode": "411100",
                        "provinceCode": "410000",
                        "lon": 113.68005525753,
                        "lat": 33.549301454759
                    },
                    {
                        "label": "临颍县",
                        "value": "411122",
                        "cityCode": "411100",
                        "provinceCode": "410000",
                        "lon": 113.96389863435,
                        "lat": 33.844425731931
                    }
                ]
            },
            {
                "label": "三门峡市",
                "value": "411200",
                "provinceCode": "410000",
                "lon": 111.18126209327,
                "lat": 34.78331994105,
                "children": [
                    {
                        "label": "湖滨区",
                        "value": "411202",
                        "cityCode": "411200",
                        "provinceCode": "410000",
                        "lon": 111.28129514586,
                        "lat": 34.771777672947
                    },
                    {
                        "label": "陕州区",
                        "value": "411203",
                        "cityCode": "411200",
                        "provinceCode": "410000",
                        "lon": 111.38347360282,
                        "lat": 34.642257128616
                    },
                    {
                        "label": "渑池县",
                        "value": "411221",
                        "cityCode": "411200",
                        "provinceCode": "410000",
                        "lon": 111.80253536998,
                        "lat": 34.839691429224
                    },
                    {
                        "label": "卢氏县",
                        "value": "411224",
                        "cityCode": "411200",
                        "provinceCode": "410000",
                        "lon": 110.99472361928,
                        "lat": 33.973393506457
                    },
                    {
                        "label": "义马市",
                        "value": "411281",
                        "cityCode": "411200",
                        "provinceCode": "410000",
                        "lon": 111.90609266704,
                        "lat": 34.749524796841
                    },
                    {
                        "label": "灵宝市",
                        "value": "411282",
                        "cityCode": "411200",
                        "provinceCode": "410000",
                        "lon": 110.77973742779,
                        "lat": 34.437104010525
                    }
                ]
            },
            {
                "label": "南阳市",
                "value": "411300",
                "provinceCode": "410000",
                "lon": 112.54284190051,
                "lat": 33.011419569116,
                "children": [
                    {
                        "label": "宛城区",
                        "value": "411302",
                        "cityCode": "411300",
                        "provinceCode": "410000",
                        "lon": 112.61390774771,
                        "lat": 32.934703186447
                    },
                    {
                        "label": "卧龙区",
                        "value": "411303",
                        "cityCode": "411300",
                        "provinceCode": "410000",
                        "lon": 112.48426735075,
                        "lat": 33.009838704626
                    },
                    {
                        "label": "南召县",
                        "value": "411321",
                        "cityCode": "411300",
                        "provinceCode": "410000",
                        "lon": 112.39366620514,
                        "lat": 33.472841576965
                    },
                    {
                        "label": "方城县",
                        "value": "411322",
                        "cityCode": "411300",
                        "provinceCode": "410000",
                        "lon": 113.01682220295,
                        "lat": 33.29995432977
                    },
                    {
                        "label": "西峡县",
                        "value": "411323",
                        "cityCode": "411300",
                        "provinceCode": "410000",
                        "lon": 111.43898978054,
                        "lat": 33.48692481474
                    },
                    {
                        "label": "镇平县",
                        "value": "411324",
                        "cityCode": "411300",
                        "provinceCode": "410000",
                        "lon": 112.19328453943,
                        "lat": 33.070817074221
                    },
                    {
                        "label": "内乡县",
                        "value": "411325",
                        "cityCode": "411300",
                        "provinceCode": "410000",
                        "lon": 111.8474050987,
                        "lat": 33.224377176241
                    },
                    {
                        "label": "淅川县",
                        "value": "411326",
                        "cityCode": "411300",
                        "provinceCode": "410000",
                        "lon": 111.44539628251,
                        "lat": 32.989722669393
                    },
                    {
                        "label": "社旗县",
                        "value": "411327",
                        "cityCode": "411300",
                        "provinceCode": "410000",
                        "lon": 112.99852720955,
                        "lat": 32.982431382713
                    },
                    {
                        "label": "唐河县",
                        "value": "411328",
                        "cityCode": "411300",
                        "provinceCode": "410000",
                        "lon": 112.85911827542,
                        "lat": 32.619993292449
                    },
                    {
                        "label": "新野县",
                        "value": "411329",
                        "cityCode": "411300",
                        "provinceCode": "410000",
                        "lon": 112.41599071451,
                        "lat": 32.553440600793
                    },
                    {
                        "label": "桐柏县",
                        "value": "411330",
                        "cityCode": "411300",
                        "provinceCode": "410000",
                        "lon": 113.43416900109,
                        "lat": 32.495650299965
                    },
                    {
                        "label": "邓州市",
                        "value": "411381",
                        "cityCode": "411300",
                        "provinceCode": "410000",
                        "lon": 112.0568605764,
                        "lat": 32.684649552173
                    }
                ]
            },
            {
                "label": "商丘市",
                "value": "411400",
                "provinceCode": "410000",
                "lon": 115.64188568785,
                "lat": 34.438588640246,
                "children": [
                    {
                        "label": "梁园区",
                        "value": "411402",
                        "cityCode": "411400",
                        "provinceCode": "410000",
                        "lon": 115.63773066554,
                        "lat": 34.5030395946
                    },
                    {
                        "label": "睢阳区",
                        "value": "411403",
                        "cityCode": "411400",
                        "provinceCode": "410000",
                        "lon": 115.58978387844,
                        "lat": 34.286754693787
                    },
                    {
                        "label": "民权县",
                        "value": "411421",
                        "cityCode": "411400",
                        "provinceCode": "410000",
                        "lon": 115.17841405829,
                        "lat": 34.696116524323
                    },
                    {
                        "label": "睢县",
                        "value": "411422",
                        "cityCode": "411400",
                        "provinceCode": "410000",
                        "lon": 115.04300110058,
                        "lat": 34.39975982873
                    },
                    {
                        "label": "宁陵县",
                        "value": "411423",
                        "cityCode": "411400",
                        "provinceCode": "410000",
                        "lon": 115.29840053317,
                        "lat": 34.454601801008
                    },
                    {
                        "label": "柘城县",
                        "value": "411424",
                        "cityCode": "411400",
                        "provinceCode": "410000",
                        "lon": 115.30904185846,
                        "lat": 34.111651823091
                    },
                    {
                        "label": "虞城县",
                        "value": "411425",
                        "cityCode": "411400",
                        "provinceCode": "410000",
                        "lon": 115.9142248589,
                        "lat": 34.36907192525
                    },
                    {
                        "label": "夏邑县",
                        "value": "411426",
                        "cityCode": "411400",
                        "provinceCode": "410000",
                        "lon": 116.15745373108,
                        "lat": 34.223680706067
                    },
                    {
                        "label": "永城市",
                        "value": "411481",
                        "cityCode": "411400",
                        "provinceCode": "410000",
                        "lon": 116.33077515791,
                        "lat": 33.972013062908
                    }
                ]
            },
            {
                "label": "信阳市",
                "value": "411500",
                "provinceCode": "410000",
                "lon": 114.08549099347,
                "lat": 32.128582307512,
                "children": [
                    {
                        "label": "浉河区",
                        "value": "411502",
                        "cityCode": "411500",
                        "provinceCode": "410000",
                        "lon": 113.96277662182,
                        "lat": 32.031339669892
                    },
                    {
                        "label": "平桥区",
                        "value": "411503",
                        "cityCode": "411500",
                        "provinceCode": "410000",
                        "lon": 114.1390859663,
                        "lat": 32.307840062297
                    },
                    {
                        "label": "罗山县",
                        "value": "411521",
                        "cityCode": "411500",
                        "provinceCode": "410000",
                        "lon": 114.44356295731,
                        "lat": 32.031230299697
                    },
                    {
                        "label": "光山县",
                        "value": "411522",
                        "cityCode": "411500",
                        "provinceCode": "410000",
                        "lon": 114.84316193505,
                        "lat": 31.941431722351
                    },
                    {
                        "label": "新县",
                        "value": "411523",
                        "cityCode": "411500",
                        "provinceCode": "410000",
                        "lon": 114.85908905243,
                        "lat": 31.646279005794
                    },
                    {
                        "label": "商城县",
                        "value": "411524",
                        "cityCode": "411500",
                        "provinceCode": "410000",
                        "lon": 115.37524581828,
                        "lat": 31.766261672209
                    },
                    {
                        "label": "固始县",
                        "value": "411525",
                        "cityCode": "411500",
                        "provinceCode": "410000",
                        "lon": 115.70974321125,
                        "lat": 32.13694390485
                    },
                    {
                        "label": "潢川县",
                        "value": "411526",
                        "cityCode": "411500",
                        "provinceCode": "410000",
                        "lon": 115.16440991805,
                        "lat": 32.132798426222
                    },
                    {
                        "label": "淮滨县",
                        "value": "411527",
                        "cityCode": "411500",
                        "provinceCode": "410000",
                        "lon": 115.32456065214,
                        "lat": 32.44657354908
                    },
                    {
                        "label": "息县",
                        "value": "411528",
                        "cityCode": "411500",
                        "provinceCode": "410000",
                        "lon": 114.87168181062,
                        "lat": 32.410808174844
                    }
                ]
            },
            {
                "label": "周口市",
                "value": "411600",
                "provinceCode": "410000",
                "lon": 114.6541019423,
                "lat": 33.623740818141,
                "children": [
                    {
                        "label": "川汇区",
                        "value": "411602",
                        "cityCode": "411600",
                        "provinceCode": "410000",
                        "lon": 114.65795015653,
                        "lat": 33.630875553438
                    },
                    {
                        "label": "扶沟县",
                        "value": "411621",
                        "cityCode": "411600",
                        "provinceCode": "410000",
                        "lon": 114.43732658093,
                        "lat": 34.100655472765
                    },
                    {
                        "label": "西华县",
                        "value": "411622",
                        "cityCode": "411600",
                        "provinceCode": "410000",
                        "lon": 114.47808721231,
                        "lat": 33.793632327288
                    },
                    {
                        "label": "商水县",
                        "value": "411623",
                        "cityCode": "411600",
                        "provinceCode": "410000",
                        "lon": 114.5595768694,
                        "lat": 33.52093272236
                    },
                    {
                        "label": "沈丘县",
                        "value": "411624",
                        "cityCode": "411600",
                        "provinceCode": "410000",
                        "lon": 115.17871821127,
                        "lat": 33.295149932293
                    },
                    {
                        "label": "郸城县",
                        "value": "411625",
                        "cityCode": "411600",
                        "provinceCode": "410000",
                        "lon": 115.30129735228,
                        "lat": 33.641500072188
                    },
                    {
                        "label": "太康县",
                        "value": "411627",
                        "cityCode": "411600",
                        "provinceCode": "410000",
                        "lon": 114.85570075514,
                        "lat": 34.097096248874
                    },
                    {
                        "label": "鹿邑县",
                        "value": "411628",
                        "cityCode": "411600",
                        "provinceCode": "410000",
                        "lon": 115.38398333433,
                        "lat": 33.894050509383
                    },
                    {
                        "label": "项城市",
                        "value": "411681",
                        "cityCode": "411600",
                        "provinceCode": "410000",
                        "lon": 114.89338047633,
                        "lat": 33.274470322798
                    }
                ]
            },
            {
                "label": "驻马店市",
                "value": "411700",
                "provinceCode": "410000",
                "lon": 114.04915354746,
                "lat": 32.983158154093,
                "children": [
                    {
                        "label": "驿城区",
                        "value": "411702",
                        "cityCode": "411700",
                        "provinceCode": "410000",
                        "lon": 114.00828960502,
                        "lat": 32.968356527361
                    },
                    {
                        "label": "西平县",
                        "value": "411721",
                        "cityCode": "411700",
                        "provinceCode": "410000",
                        "lon": 113.92283839684,
                        "lat": 33.37154892996
                    },
                    {
                        "label": "上蔡县",
                        "value": "411722",
                        "cityCode": "411700",
                        "provinceCode": "410000",
                        "lon": 114.40923857452,
                        "lat": 33.301221213377
                    },
                    {
                        "label": "平舆县",
                        "value": "411723",
                        "cityCode": "411700",
                        "provinceCode": "410000",
                        "lon": 114.64744862019,
                        "lat": 32.992143963522
                    },
                    {
                        "label": "正阳县",
                        "value": "411724",
                        "cityCode": "411700",
                        "provinceCode": "410000",
                        "lon": 114.49796073761,
                        "lat": 32.546931233463
                    },
                    {
                        "label": "确山县",
                        "value": "411725",
                        "cityCode": "411700",
                        "provinceCode": "410000",
                        "lon": 113.96358973796,
                        "lat": 32.711951228899
                    },
                    {
                        "label": "泌阳县",
                        "value": "411726",
                        "cityCode": "411700",
                        "provinceCode": "410000",
                        "lon": 113.44717429859,
                        "lat": 32.883863636522
                    },
                    {
                        "label": "汝南县",
                        "value": "411727",
                        "cityCode": "411700",
                        "provinceCode": "410000",
                        "lon": 114.3257758188,
                        "lat": 32.921968466052
                    },
                    {
                        "label": "遂平县",
                        "value": "411728",
                        "cityCode": "411700",
                        "provinceCode": "410000",
                        "lon": 113.90248496569,
                        "lat": 33.167855168478
                    },
                    {
                        "label": "新蔡县",
                        "value": "411729",
                        "cityCode": "411700",
                        "provinceCode": "410000",
                        "lon": 114.94939334965,
                        "lat": 32.783574270118
                    }
                ]
            },
            {
                "label": "省直辖县级行政区划",
                "value": "419000",
                "provinceCode": "410000",
                "lon": 113.48680405753,
                "lat": 34.157183767956,
                "children": [
                    {
                        "label": "济源市",
                        "value": "419001",
                        "cityCode": "419000",
                        "provinceCode": "410000",
                        "lon": 112.40383005708,
                        "lat": 35.093893094508
                    }
                ]
            }
        ],
        "label": "河南省",
        "value": "410000"
    },
    {
        "country": "china",
        "lon": 112.41056219213,
        "lat": 31.20931625014,
        "children": [
            {
                "label": "武汉市",
                "value": "420100",
                "provinceCode": "420000",
                "lon": 114.31620010268,
                "lat": 30.581084126921,
                "children": [
                    {
                        "label": "江岸区",
                        "value": "420102",
                        "cityCode": "420100",
                        "provinceCode": "420000",
                        "lon": 114.33286813952,
                        "lat": 30.656090889378
                    },
                    {
                        "label": "江汉区",
                        "value": "420103",
                        "cityCode": "420100",
                        "provinceCode": "420000",
                        "lon": 114.26638369307,
                        "lat": 30.610951375707
                    },
                    {
                        "label": "硚口区",
                        "value": "420104",
                        "cityCode": "420100",
                        "provinceCode": "420000",
                        "lon": 114.21975676824,
                        "lat": 30.603890608484
                    },
                    {
                        "label": "汉阳区",
                        "value": "420105",
                        "cityCode": "420100",
                        "provinceCode": "420000",
                        "lon": 114.21759191464,
                        "lat": 30.547265210116
                    },
                    {
                        "label": "武昌区",
                        "value": "420106",
                        "cityCode": "420100",
                        "provinceCode": "420000",
                        "lon": 114.35362228468,
                        "lat": 30.564860292785
                    },
                    {
                        "label": "青山区",
                        "value": "420107",
                        "cityCode": "420100",
                        "provinceCode": "420000",
                        "lon": 114.44449542245,
                        "lat": 30.633205056354
                    },
                    {
                        "label": "洪山区",
                        "value": "420111",
                        "cityCode": "420100",
                        "provinceCode": "420000",
                        "lon": 114.43389643664,
                        "lat": 30.54362328175
                    },
                    {
                        "label": "东西湖区",
                        "value": "420112",
                        "cityCode": "420100",
                        "provinceCode": "420000",
                        "lon": 114.08715512184,
                        "lat": 30.69815326481
                    },
                    {
                        "label": "汉南区",
                        "value": "420113",
                        "cityCode": "420100",
                        "provinceCode": "420000",
                        "lon": 113.96273175623,
                        "lat": 30.287139798861
                    },
                    {
                        "label": "蔡甸区",
                        "value": "420114",
                        "cityCode": "420100",
                        "provinceCode": "420000",
                        "lon": 113.97206459286,
                        "lat": 30.456183515878
                    },
                    {
                        "label": "江夏区",
                        "value": "420115",
                        "cityCode": "420100",
                        "provinceCode": "420000",
                        "lon": 114.36708160048,
                        "lat": 30.252484112134
                    },
                    {
                        "label": "黄陂区",
                        "value": "420116",
                        "cityCode": "420100",
                        "provinceCode": "420000",
                        "lon": 114.36464422879,
                        "lat": 30.985285897674
                    },
                    {
                        "label": "新洲区",
                        "value": "420117",
                        "cityCode": "420100",
                        "provinceCode": "420000",
                        "lon": 114.76208468205,
                        "lat": 30.803887901859
                    }
                ]
            },
            {
                "label": "黄石市",
                "value": "420200",
                "provinceCode": "420000",
                "lon": 115.05068316392,
                "lat": 30.216127127714,
                "children": [
                    {
                        "label": "黄石港区",
                        "value": "420202",
                        "cityCode": "420200",
                        "provinceCode": "420000",
                        "lon": 115.0731593966,
                        "lat": 30.233764966969
                    },
                    {
                        "label": "西塞山区",
                        "value": "420203",
                        "cityCode": "420200",
                        "provinceCode": "420000",
                        "lon": 115.1322665517,
                        "lat": 30.184485507434
                    },
                    {
                        "label": "下陆区",
                        "value": "420204",
                        "cityCode": "420200",
                        "provinceCode": "420000",
                        "lon": 114.99298679763,
                        "lat": 30.195818128952
                    },
                    {
                        "label": "铁山区",
                        "value": "420205",
                        "cityCode": "420200",
                        "provinceCode": "420000",
                        "lon": 114.90300946351,
                        "lat": 30.218698027629
                    },
                    {
                        "label": "阳新县",
                        "value": "420222",
                        "cityCode": "420200",
                        "provinceCode": "420000",
                        "lon": 115.14049262648,
                        "lat": 29.828087088129
                    },
                    {
                        "label": "大冶市",
                        "value": "420281",
                        "cityCode": "420200",
                        "provinceCode": "420000",
                        "lon": 114.84614160381,
                        "lat": 30.072895848258
                    }
                ]
            },
            {
                "label": "十堰市",
                "value": "420300",
                "provinceCode": "420000",
                "lon": 110.80122891676,
                "lat": 32.636994339468,
                "children": [
                    {
                        "label": "茅箭区",
                        "value": "420302",
                        "cityCode": "420300",
                        "provinceCode": "420000",
                        "lon": 110.78595269258,
                        "lat": 32.605601870191
                    },
                    {
                        "label": "张湾区",
                        "value": "420303",
                        "cityCode": "420300",
                        "provinceCode": "420000",
                        "lon": 110.7174012025,
                        "lat": 32.663839857981
                    },
                    {
                        "label": "郧阳区",
                        "value": "420304",
                        "cityCode": "420300",
                        "provinceCode": "420000",
                        "lon": 110.70709242813,
                        "lat": 32.848666872
                    },
                    {
                        "label": "郧西县",
                        "value": "420322",
                        "cityCode": "420300",
                        "provinceCode": "420000",
                        "lon": 110.15015123042,
                        "lat": 33.04842762997
                    },
                    {
                        "label": "竹山县",
                        "value": "420323",
                        "cityCode": "420300",
                        "provinceCode": "420000",
                        "lon": 110.07273955599,
                        "lat": 32.240141680909
                    },
                    {
                        "label": "竹溪县",
                        "value": "420324",
                        "cityCode": "420300",
                        "provinceCode": "420000",
                        "lon": 109.7912365606,
                        "lat": 32.0377375614
                    },
                    {
                        "label": "房县",
                        "value": "420325",
                        "cityCode": "420300",
                        "provinceCode": "420000",
                        "lon": 110.71456120963,
                        "lat": 31.896989987694
                    },
                    {
                        "label": "丹江口市",
                        "value": "420381",
                        "cityCode": "420300",
                        "provinceCode": "420000",
                        "lon": 111.19322791899,
                        "lat": 32.567476506858
                    }
                ]
            },
            {
                "label": "宜昌市",
                "value": "420500",
                "provinceCode": "420000",
                "lon": 111.31098109196,
                "lat": 30.732757818026,
                "children": [
                    {
                        "label": "西陵区",
                        "value": "420502",
                        "cityCode": "420500",
                        "provinceCode": "420000",
                        "lon": 111.31370556274,
                        "lat": 30.740828168194
                    },
                    {
                        "label": "伍家岗区",
                        "value": "420503",
                        "cityCode": "420500",
                        "provinceCode": "420000",
                        "lon": 111.380922081,
                        "lat": 30.678659340635
                    },
                    {
                        "label": "点军区",
                        "value": "420504",
                        "cityCode": "420500",
                        "provinceCode": "420000",
                        "lon": 111.21627903018,
                        "lat": 30.625384685781
                    },
                    {
                        "label": "猇亭区",
                        "value": "420505",
                        "cityCode": "420500",
                        "provinceCode": "420000",
                        "lon": 111.45521482125,
                        "lat": 30.551849254685
                    },
                    {
                        "label": "夷陵区",
                        "value": "420506",
                        "cityCode": "420500",
                        "provinceCode": "420000",
                        "lon": 111.31064943757,
                        "lat": 30.979970536584
                    },
                    {
                        "label": "远安县",
                        "value": "420525",
                        "cityCode": "420500",
                        "provinceCode": "420000",
                        "lon": 111.58511301877,
                        "lat": 31.176854341724
                    },
                    {
                        "label": "兴山县",
                        "value": "420526",
                        "cityCode": "420500",
                        "provinceCode": "420000",
                        "lon": 110.82440565254,
                        "lat": 31.319349537746
                    },
                    {
                        "label": "秭归县",
                        "value": "420527",
                        "cityCode": "420500",
                        "provinceCode": "420000",
                        "lon": 110.68599344932,
                        "lat": 30.903334635073
                    },
                    {
                        "label": "长阳土家族自治县",
                        "value": "420528",
                        "cityCode": "420500",
                        "provinceCode": "420000",
                        "lon": 110.85396847661,
                        "lat": 30.482854820654
                    },
                    {
                        "label": "五峰土家族自治县",
                        "value": "420529",
                        "cityCode": "420500",
                        "provinceCode": "420000",
                        "lon": 110.70999872376,
                        "lat": 30.173164959818
                    },
                    {
                        "label": "宜都市",
                        "value": "420581",
                        "cityCode": "420500",
                        "provinceCode": "420000",
                        "lon": 111.37553355505,
                        "lat": 30.294919731409
                    },
                    {
                        "label": "当阳市",
                        "value": "420582",
                        "cityCode": "420500",
                        "provinceCode": "420000",
                        "lon": 111.84271236769,
                        "lat": 30.825538036113
                    },
                    {
                        "label": "枝江市",
                        "value": "420583",
                        "cityCode": "420500",
                        "provinceCode": "420000",
                        "lon": 111.72856708021,
                        "lat": 30.451766635038
                    }
                ]
            },
            {
                "label": "襄阳市",
                "value": "420600",
                "provinceCode": "420000",
                "lon": 111.94954852739,
                "lat": 31.939712558944,
                "children": [
                    {
                        "label": "襄城区",
                        "value": "420602",
                        "cityCode": "420600",
                        "provinceCode": "420000",
                        "lon": 112.01708254994,
                        "lat": 31.935360283633
                    },
                    {
                        "label": "樊城区",
                        "value": "420606",
                        "cityCode": "420600",
                        "provinceCode": "420000",
                        "lon": 111.92852759276,
                        "lat": 32.153953344009
                    },
                    {
                        "label": "襄州区",
                        "value": "420607",
                        "cityCode": "420600",
                        "provinceCode": "420000",
                        "lon": 112.1615782359,
                        "lat": 32.161267821333
                    },
                    {
                        "label": "南漳县",
                        "value": "420624",
                        "cityCode": "420600",
                        "provinceCode": "420000",
                        "lon": 111.76462860893,
                        "lat": 31.643279800381
                    },
                    {
                        "label": "谷城县",
                        "value": "420625",
                        "cityCode": "420600",
                        "provinceCode": "420000",
                        "lon": 111.49595776173,
                        "lat": 32.173451559392
                    },
                    {
                        "label": "保康县",
                        "value": "420626",
                        "cityCode": "420600",
                        "provinceCode": "420000",
                        "lon": 111.20990495958,
                        "lat": 31.719672647836
                    },
                    {
                        "label": "老河口市",
                        "value": "420682",
                        "cityCode": "420600",
                        "provinceCode": "420000",
                        "lon": 111.76583021988,
                        "lat": 32.434165591299
                    },
                    {
                        "label": "枣阳市",
                        "value": "420683",
                        "cityCode": "420600",
                        "provinceCode": "420000",
                        "lon": 112.77260678733,
                        "lat": 32.092510578007
                    },
                    {
                        "label": "宜城市",
                        "value": "420684",
                        "cityCode": "420600",
                        "provinceCode": "420000",
                        "lon": 112.37274539501,
                        "lat": 31.673335169944
                    }
                ]
            },
            {
                "label": "鄂州市",
                "value": "420700",
                "provinceCode": "420000",
                "lon": 114.89559404136,
                "lat": 30.384439322752,
                "children": [
                    {
                        "label": "梁子湖区",
                        "value": "420702",
                        "cityCode": "420700",
                        "provinceCode": "420000",
                        "lon": 114.65002920477,
                        "lat": 30.172732100474
                    },
                    {
                        "label": "华容区",
                        "value": "420703",
                        "cityCode": "420700",
                        "provinceCode": "420000",
                        "lon": 114.7014718376,
                        "lat": 30.473067617235
                    },
                    {
                        "label": "鄂城区",
                        "value": "420704",
                        "cityCode": "420700",
                        "provinceCode": "420000",
                        "lon": 114.90101603375,
                        "lat": 30.320603111112
                    }
                ]
            },
            {
                "label": "荆门市",
                "value": "420800",
                "provinceCode": "420000",
                "lon": 112.21733029897,
                "lat": 31.042611202949,
                "children": [
                    {
                        "label": "东宝区",
                        "value": "420802",
                        "cityCode": "420800",
                        "provinceCode": "420000",
                        "lon": 112.08731072725,
                        "lat": 31.129834655672
                    },
                    {
                        "label": "掇刀区",
                        "value": "420804",
                        "cityCode": "420800",
                        "provinceCode": "420000",
                        "lon": 112.19392270314,
                        "lat": 30.932878257728
                    },
                    {
                        "label": "沙洋县",
                        "value": "420822",
                        "cityCode": "420800",
                        "provinceCode": "420000",
                        "lon": 112.39598267744,
                        "lat": 30.664549510743
                    },
                    {
                        "label": "钟祥市",
                        "value": "420881",
                        "cityCode": "420800",
                        "provinceCode": "420000",
                        "lon": 112.58482623119,
                        "lat": 31.244981073964
                    }
                ]
            },
            {
                "label": "孝感市",
                "value": "420900",
                "provinceCode": "420000",
                "lon": 113.93573439207,
                "lat": 30.927954784201,
                "children": [
                    {
                        "label": "孝南区",
                        "value": "420902",
                        "cityCode": "420900",
                        "provinceCode": "420000",
                        "lon": 114.01614199013,
                        "lat": 30.9446167023
                    },
                    {
                        "label": "孝昌县",
                        "value": "420921",
                        "cityCode": "420900",
                        "provinceCode": "420000",
                        "lon": 114.03487209446,
                        "lat": 31.239758867241
                    },
                    {
                        "label": "大悟县",
                        "value": "420922",
                        "cityCode": "420900",
                        "provinceCode": "420000",
                        "lon": 114.31029950549,
                        "lat": 31.57825524841
                    },
                    {
                        "label": "云梦县",
                        "value": "420923",
                        "cityCode": "420900",
                        "provinceCode": "420000",
                        "lon": 113.77818589474,
                        "lat": 31.004978516713
                    },
                    {
                        "label": "应城市",
                        "value": "420981",
                        "cityCode": "420900",
                        "provinceCode": "420000",
                        "lon": 113.55644020385,
                        "lat": 30.925709286687
                    },
                    {
                        "label": "安陆市",
                        "value": "420982",
                        "cityCode": "420900",
                        "provinceCode": "420000",
                        "lon": 113.63338728419,
                        "lat": 31.304354863067
                    },
                    {
                        "label": "汉川市",
                        "value": "420984",
                        "cityCode": "420900",
                        "provinceCode": "420000",
                        "lon": 113.68167835943,
                        "lat": 30.622039213976
                    }
                ]
            },
            {
                "label": "荆州市",
                "value": "421000",
                "provinceCode": "420000",
                "lon": 112.24186580719,
                "lat": 30.332590522986,
                "children": [
                    {
                        "label": "沙市区",
                        "value": "421002",
                        "cityCode": "421000",
                        "provinceCode": "420000",
                        "lon": 112.42410926804,
                        "lat": 30.325722718965
                    },
                    {
                        "label": "荆州区",
                        "value": "421003",
                        "cityCode": "421000",
                        "provinceCode": "420000",
                        "lon": 112.09985718065,
                        "lat": 30.396103360853
                    },
                    {
                        "label": "公安县",
                        "value": "421022",
                        "cityCode": "421000",
                        "provinceCode": "420000",
                        "lon": 112.15361758468,
                        "lat": 29.957130184896
                    },
                    {
                        "label": "监利县",
                        "value": "421023",
                        "cityCode": "421000",
                        "provinceCode": "420000",
                        "lon": 113.0019564425,
                        "lat": 29.848933249111
                    },
                    {
                        "label": "江陵县",
                        "value": "421024",
                        "cityCode": "421000",
                        "provinceCode": "420000",
                        "lon": 112.47370114506,
                        "lat": 30.101502949806
                    },
                    {
                        "label": "石首市",
                        "value": "421081",
                        "cityCode": "421000",
                        "provinceCode": "420000",
                        "lon": 112.51435972656,
                        "lat": 29.742222414324
                    },
                    {
                        "label": "洪湖市",
                        "value": "421083",
                        "cityCode": "421000",
                        "provinceCode": "420000",
                        "lon": 113.53891465228,
                        "lat": 29.996772000415
                    },
                    {
                        "label": "松滋市",
                        "value": "421087",
                        "cityCode": "421000",
                        "provinceCode": "420000",
                        "lon": 111.69620454012,
                        "lat": 30.105224314496
                    }
                ]
            },
            {
                "label": "黄冈市",
                "value": "421100",
                "provinceCode": "420000",
                "lon": 114.90661804658,
                "lat": 30.446108937901,
                "children": [
                    {
                        "label": "黄州区",
                        "value": "421102",
                        "cityCode": "421100",
                        "provinceCode": "420000",
                        "lon": 114.94956939748,
                        "lat": 30.518802478736
                    },
                    {
                        "label": "团风县",
                        "value": "421121",
                        "cityCode": "421100",
                        "provinceCode": "420000",
                        "lon": 115.01408720557,
                        "lat": 30.723706101243
                    },
                    {
                        "label": "红安县",
                        "value": "421122",
                        "cityCode": "421100",
                        "provinceCode": "420000",
                        "lon": 114.62811879353,
                        "lat": 31.29012275323
                    },
                    {
                        "label": "罗田县",
                        "value": "421123",
                        "cityCode": "421100",
                        "provinceCode": "420000",
                        "lon": 115.48102224121,
                        "lat": 30.932372750757
                    },
                    {
                        "label": "英山县",
                        "value": "421124",
                        "cityCode": "421100",
                        "provinceCode": "420000",
                        "lon": 115.77430241642,
                        "lat": 30.872992046545
                    },
                    {
                        "label": "浠水县",
                        "value": "421125",
                        "cityCode": "421100",
                        "provinceCode": "420000",
                        "lon": 115.27625105135,
                        "lat": 30.507400278808
                    },
                    {
                        "label": "蕲春县",
                        "value": "421126",
                        "cityCode": "421100",
                        "provinceCode": "420000",
                        "lon": 115.60077083531,
                        "lat": 30.328717011744
                    },
                    {
                        "label": "黄梅县",
                        "value": "421127",
                        "cityCode": "421100",
                        "provinceCode": "420000",
                        "lon": 115.94188335896,
                        "lat": 29.998875662753
                    },
                    {
                        "label": "麻城市",
                        "value": "421181",
                        "cityCode": "421100",
                        "provinceCode": "420000",
                        "lon": 115.08971464087,
                        "lat": 31.217943121813
                    },
                    {
                        "label": "武穴市",
                        "value": "421182",
                        "cityCode": "421100",
                        "provinceCode": "420000",
                        "lon": 115.62583375392,
                        "lat": 30.01561431062
                    }
                ]
            },
            {
                "label": "咸宁市",
                "value": "421200",
                "provinceCode": "420000",
                "lon": 114.30006059206,
                "lat": 29.880656757728,
                "children": [
                    {
                        "label": "咸安区",
                        "value": "421202",
                        "cityCode": "421200",
                        "provinceCode": "420000",
                        "lon": 114.39186727646,
                        "lat": 29.854650359958
                    },
                    {
                        "label": "嘉鱼县",
                        "value": "421221",
                        "cityCode": "421200",
                        "provinceCode": "420000",
                        "lon": 113.9671389967,
                        "lat": 30.013807145954
                    },
                    {
                        "label": "通城县",
                        "value": "421222",
                        "cityCode": "421200",
                        "provinceCode": "420000",
                        "lon": 113.85326552547,
                        "lat": 29.229496067967
                    },
                    {
                        "label": "崇阳县",
                        "value": "421223",
                        "cityCode": "421200",
                        "provinceCode": "420000",
                        "lon": 114.06793496135,
                        "lat": 29.46178869538
                    },
                    {
                        "label": "通山县",
                        "value": "421224",
                        "cityCode": "421200",
                        "provinceCode": "420000",
                        "lon": 114.61524564759,
                        "lat": 29.557670344417
                    },
                    {
                        "label": "赤壁市",
                        "value": "421281",
                        "cityCode": "421200",
                        "provinceCode": "420000",
                        "lon": 113.88916760653,
                        "lat": 29.742560741036
                    }
                ]
            },
            {
                "label": "随州市",
                "value": "421300",
                "provinceCode": "420000",
                "lon": 113.37935836429,
                "lat": 31.717857608189,
                "children": [
                    {
                        "label": "曾都区",
                        "value": "421303",
                        "cityCode": "421300",
                        "provinceCode": "420000",
                        "lon": 113.46768060015,
                        "lat": 31.607981069768
                    },
                    {
                        "label": "随县",
                        "value": "421321",
                        "cityCode": "421300",
                        "provinceCode": "420000",
                        "lon": 113.26226604576,
                        "lat": 31.89292220952
                    },
                    {
                        "label": "广水市",
                        "value": "421381",
                        "cityCode": "421300",
                        "provinceCode": "420000",
                        "lon": 113.81261910549,
                        "lat": 31.68232502305
                    }
                ]
            },
            {
                "label": "恩施土家族苗族自治州",
                "value": "422800",
                "provinceCode": "420000",
                "lon": 109.49192330375,
                "lat": 30.285888316556,
                "children": [
                    {
                        "label": "恩施市",
                        "value": "422801",
                        "cityCode": "422800",
                        "provinceCode": "420000",
                        "lon": 109.15843052724,
                        "lat": 30.463309797502
                    },
                    {
                        "label": "利川市",
                        "value": "422802",
                        "cityCode": "422800",
                        "provinceCode": "420000",
                        "lon": 108.75827737341,
                        "lat": 30.42403337354
                    },
                    {
                        "label": "建始县",
                        "value": "422822",
                        "cityCode": "422800",
                        "provinceCode": "420000",
                        "lon": 109.93959920981,
                        "lat": 30.578575985623
                    },
                    {
                        "label": "巴东县",
                        "value": "422823",
                        "cityCode": "422800",
                        "provinceCode": "420000",
                        "lon": 110.30061735767,
                        "lat": 30.827452858588
                    },
                    {
                        "label": "宣恩县",
                        "value": "422825",
                        "cityCode": "422800",
                        "provinceCode": "420000",
                        "lon": 109.45211696118,
                        "lat": 30.044021286424
                    },
                    {
                        "label": "咸丰县",
                        "value": "422826",
                        "cityCode": "422800",
                        "provinceCode": "420000",
                        "lon": 109.11475831378,
                        "lat": 29.64880608709
                    },
                    {
                        "label": "来凤县",
                        "value": "422827",
                        "cityCode": "422800",
                        "provinceCode": "420000",
                        "lon": 109.2467141194,
                        "lat": 29.425663227736
                    },
                    {
                        "label": "鹤峰县",
                        "value": "422828",
                        "cityCode": "422800",
                        "provinceCode": "420000",
                        "lon": 110.2232960585,
                        "lat": 29.959848783933
                    }
                ]
            },
            {
                "label": "省直辖县级行政区划",
                "value": "429000",
                "provinceCode": "420000",
                "lon": 112.41056219213,
                "lat": 31.20931625014,
                "children": [
                    {
                        "label": "仙桃市",
                        "value": "429004",
                        "cityCode": "429000",
                        "provinceCode": "420000",
                        "lon": 113.38744819358,
                        "lat": 30.293966004922
                    },
                    {
                        "label": "潜江市",
                        "value": "429005",
                        "cityCode": "429000",
                        "provinceCode": "420000",
                        "lon": 112.76876801686,
                        "lat": 30.343115792601
                    },
                    {
                        "label": "天门市",
                        "value": "429006",
                        "cityCode": "429000",
                        "provinceCode": "420000",
                        "lon": 113.12623048765,
                        "lat": 30.649047356422
                    },
                    {
                        "label": "神农架林区",
                        "value": "429021",
                        "cityCode": "429000",
                        "provinceCode": "420000",
                        "lon": 110.48723070015,
                        "lat": 31.595767599083
                    }
                ]
            }
        ],
        "label": "湖北省",
        "value": "420000"
    },
    {
        "country": "china",
        "lon": 111.72066354648,
        "lat": 27.695864052356,
        "children": [
            {
                "label": "长沙市",
                "value": "430100",
                "provinceCode": "430000",
                "lon": 112.97935278765,
                "lat": 28.213478230853,
                "children": [
                    {
                        "label": "芙蓉区",
                        "value": "430102",
                        "cityCode": "430100",
                        "provinceCode": "430000",
                        "lon": 113.02096885649,
                        "lat": 28.203810552355
                    },
                    {
                        "label": "天心区",
                        "value": "430103",
                        "cityCode": "430100",
                        "provinceCode": "430000",
                        "lon": 112.99619520748,
                        "lat": 28.144470861087
                    },
                    {
                        "label": "岳麓区",
                        "value": "430104",
                        "cityCode": "430100",
                        "provinceCode": "430000",
                        "lon": 112.90869935253,
                        "lat": 28.202706634928
                    },
                    {
                        "label": "开福区",
                        "value": "430105",
                        "cityCode": "430100",
                        "provinceCode": "430000",
                        "lon": 113.02472997183,
                        "lat": 28.260219056422
                    },
                    {
                        "label": "雨花区",
                        "value": "430111",
                        "cityCode": "430100",
                        "provinceCode": "430000",
                        "lon": 113.02020071545,
                        "lat": 28.146444362118
                    },
                    {
                        "label": "望城区",
                        "value": "430112",
                        "cityCode": "430100",
                        "provinceCode": "430000",
                        "lon": 112.84853518023,
                        "lat": 28.277901873199
                    },
                    {
                        "label": "长沙县",
                        "value": "430121",
                        "cityCode": "430100",
                        "provinceCode": "430000",
                        "lon": 113.22494603976,
                        "lat": 28.322758625178
                    },
                    {
                        "label": "浏阳市",
                        "value": "430181",
                        "cityCode": "430100",
                        "provinceCode": "430000",
                        "lon": 113.72198528266,
                        "lat": 28.234472053802
                    }
                ]
            },
            {
                "label": "株洲市",
                "value": "430200",
                "provinceCode": "430000",
                "lon": 113.13169534107,
                "lat": 27.827432927663,
                "children": [
                    {
                        "label": "荷塘区",
                        "value": "430202",
                        "cityCode": "430200",
                        "provinceCode": "430000",
                        "lon": 113.2125259488,
                        "lat": 27.907228809861
                    },
                    {
                        "label": "芦淞区",
                        "value": "430203",
                        "cityCode": "430200",
                        "provinceCode": "430000",
                        "lon": 113.16975977942,
                        "lat": 27.822072525123
                    },
                    {
                        "label": "石峰区",
                        "value": "430204",
                        "cityCode": "430200",
                        "provinceCode": "430000",
                        "lon": 113.16351107646,
                        "lat": 27.941584145955
                    },
                    {
                        "label": "天元区",
                        "value": "430211",
                        "cityCode": "430200",
                        "provinceCode": "430000",
                        "lon": 113.06800898383,
                        "lat": 27.77777212283
                    },
                    {
                        "label": "攸县",
                        "value": "430223",
                        "cityCode": "430200",
                        "provinceCode": "430000",
                        "lon": 113.48783136261,
                        "lat": 27.172267738735
                    },
                    {
                        "label": "茶陵县",
                        "value": "430224",
                        "cityCode": "430200",
                        "provinceCode": "430000",
                        "lon": 113.6524812712,
                        "lat": 26.806729309467
                    },
                    {
                        "label": "炎陵县",
                        "value": "430225",
                        "cityCode": "430200",
                        "provinceCode": "430000",
                        "lon": 113.85053602814,
                        "lat": 26.382712485446
                    },
                    {
                        "label": "醴陵市",
                        "value": "430281",
                        "cityCode": "430200",
                        "provinceCode": "430000",
                        "lon": 113.47062497305,
                        "lat": 27.662278573878
                    }
                ]
            },
            {
                "label": "湘潭市",
                "value": "430300",
                "provinceCode": "430000",
                "lon": 112.93555563303,
                "lat": 27.835095052979,
                "children": [
                    {
                        "label": "雨湖区",
                        "value": "430302",
                        "cityCode": "430300",
                        "provinceCode": "430000",
                        "lon": 112.89447989496,
                        "lat": 27.871843464684
                    },
                    {
                        "label": "岳塘区",
                        "value": "430304",
                        "cityCode": "430300",
                        "provinceCode": "430000",
                        "lon": 113.02348797463,
                        "lat": 27.927747363022
                    },
                    {
                        "label": "湘潭县",
                        "value": "430321",
                        "cityCode": "430300",
                        "provinceCode": "430000",
                        "lon": 112.78880535021,
                        "lat": 27.66922281069
                    },
                    {
                        "label": "湘乡市",
                        "value": "430381",
                        "cityCode": "430300",
                        "provinceCode": "430000",
                        "lon": 112.35516854771,
                        "lat": 27.77667974388
                    },
                    {
                        "label": "韶山市",
                        "value": "430382",
                        "cityCode": "430300",
                        "provinceCode": "430000",
                        "lon": 112.53309503972,
                        "lat": 27.927332779842
                    }
                ]
            },
            {
                "label": "衡阳市",
                "value": "430400",
                "provinceCode": "430000",
                "lon": 112.58381881072,
                "lat": 26.898164415358,
                "children": [
                    {
                        "label": "珠晖区",
                        "value": "430405",
                        "cityCode": "430400",
                        "provinceCode": "430000",
                        "lon": 112.68848999752,
                        "lat": 26.882224641246
                    },
                    {
                        "label": "雁峰区",
                        "value": "430406",
                        "cityCode": "430400",
                        "provinceCode": "430000",
                        "lon": 112.60790741194,
                        "lat": 26.852862113311
                    },
                    {
                        "label": "石鼓区",
                        "value": "430407",
                        "cityCode": "430400",
                        "provinceCode": "430000",
                        "lon": 112.60248766531,
                        "lat": 26.958880199218
                    },
                    {
                        "label": "蒸湘区",
                        "value": "430408",
                        "cityCode": "430400",
                        "provinceCode": "430000",
                        "lon": 112.5550474327,
                        "lat": 26.886508776556
                    },
                    {
                        "label": "南岳区",
                        "value": "430412",
                        "cityCode": "430400",
                        "provinceCode": "430000",
                        "lon": 112.70876706188,
                        "lat": 27.259358565856
                    },
                    {
                        "label": "衡阳县",
                        "value": "430421",
                        "cityCode": "430400",
                        "provinceCode": "430000",
                        "lon": 112.35157940823,
                        "lat": 27.109626113862
                    },
                    {
                        "label": "衡南县",
                        "value": "430422",
                        "cityCode": "430400",
                        "provinceCode": "430000",
                        "lon": 112.64851378595,
                        "lat": 26.759844895044
                    },
                    {
                        "label": "衡山县",
                        "value": "430423",
                        "cityCode": "430400",
                        "provinceCode": "430000",
                        "lon": 112.71963002036,
                        "lat": 27.281912376828
                    },
                    {
                        "label": "衡东县",
                        "value": "430424",
                        "cityCode": "430400",
                        "provinceCode": "430000",
                        "lon": 113.02900158518,
                        "lat": 27.085080215257
                    },
                    {
                        "label": "祁东县",
                        "value": "430426",
                        "cityCode": "430400",
                        "provinceCode": "430000",
                        "lon": 111.96160590404,
                        "lat": 26.806848291159
                    },
                    {
                        "label": "耒阳市",
                        "value": "430481",
                        "cityCode": "430400",
                        "provinceCode": "430000",
                        "lon": 112.9215515181,
                        "lat": 26.423992793417
                    },
                    {
                        "label": "常宁市",
                        "value": "430482",
                        "cityCode": "430400",
                        "provinceCode": "430000",
                        "lon": 112.43550437188,
                        "lat": 26.365629347663
                    }
                ]
            },
            {
                "label": "邵阳市",
                "value": "430500",
                "provinceCode": "430000",
                "lon": 111.46152540355,
                "lat": 27.236811244922,
                "children": [
                    {
                        "label": "双清区",
                        "value": "430502",
                        "cityCode": "430500",
                        "provinceCode": "430000",
                        "lon": 111.54534736863,
                        "lat": 27.248222019138
                    },
                    {
                        "label": "大祥区",
                        "value": "430503",
                        "cityCode": "430500",
                        "provinceCode": "430000",
                        "lon": 111.48663933069,
                        "lat": 27.15673687542
                    },
                    {
                        "label": "北塔区",
                        "value": "430511",
                        "cityCode": "430500",
                        "provinceCode": "430000",
                        "lon": 111.42227870533,
                        "lat": 27.250338344113
                    },
                    {
                        "label": "新邵县",
                        "value": "430522",
                        "cityCode": "430500",
                        "provinceCode": "430000",
                        "lon": 111.47127474176,
                        "lat": 27.431198790186
                    },
                    {
                        "label": "邵阳县",
                        "value": "430523",
                        "cityCode": "430500",
                        "provinceCode": "430000",
                        "lon": 111.33237232124,
                        "lat": 26.984976684914
                    },
                    {
                        "label": "隆回县",
                        "value": "430524",
                        "cityCode": "430500",
                        "provinceCode": "430000",
                        "lon": 110.97332605607,
                        "lat": 27.351830793846
                    },
                    {
                        "label": "洞口县",
                        "value": "430525",
                        "cityCode": "430500",
                        "provinceCode": "430000",
                        "lon": 110.5997390171,
                        "lat": 27.103195627285
                    },
                    {
                        "label": "绥宁县",
                        "value": "430527",
                        "cityCode": "430500",
                        "provinceCode": "430000",
                        "lon": 110.20598518573,
                        "lat": 26.714433355354
                    },
                    {
                        "label": "新宁县",
                        "value": "430528",
                        "cityCode": "430500",
                        "provinceCode": "430000",
                        "lon": 110.92469767578,
                        "lat": 26.548580699981
                    },
                    {
                        "label": "城步苗族自治县",
                        "value": "430529",
                        "cityCode": "430500",
                        "provinceCode": "430000",
                        "lon": 110.32530265472,
                        "lat": 26.325514573582
                    },
                    {
                        "label": "武冈市",
                        "value": "430581",
                        "cityCode": "430500",
                        "provinceCode": "430000",
                        "lon": 110.74581533919,
                        "lat": 26.786578072622
                    }
                ]
            },
            {
                "label": "岳阳市",
                "value": "430600",
                "provinceCode": "430000",
                "lon": 113.14619551912,
                "lat": 29.378007075474,
                "children": [
                    {
                        "label": "岳阳楼区",
                        "value": "430602",
                        "cityCode": "430600",
                        "provinceCode": "430000",
                        "lon": 113.15536982346,
                        "lat": 29.367743455935
                    },
                    {
                        "label": "云溪区",
                        "value": "430603",
                        "cityCode": "430600",
                        "provinceCode": "430000",
                        "lon": 113.35377424951,
                        "lat": 29.526210726593
                    },
                    {
                        "label": "君山区",
                        "value": "430611",
                        "cityCode": "430600",
                        "provinceCode": "430000",
                        "lon": 112.82353001902,
                        "lat": 29.461963175999
                    },
                    {
                        "label": "岳阳县",
                        "value": "430621",
                        "cityCode": "430600",
                        "provinceCode": "430000",
                        "lon": 113.23752715256,
                        "lat": 29.178498531192
                    },
                    {
                        "label": "华容县",
                        "value": "430623",
                        "cityCode": "430600",
                        "provinceCode": "430000",
                        "lon": 112.65100948964,
                        "lat": 29.493395834151
                    },
                    {
                        "label": "湘阴县",
                        "value": "430624",
                        "cityCode": "430600",
                        "provinceCode": "430000",
                        "lon": 112.8053736108,
                        "lat": 28.713089704815
                    },
                    {
                        "label": "平江县",
                        "value": "430626",
                        "cityCode": "430600",
                        "provinceCode": "430000",
                        "lon": 113.72084646866,
                        "lat": 28.762202955269
                    },
                    {
                        "label": "汨罗市",
                        "value": "430681",
                        "cityCode": "430600",
                        "provinceCode": "430000",
                        "lon": 113.12502676793,
                        "lat": 28.801958087001
                    },
                    {
                        "label": "临湘市",
                        "value": "430682",
                        "cityCode": "430600",
                        "provinceCode": "430000",
                        "lon": 113.51974938156,
                        "lat": 29.496146011064
                    }
                ]
            },
            {
                "label": "常德市",
                "value": "430700",
                "provinceCode": "430000",
                "lon": 111.65371813684,
                "lat": 29.012148855181,
                "children": [
                    {
                        "label": "武陵区",
                        "value": "430702",
                        "cityCode": "430700",
                        "provinceCode": "430000",
                        "lon": 111.69744989482,
                        "lat": 28.996871241883
                    },
                    {
                        "label": "鼎城区",
                        "value": "430703",
                        "cityCode": "430700",
                        "provinceCode": "430000",
                        "lon": 111.74779560677,
                        "lat": 28.99524298628
                    },
                    {
                        "label": "安乡县",
                        "value": "430721",
                        "cityCode": "430700",
                        "provinceCode": "430000",
                        "lon": 112.16243681004,
                        "lat": 29.448996008449
                    },
                    {
                        "label": "汉寿县",
                        "value": "430722",
                        "cityCode": "430700",
                        "provinceCode": "430000",
                        "lon": 112.04431060341,
                        "lat": 28.864800229907
                    },
                    {
                        "label": "澧县",
                        "value": "430723",
                        "cityCode": "430700",
                        "provinceCode": "430000",
                        "lon": 111.70770306732,
                        "lat": 29.750168137633
                    },
                    {
                        "label": "临澧县",
                        "value": "430724",
                        "cityCode": "430700",
                        "provinceCode": "430000",
                        "lon": 111.62542246954,
                        "lat": 29.486256878123
                    },
                    {
                        "label": "桃源县",
                        "value": "430725",
                        "cityCode": "430700",
                        "provinceCode": "430000",
                        "lon": 111.27070654871,
                        "lat": 28.917817681602
                    },
                    {
                        "label": "石门县",
                        "value": "430726",
                        "cityCode": "430700",
                        "provinceCode": "430000",
                        "lon": 111.04428685665,
                        "lat": 29.801742760215
                    },
                    {
                        "label": "津市市",
                        "value": "430781",
                        "cityCode": "430700",
                        "provinceCode": "430000",
                        "lon": 111.90685042221,
                        "lat": 29.474442427089
                    }
                ]
            },
            {
                "label": "张家界市",
                "value": "430800",
                "provinceCode": "430000",
                "lon": 110.48162015697,
                "lat": 29.12488935322,
                "children": [
                    {
                        "label": "永定区",
                        "value": "430802",
                        "cityCode": "430800",
                        "provinceCode": "430000",
                        "lon": 110.50100729665,
                        "lat": 29.08853881247
                    },
                    {
                        "label": "武陵源区",
                        "value": "430811",
                        "cityCode": "430800",
                        "provinceCode": "430000",
                        "lon": 110.48849578734,
                        "lat": 29.35720050871
                    },
                    {
                        "label": "慈利县",
                        "value": "430821",
                        "cityCode": "430800",
                        "provinceCode": "430000",
                        "lon": 110.9362003537,
                        "lat": 29.397692771035
                    },
                    {
                        "label": "桑植县",
                        "value": "430822",
                        "cityCode": "430800",
                        "provinceCode": "430000",
                        "lon": 110.18733600686,
                        "lat": 29.567691591611
                    }
                ]
            },
            {
                "label": "益阳市",
                "value": "430900",
                "provinceCode": "430000",
                "lon": 112.36654664523,
                "lat": 28.588087779887,
                "children": [
                    {
                        "label": "资阳区",
                        "value": "430902",
                        "cityCode": "430900",
                        "provinceCode": "430000",
                        "lon": 112.34312135279,
                        "lat": 28.694069428897
                    },
                    {
                        "label": "赫山区",
                        "value": "430903",
                        "cityCode": "430900",
                        "provinceCode": "430000",
                        "lon": 112.46132362565,
                        "lat": 28.456919373898
                    },
                    {
                        "label": "南县",
                        "value": "430921",
                        "cityCode": "430900",
                        "provinceCode": "430000",
                        "lon": 112.4444992186,
                        "lat": 29.242714345729
                    },
                    {
                        "label": "桃江县",
                        "value": "430922",
                        "cityCode": "430900",
                        "provinceCode": "430000",
                        "lon": 111.99046415183,
                        "lat": 28.464142378681
                    },
                    {
                        "label": "安化县",
                        "value": "430923",
                        "cityCode": "430900",
                        "provinceCode": "430000",
                        "lon": 111.39078157302,
                        "lat": 28.286580101198
                    },
                    {
                        "label": "沅江市",
                        "value": "430981",
                        "cityCode": "430900",
                        "provinceCode": "430000",
                        "lon": 112.56494222194,
                        "lat": 28.977186044013
                    }
                ]
            },
            {
                "label": "郴州市",
                "value": "431000",
                "provinceCode": "430000",
                "lon": 113.0377044678,
                "lat": 25.782263975739,
                "children": [
                    {
                        "label": "北湖区",
                        "value": "431002",
                        "cityCode": "431000",
                        "provinceCode": "430000",
                        "lon": 112.88447564616,
                        "lat": 25.679158376796
                    },
                    {
                        "label": "苏仙区",
                        "value": "431003",
                        "cityCode": "431000",
                        "provinceCode": "430000",
                        "lon": 113.05100154527,
                        "lat": 25.773515156215
                    },
                    {
                        "label": "桂阳县",
                        "value": "431021",
                        "cityCode": "431000",
                        "provinceCode": "430000",
                        "lon": 112.60810756507,
                        "lat": 25.893490018268
                    },
                    {
                        "label": "宜章县",
                        "value": "431022",
                        "cityCode": "431000",
                        "provinceCode": "430000",
                        "lon": 112.93344735219,
                        "lat": 25.275886554538
                    },
                    {
                        "label": "永兴县",
                        "value": "431023",
                        "cityCode": "431000",
                        "provinceCode": "430000",
                        "lon": 113.19839325538,
                        "lat": 26.216491688814
                    },
                    {
                        "label": "嘉禾县",
                        "value": "431024",
                        "cityCode": "431000",
                        "provinceCode": "430000",
                        "lon": 112.41435261569,
                        "lat": 25.637287293573
                    },
                    {
                        "label": "临武县",
                        "value": "431025",
                        "cityCode": "431000",
                        "provinceCode": "430000",
                        "lon": 112.56804110466,
                        "lat": 25.34399717934
                    },
                    {
                        "label": "汝城县",
                        "value": "431026",
                        "cityCode": "431000",
                        "provinceCode": "430000",
                        "lon": 113.67767672321,
                        "lat": 25.555136753643
                    },
                    {
                        "label": "桂东县",
                        "value": "431027",
                        "cityCode": "431000",
                        "provinceCode": "430000",
                        "lon": 113.90640126356,
                        "lat": 25.98664473819
                    },
                    {
                        "label": "安仁县",
                        "value": "431028",
                        "cityCode": "431000",
                        "provinceCode": "430000",
                        "lon": 113.3656988724,
                        "lat": 26.580785897827
                    },
                    {
                        "label": "资兴市",
                        "value": "431081",
                        "cityCode": "431000",
                        "provinceCode": "430000",
                        "lon": 113.4685220784,
                        "lat": 25.937184405929
                    }
                ]
            },
            {
                "label": "永州市",
                "value": "431100",
                "provinceCode": "430000",
                "lon": 111.61464768616,
                "lat": 26.435971646759,
                "children": [
                    {
                        "label": "零陵区",
                        "value": "431102",
                        "cityCode": "431100",
                        "provinceCode": "430000",
                        "lon": 111.56391866724,
                        "lat": 26.102311299933
                    },
                    {
                        "label": "冷水滩区",
                        "value": "431103",
                        "cityCode": "431100",
                        "provinceCode": "430000",
                        "lon": 111.6215855691,
                        "lat": 26.560381677834
                    },
                    {
                        "label": "祁阳县",
                        "value": "431121",
                        "cityCode": "431100",
                        "provinceCode": "430000",
                        "lon": 111.97259355447,
                        "lat": 26.460846002508
                    },
                    {
                        "label": "东安县",
                        "value": "431122",
                        "cityCode": "431100",
                        "provinceCode": "430000",
                        "lon": 111.3428094117,
                        "lat": 26.495587621014
                    },
                    {
                        "label": "双牌县",
                        "value": "431123",
                        "cityCode": "431100",
                        "provinceCode": "430000",
                        "lon": 111.71629417694,
                        "lat": 25.914932997744
                    },
                    {
                        "label": "道县",
                        "value": "431124",
                        "cityCode": "431100",
                        "provinceCode": "430000",
                        "lon": 111.60204209765,
                        "lat": 25.499396959983
                    },
                    {
                        "label": "江永县",
                        "value": "431125",
                        "cityCode": "431100",
                        "provinceCode": "430000",
                        "lon": 111.25388667817,
                        "lat": 25.199988241379
                    },
                    {
                        "label": "宁远县",
                        "value": "431126",
                        "cityCode": "431100",
                        "provinceCode": "430000",
                        "lon": 111.98806316398,
                        "lat": 25.653839564231
                    },
                    {
                        "label": "蓝山县",
                        "value": "431127",
                        "cityCode": "431100",
                        "provinceCode": "430000",
                        "lon": 112.1963927883,
                        "lat": 25.319502616064
                    },
                    {
                        "label": "新田县",
                        "value": "431128",
                        "cityCode": "431100",
                        "provinceCode": "430000",
                        "lon": 112.23480727989,
                        "lat": 25.890527389354
                    },
                    {
                        "label": "江华瑶族自治县",
                        "value": "431129",
                        "cityCode": "431100",
                        "provinceCode": "430000",
                        "lon": 111.75249569192,
                        "lat": 24.977642122796
                    }
                ]
            },
            {
                "label": "怀化市",
                "value": "431200",
                "provinceCode": "430000",
                "lon": 109.98695879585,
                "lat": 27.557482901173,
                "children": [
                    {
                        "label": "鹤城区",
                        "value": "431202",
                        "cityCode": "431200",
                        "provinceCode": "430000",
                        "lon": 109.94553900894,
                        "lat": 27.612024135064
                    },
                    {
                        "label": "中方县",
                        "value": "431221",
                        "cityCode": "431200",
                        "provinceCode": "430000",
                        "lon": 110.16536245669,
                        "lat": 27.52093513528
                    },
                    {
                        "label": "沅陵县",
                        "value": "431222",
                        "cityCode": "431200",
                        "provinceCode": "430000",
                        "lon": 110.60117801132,
                        "lat": 28.576604506247
                    },
                    {
                        "label": "辰溪县",
                        "value": "431223",
                        "cityCode": "431200",
                        "provinceCode": "430000",
                        "lon": 110.27300890779,
                        "lat": 27.895902086692
                    },
                    {
                        "label": "溆浦县",
                        "value": "431224",
                        "cityCode": "431200",
                        "provinceCode": "430000",
                        "lon": 110.65858111747,
                        "lat": 27.83590994386
                    },
                    {
                        "label": "会同县",
                        "value": "431225",
                        "cityCode": "431200",
                        "provinceCode": "430000",
                        "lon": 109.8099454141,
                        "lat": 26.914136373938
                    },
                    {
                        "label": "麻阳苗族自治县",
                        "value": "431226",
                        "cityCode": "431200",
                        "provinceCode": "430000",
                        "lon": 109.72917909558,
                        "lat": 27.791375726707
                    },
                    {
                        "label": "新晃侗族自治县",
                        "value": "431227",
                        "cityCode": "431200",
                        "provinceCode": "430000",
                        "lon": 109.1687410593,
                        "lat": 27.234509109112
                    },
                    {
                        "label": "芷江侗族自治县",
                        "value": "431228",
                        "cityCode": "431200",
                        "provinceCode": "430000",
                        "lon": 109.61110485123,
                        "lat": 27.402510416382
                    },
                    {
                        "label": "靖州苗族侗族自治县",
                        "value": "431229",
                        "cityCode": "431200",
                        "provinceCode": "430000",
                        "lon": 109.59083349436,
                        "lat": 26.550430723333
                    },
                    {
                        "label": "通道侗族自治县",
                        "value": "431230",
                        "cityCode": "431200",
                        "provinceCode": "430000",
                        "lon": 109.7446605455,
                        "lat": 26.215115332486
                    },
                    {
                        "label": "洪江市",
                        "value": "431281",
                        "cityCode": "431200",
                        "provinceCode": "430000",
                        "lon": 110.08719342097,
                        "lat": 27.239105321481
                    }
                ]
            },
            {
                "label": "娄底市",
                "value": "431300",
                "provinceCode": "430000",
                "lon": 111.99639635657,
                "lat": 27.741073302349,
                "children": [
                    {
                        "label": "娄星区",
                        "value": "431302",
                        "cityCode": "431300",
                        "provinceCode": "430000",
                        "lon": 112.00461910688,
                        "lat": 27.766945342839
                    },
                    {
                        "label": "双峰县",
                        "value": "431321",
                        "cityCode": "431300",
                        "provinceCode": "430000",
                        "lon": 112.18792282367,
                        "lat": 27.465564445594
                    },
                    {
                        "label": "新化县",
                        "value": "431322",
                        "cityCode": "431300",
                        "provinceCode": "430000",
                        "lon": 111.24684472009,
                        "lat": 27.873272599439
                    },
                    {
                        "label": "冷水江市",
                        "value": "431381",
                        "cityCode": "431300",
                        "provinceCode": "430000",
                        "lon": 111.49394197482,
                        "lat": 27.684914712556
                    },
                    {
                        "label": "涟源市",
                        "value": "431382",
                        "cityCode": "431300",
                        "provinceCode": "430000",
                        "lon": 111.79458146238,
                        "lat": 27.743727453351
                    }
                ]
            },
            {
                "label": "湘西土家族苗族自治州",
                "value": "433100",
                "provinceCode": "430000",
                "lon": 109.74574580039,
                "lat": 28.317950793674,
                "children": [
                    {
                        "label": "吉首市",
                        "value": "433101",
                        "cityCode": "433100",
                        "provinceCode": "430000",
                        "lon": 109.90596604398,
                        "lat": 28.297553747059
                    },
                    {
                        "label": "泸溪县",
                        "value": "433122",
                        "cityCode": "433100",
                        "provinceCode": "430000",
                        "lon": 109.83368299284,
                        "lat": 28.004620053587
                    },
                    {
                        "label": "凤凰县",
                        "value": "433123",
                        "cityCode": "433100",
                        "provinceCode": "430000",
                        "lon": 109.627609014,
                        "lat": 28.128806804716
                    },
                    {
                        "label": "花垣县",
                        "value": "433124",
                        "cityCode": "433100",
                        "provinceCode": "430000",
                        "lon": 109.45712787573,
                        "lat": 28.573833156579
                    },
                    {
                        "label": "保靖县",
                        "value": "433125",
                        "cityCode": "433100",
                        "provinceCode": "430000",
                        "lon": 109.69701784684,
                        "lat": 28.653191600514
                    },
                    {
                        "label": "古丈县",
                        "value": "433126",
                        "cityCode": "433100",
                        "provinceCode": "430000",
                        "lon": 110.00814905055,
                        "lat": 28.603594321825
                    },
                    {
                        "label": "永顺县",
                        "value": "433127",
                        "cityCode": "433100",
                        "provinceCode": "430000",
                        "lon": 109.95878299439,
                        "lat": 28.753308819921
                    },
                    {
                        "label": "龙山县",
                        "value": "433130",
                        "cityCode": "433100",
                        "provinceCode": "430000",
                        "lon": 109.44489996147,
                        "lat": 29.458093683151
                    }
                ]
            }
        ],
        "label": "湖南省",
        "value": "430000"
    },
    {
        "country": "china",
        "lon": 113.39481755876,
        "lat": 23.408003729025,
        "children": [
            {
                "label": "广州市",
                "value": "440100",
                "provinceCode": "440000",
                "lon": 113.30764967515,
                "lat": 23.120049102076,
                "children": [
                    {
                        "label": "荔湾区",
                        "value": "440103",
                        "cityCode": "440100",
                        "provinceCode": "440000",
                        "lon": 113.23442278391,
                        "lat": 23.093666203644
                    },
                    {
                        "label": "越秀区",
                        "value": "440104",
                        "cityCode": "440100",
                        "provinceCode": "440000",
                        "lon": 113.28783302666,
                        "lat": 23.139277859339
                    },
                    {
                        "label": "海珠区",
                        "value": "440105",
                        "cityCode": "440100",
                        "provinceCode": "440000",
                        "lon": 113.33384126613,
                        "lat": 23.087629228789
                    },
                    {
                        "label": "天河区",
                        "value": "440106",
                        "cityCode": "440100",
                        "provinceCode": "440000",
                        "lon": 113.38564289133,
                        "lat": 23.166129265425
                    },
                    {
                        "label": "白云区",
                        "value": "440111",
                        "cityCode": "440100",
                        "provinceCode": "440000",
                        "lon": 113.33130628641,
                        "lat": 23.294514083014
                    },
                    {
                        "label": "黄埔区",
                        "value": "440112",
                        "cityCode": "440100",
                        "provinceCode": "440000",
                        "lon": 113.49288457425,
                        "lat": 23.108711814239
                    },
                    {
                        "label": "番禺区",
                        "value": "440113",
                        "cityCode": "440100",
                        "provinceCode": "440000",
                        "lon": 113.41679952965,
                        "lat": 22.934590795798
                    },
                    {
                        "label": "花都区",
                        "value": "440114",
                        "cityCode": "440100",
                        "provinceCode": "440000",
                        "lon": 113.22017551212,
                        "lat": 23.446660997141
                    },
                    {
                        "label": "南沙区",
                        "value": "440115",
                        "cityCode": "440100",
                        "provinceCode": "440000",
                        "lon": 113.58022392527,
                        "lat": 22.729893804121
                    },
                    {
                        "label": "从化区",
                        "value": "440117",
                        "cityCode": "440100",
                        "provinceCode": "440000",
                        "lon": 113.69870948609,
                        "lat": 23.705203224537
                    },
                    {
                        "label": "增城区",
                        "value": "440118",
                        "cityCode": "440100",
                        "provinceCode": "440000",
                        "lon": 113.77002334194,
                        "lat": 23.332025887963
                    }
                ]
            },
            {
                "label": "韶关市",
                "value": "440200",
                "provinceCode": "440000",
                "lon": 113.59446110744,
                "lat": 24.802960311892,
                "children": [
                    {
                        "label": "武江区",
                        "value": "440203",
                        "cityCode": "440200",
                        "provinceCode": "440000",
                        "lon": 113.37960618165,
                        "lat": 24.708193228698
                    },
                    {
                        "label": "浈江区",
                        "value": "440204",
                        "cityCode": "440200",
                        "provinceCode": "440000",
                        "lon": 113.57745027759,
                        "lat": 24.919162254549
                    },
                    {
                        "label": "曲江区",
                        "value": "440205",
                        "cityCode": "440200",
                        "provinceCode": "440000",
                        "lon": 113.64217762719,
                        "lat": 24.651897914445
                    },
                    {
                        "label": "始兴县",
                        "value": "440222",
                        "cityCode": "440200",
                        "provinceCode": "440000",
                        "lon": 114.11540446493,
                        "lat": 24.852706291962
                    },
                    {
                        "label": "仁化县",
                        "value": "440224",
                        "cityCode": "440200",
                        "provinceCode": "440000",
                        "lon": 113.78547373726,
                        "lat": 25.148465646013
                    },
                    {
                        "label": "翁源县",
                        "value": "440229",
                        "cityCode": "440200",
                        "provinceCode": "440000",
                        "lon": 114.03042755919,
                        "lat": 24.426734740638
                    },
                    {
                        "label": "乳源瑶族自治县",
                        "value": "440232",
                        "cityCode": "440200",
                        "provinceCode": "440000",
                        "lon": 113.17577755468,
                        "lat": 24.812051773842
                    },
                    {
                        "label": "新丰县",
                        "value": "440233",
                        "cityCode": "440200",
                        "provinceCode": "440000",
                        "lon": 114.14177489194,
                        "lat": 24.070091776392
                    },
                    {
                        "label": "乐昌市",
                        "value": "440281",
                        "cityCode": "440200",
                        "provinceCode": "440000",
                        "lon": 113.24695611826,
                        "lat": 25.244441914003
                    },
                    {
                        "label": "南雄市",
                        "value": "440282",
                        "cityCode": "440200",
                        "provinceCode": "440000",
                        "lon": 114.38658277052,
                        "lat": 25.189905400508
                    }
                ]
            },
            {
                "label": "深圳市",
                "value": "440300",
                "provinceCode": "440000",
                "lon": 114.02597365732,
                "lat": 22.546053546205,
                "children": [
                    {
                        "label": "罗湖区",
                        "value": "440303",
                        "cityCode": "440300",
                        "provinceCode": "440000",
                        "lon": 114.15639529324,
                        "lat": 22.581934478848
                    },
                    {
                        "label": "福田区",
                        "value": "440304",
                        "cityCode": "440300",
                        "provinceCode": "440000",
                        "lon": 114.05559275391,
                        "lat": 22.551730572433
                    },
                    {
                        "label": "南山区",
                        "value": "440305",
                        "cityCode": "440300",
                        "provinceCode": "440000",
                        "lon": 113.95072266574,
                        "lat": 22.558887751083
                    },
                    {
                        "label": "宝安区",
                        "value": "440306",
                        "cityCode": "440300",
                        "provinceCode": "440000",
                        "lon": 113.93001313569,
                        "lat": 22.707432793082
                    },
                    {
                        "label": "龙岗区",
                        "value": "440307",
                        "cityCode": "440300",
                        "provinceCode": "440000",
                        "lon": 114.34769572771,
                        "lat": 22.657462286882
                    },
                    {
                        "label": "盐田区",
                        "value": "440308",
                        "cityCode": "440300",
                        "provinceCode": "440000",
                        "lon": 114.27848287567,
                        "lat": 22.606981337589
                    }
                ]
            },
            {
                "label": "珠海市",
                "value": "440400",
                "provinceCode": "440000",
                "lon": 113.56244702619,
                "lat": 22.256914646126,
                "children": [
                    {
                        "label": "香洲区",
                        "value": "440402",
                        "cityCode": "440400",
                        "provinceCode": "440000",
                        "lon": 113.53373098039,
                        "lat": 22.26559983535
                    },
                    {
                        "label": "斗门区",
                        "value": "440403",
                        "cityCode": "440400",
                        "provinceCode": "440000",
                        "lon": 113.24798167517,
                        "lat": 22.216636753124
                    },
                    {
                        "label": "金湾区",
                        "value": "440404",
                        "cityCode": "440400",
                        "provinceCode": "440000",
                        "lon": 113.41758987066,
                        "lat": 22.04721492726
                    }
                ]
            },
            {
                "label": "汕头市",
                "value": "440500",
                "provinceCode": "440000",
                "lon": 116.72865028834,
                "lat": 23.383908453269,
                "children": [
                    {
                        "label": "龙湖区",
                        "value": "440507",
                        "cityCode": "440500",
                        "provinceCode": "440000",
                        "lon": 116.75934746239,
                        "lat": 23.408849226222
                    },
                    {
                        "label": "金平区",
                        "value": "440511",
                        "cityCode": "440500",
                        "provinceCode": "440000",
                        "lon": 116.65179359137,
                        "lat": 23.399887892781
                    },
                    {
                        "label": "濠江区",
                        "value": "440512",
                        "cityCode": "440500",
                        "provinceCode": "440000",
                        "lon": 116.71136293853,
                        "lat": 23.282442837577
                    },
                    {
                        "label": "潮阳区",
                        "value": "440513",
                        "cityCode": "440500",
                        "provinceCode": "440000",
                        "lon": 116.48544753544,
                        "lat": 23.347253898106
                    },
                    {
                        "label": "潮南区",
                        "value": "440514",
                        "cityCode": "440500",
                        "provinceCode": "440000",
                        "lon": 116.41405584392,
                        "lat": 23.181395091106
                    },
                    {
                        "label": "澄海区",
                        "value": "440515",
                        "cityCode": "440500",
                        "provinceCode": "440000",
                        "lon": 116.8148077949,
                        "lat": 23.532996549632
                    },
                    {
                        "label": "南澳县",
                        "value": "440523",
                        "cityCode": "440500",
                        "provinceCode": "440000",
                        "lon": 117.0704048247,
                        "lat": 23.439131822072
                    }
                ]
            },
            {
                "label": "佛山市",
                "value": "440600",
                "provinceCode": "440000",
                "lon": 113.13402563539,
                "lat": 23.035094840514,
                "children": [
                    {
                        "label": "禅城区",
                        "value": "440604",
                        "cityCode": "440600",
                        "provinceCode": "440000",
                        "lon": 113.07042319497,
                        "lat": 23.004210165991
                    },
                    {
                        "label": "南海区",
                        "value": "440605",
                        "cityCode": "440600",
                        "provinceCode": "440000",
                        "lon": 113.04138132585,
                        "lat": 23.07826538747
                    },
                    {
                        "label": "顺德区",
                        "value": "440606",
                        "cityCode": "440600",
                        "provinceCode": "440000",
                        "lon": 113.18702987688,
                        "lat": 22.848510084787
                    },
                    {
                        "label": "三水区",
                        "value": "440607",
                        "cityCode": "440600",
                        "provinceCode": "440000",
                        "lon": 112.90467719327,
                        "lat": 23.294580845555
                    },
                    {
                        "label": "高明区",
                        "value": "440608",
                        "cityCode": "440600",
                        "provinceCode": "440000",
                        "lon": 112.68325830314,
                        "lat": 22.824522683444
                    }
                ]
            },
            {
                "label": "江门市",
                "value": "440700",
                "provinceCode": "440000",
                "lon": 113.07812534115,
                "lat": 22.575116783451,
                "children": [
                    {
                        "label": "蓬江区",
                        "value": "440703",
                        "cityCode": "440700",
                        "provinceCode": "440000",
                        "lon": 113.06077007598,
                        "lat": 22.660132832793
                    },
                    {
                        "label": "江海区",
                        "value": "440704",
                        "cityCode": "440700",
                        "provinceCode": "440000",
                        "lon": 113.13537054201,
                        "lat": 22.554846678035
                    },
                    {
                        "label": "新会区",
                        "value": "440705",
                        "cityCode": "440700",
                        "provinceCode": "440000",
                        "lon": 113.0347511329,
                        "lat": 22.38821506964
                    },
                    {
                        "label": "台山市",
                        "value": "440781",
                        "cityCode": "440700",
                        "provinceCode": "440000",
                        "lon": 112.7159079377,
                        "lat": 22.034638545952
                    },
                    {
                        "label": "开平市",
                        "value": "440783",
                        "cityCode": "440700",
                        "provinceCode": "440000",
                        "lon": 112.54804114164,
                        "lat": 22.374200664984
                    },
                    {
                        "label": "鹤山市",
                        "value": "440784",
                        "cityCode": "440700",
                        "provinceCode": "440000",
                        "lon": 112.80161841196,
                        "lat": 22.675317373533
                    },
                    {
                        "label": "恩平市",
                        "value": "440785",
                        "cityCode": "440700",
                        "provinceCode": "440000",
                        "lon": 112.28646122263,
                        "lat": 22.240985208711
                    }
                ]
            },
            {
                "label": "湛江市",
                "value": "440800",
                "provinceCode": "440000",
                "lon": 110.36506726285,
                "lat": 21.257463103764,
                "children": [
                    {
                        "label": "赤坎区",
                        "value": "440802",
                        "cityCode": "440800",
                        "provinceCode": "440000",
                        "lon": 110.37972297262,
                        "lat": 21.287667885107
                    },
                    {
                        "label": "霞山区",
                        "value": "440803",
                        "cityCode": "440800",
                        "provinceCode": "440000",
                        "lon": 110.38519600028,
                        "lat": 21.2048473973
                    },
                    {
                        "label": "坡头区",
                        "value": "440804",
                        "cityCode": "440800",
                        "provinceCode": "440000",
                        "lon": 110.51272613161,
                        "lat": 21.283819774873
                    },
                    {
                        "label": "麻章区",
                        "value": "440811",
                        "cityCode": "440800",
                        "provinceCode": "440000",
                        "lon": 110.33802177707,
                        "lat": 21.094100364979
                    },
                    {
                        "label": "遂溪县",
                        "value": "440823",
                        "cityCode": "440800",
                        "provinceCode": "440000",
                        "lon": 110.0398954377,
                        "lat": 21.270307383787
                    },
                    {
                        "label": "徐闻县",
                        "value": "440825",
                        "cityCode": "440800",
                        "provinceCode": "440000",
                        "lon": 110.25784725094,
                        "lat": 20.429967572815
                    },
                    {
                        "label": "廉江市",
                        "value": "440881",
                        "cityCode": "440800",
                        "provinceCode": "440000",
                        "lon": 110.14171137206,
                        "lat": 21.645265225554
                    },
                    {
                        "label": "雷州市",
                        "value": "440882",
                        "cityCode": "440800",
                        "provinceCode": "440000",
                        "lon": 110.01263612715,
                        "lat": 20.796584309564
                    },
                    {
                        "label": "吴川市",
                        "value": "440883",
                        "cityCode": "440800",
                        "provinceCode": "440000",
                        "lon": 110.70818705195,
                        "lat": 21.441681041112
                    }
                ]
            },
            {
                "label": "茂名市",
                "value": "440900",
                "provinceCode": "440000",
                "lon": 110.93124533068,
                "lat": 21.668225718822,
                "children": [
                    {
                        "label": "茂南区",
                        "value": "440902",
                        "cityCode": "440900",
                        "provinceCode": "440000",
                        "lon": 110.86860979348,
                        "lat": 21.676115917529
                    },
                    {
                        "label": "电白区",
                        "value": "440904",
                        "cityCode": "440900",
                        "provinceCode": "440000",
                        "lon": 111.15968915137,
                        "lat": 21.66821689615
                    },
                    {
                        "label": "高州市",
                        "value": "440981",
                        "cityCode": "440900",
                        "provinceCode": "440000",
                        "lon": 110.97560541086,
                        "lat": 22.035521645119
                    },
                    {
                        "label": "化州市",
                        "value": "440982",
                        "cityCode": "440900",
                        "provinceCode": "440000",
                        "lon": 110.53959146838,
                        "lat": 21.845482259109
                    },
                    {
                        "label": "信宜市",
                        "value": "440983",
                        "cityCode": "440900",
                        "provinceCode": "440000",
                        "lon": 111.12542886235,
                        "lat": 22.431974274304
                    }
                ]
            },
            {
                "label": "肇庆市",
                "value": "441200",
                "provinceCode": "440000",
                "lon": 112.47965336992,
                "lat": 23.078663282929,
                "children": [
                    {
                        "label": "端州区",
                        "value": "441202",
                        "cityCode": "441200",
                        "provinceCode": "440000",
                        "lon": 112.47779387429,
                        "lat": 23.103323258382
                    },
                    {
                        "label": "鼎湖区",
                        "value": "441203",
                        "cityCode": "441200",
                        "provinceCode": "440000",
                        "lon": 112.62524912783,
                        "lat": 23.208968105809
                    },
                    {
                        "label": "高要区",
                        "value": "441204",
                        "cityCode": "441200",
                        "provinceCode": "440000",
                        "lon": 112.51216619847,
                        "lat": 23.110684686218
                    },
                    {
                        "label": "广宁县",
                        "value": "441223",
                        "cityCode": "441200",
                        "provinceCode": "440000",
                        "lon": 112.44331648004,
                        "lat": 23.677207015329
                    },
                    {
                        "label": "怀集县",
                        "value": "441224",
                        "cityCode": "441200",
                        "provinceCode": "440000",
                        "lon": 112.18024001499,
                        "lat": 23.974272952942
                    },
                    {
                        "label": "封开县",
                        "value": "441225",
                        "cityCode": "441200",
                        "provinceCode": "440000",
                        "lon": 111.72348651223,
                        "lat": 23.561267405148
                    },
                    {
                        "label": "德庆县",
                        "value": "441226",
                        "cityCode": "441200",
                        "provinceCode": "440000",
                        "lon": 111.98726848872,
                        "lat": 23.276366860198
                    },
                    {
                        "label": "四会市",
                        "value": "441284",
                        "cityCode": "441200",
                        "provinceCode": "440000",
                        "lon": 112.68755812366,
                        "lat": 23.431443755334
                    }
                ]
            },
            {
                "label": "惠州市",
                "value": "441300",
                "provinceCode": "440000",
                "lon": 114.41065807997,
                "lat": 23.113539852408,
                "children": [
                    {
                        "label": "惠城区",
                        "value": "441302",
                        "cityCode": "441300",
                        "provinceCode": "440000",
                        "lon": 114.7325947848,
                        "lat": 23.278292790243
                    },
                    {
                        "label": "惠阳区",
                        "value": "441303",
                        "cityCode": "441300",
                        "provinceCode": "440000",
                        "lon": 114.47977020249,
                        "lat": 22.788789691764
                    },
                    {
                        "label": "博罗县",
                        "value": "441322",
                        "cityCode": "441300",
                        "provinceCode": "440000",
                        "lon": 114.28847482844,
                        "lat": 23.352582051478
                    },
                    {
                        "label": "惠东县",
                        "value": "441323",
                        "cityCode": "441300",
                        "provinceCode": "440000",
                        "lon": 114.95551769006,
                        "lat": 23.049117499162
                    },
                    {
                        "label": "龙门县",
                        "value": "441324",
                        "cityCode": "441300",
                        "provinceCode": "440000",
                        "lon": 114.13724281901,
                        "lat": 23.666408023307
                    }
                ]
            },
            {
                "label": "梅州市",
                "value": "441400",
                "provinceCode": "440000",
                "lon": 116.12640309837,
                "lat": 24.304570606031,
                "children": [
                    {
                        "label": "梅江区",
                        "value": "441402",
                        "cityCode": "441400",
                        "provinceCode": "440000",
                        "lon": 116.11595202018,
                        "lat": 24.290750354901
                    },
                    {
                        "label": "梅县区",
                        "value": "441403",
                        "cityCode": "441400",
                        "provinceCode": "440000",
                        "lon": 116.171027251,
                        "lat": 24.3647824353
                    },
                    {
                        "label": "大埔县",
                        "value": "441422",
                        "cityCode": "441400",
                        "provinceCode": "440000",
                        "lon": 116.66412418408,
                        "lat": 24.347933570693
                    },
                    {
                        "label": "丰顺县",
                        "value": "441423",
                        "cityCode": "441400",
                        "provinceCode": "440000",
                        "lon": 116.29139470791,
                        "lat": 23.916084592091
                    },
                    {
                        "label": "五华县",
                        "value": "441424",
                        "cityCode": "441400",
                        "provinceCode": "440000",
                        "lon": 115.64131969769,
                        "lat": 23.802833236552
                    },
                    {
                        "label": "平远县",
                        "value": "441426",
                        "cityCode": "441400",
                        "provinceCode": "440000",
                        "lon": 115.93265634975,
                        "lat": 24.695653660804
                    },
                    {
                        "label": "蕉岭县",
                        "value": "441427",
                        "cityCode": "441400",
                        "provinceCode": "440000",
                        "lon": 116.19614150108,
                        "lat": 24.683283405987
                    },
                    {
                        "label": "兴宁市",
                        "value": "441481",
                        "cityCode": "441400",
                        "provinceCode": "440000",
                        "lon": 115.75329965584,
                        "lat": 24.267311238028
                    }
                ]
            },
            {
                "label": "汕尾市",
                "value": "441500",
                "provinceCode": "440000",
                "lon": 115.3729242894,
                "lat": 22.778730500164,
                "children": [
                    {
                        "label": "城区",
                        "value": "441502",
                        "cityCode": "441500",
                        "provinceCode": "440000",
                        "lon": 115.42435769122,
                        "lat": 22.768710049741
                    },
                    {
                        "label": "海丰县",
                        "value": "441521",
                        "cityCode": "441500",
                        "provinceCode": "440000",
                        "lon": 115.2863223299,
                        "lat": 22.969599520286
                    },
                    {
                        "label": "陆河县",
                        "value": "441523",
                        "cityCode": "441500",
                        "provinceCode": "440000",
                        "lon": 115.62919633367,
                        "lat": 23.284406924899
                    },
                    {
                        "label": "陆丰市",
                        "value": "441581",
                        "cityCode": "441500",
                        "provinceCode": "440000",
                        "lon": 115.78802975191,
                        "lat": 22.967876723873
                    }
                ]
            },
            {
                "label": "河源市",
                "value": "441600",
                "provinceCode": "440000",
                "lon": 114.71372147587,
                "lat": 23.757250850469,
                "children": [
                    {
                        "label": "源城区",
                        "value": "441602",
                        "cityCode": "441600",
                        "provinceCode": "440000",
                        "lon": 114.65448360226,
                        "lat": 23.693604112347
                    },
                    {
                        "label": "紫金县",
                        "value": "441621",
                        "cityCode": "441600",
                        "provinceCode": "440000",
                        "lon": 115.06447099781,
                        "lat": 23.525442374357
                    },
                    {
                        "label": "龙川县",
                        "value": "441622",
                        "cityCode": "441600",
                        "provinceCode": "440000",
                        "lon": 115.36229172074,
                        "lat": 24.334679775761
                    },
                    {
                        "label": "连平县",
                        "value": "441623",
                        "cityCode": "441600",
                        "provinceCode": "440000",
                        "lon": 114.54297659273,
                        "lat": 24.340566290031
                    },
                    {
                        "label": "和平县",
                        "value": "441624",
                        "cityCode": "441600",
                        "provinceCode": "440000",
                        "lon": 115.01181507521,
                        "lat": 24.45211039106
                    },
                    {
                        "label": "东源县",
                        "value": "441625",
                        "cityCode": "441600",
                        "provinceCode": "440000",
                        "lon": 114.82694608538,
                        "lat": 23.933052556598
                    }
                ]
            },
            {
                "label": "阳江市",
                "value": "441700",
                "provinceCode": "440000",
                "lon": 111.97700975587,
                "lat": 21.871517304519,
                "children": [
                    {
                        "label": "江城区",
                        "value": "441702",
                        "cityCode": "441700",
                        "provinceCode": "440000",
                        "lon": 111.93003574135,
                        "lat": 21.762803637074
                    },
                    {
                        "label": "阳东区",
                        "value": "441704",
                        "cityCode": "441700",
                        "provinceCode": "440000",
                        "lon": 112.04622577462,
                        "lat": 21.90761038558
                    },
                    {
                        "label": "阳西县",
                        "value": "441721",
                        "cityCode": "441700",
                        "provinceCode": "440000",
                        "lon": 111.60050919755,
                        "lat": 21.720609599412
                    },
                    {
                        "label": "阳春市",
                        "value": "441781",
                        "cityCode": "441700",
                        "provinceCode": "440000",
                        "lon": 111.69444876956,
                        "lat": 22.223897927949
                    }
                ]
            },
            {
                "label": "清远市",
                "value": "441800",
                "provinceCode": "440000",
                "lon": 113.04077334891,
                "lat": 23.698468550422,
                "children": [
                    {
                        "label": "清城区",
                        "value": "441802",
                        "cityCode": "441800",
                        "provinceCode": "440000",
                        "lon": 113.11458528252,
                        "lat": 23.62585596526
                    },
                    {
                        "label": "清新区",
                        "value": "441803",
                        "cityCode": "441800",
                        "provinceCode": "440000",
                        "lon": 112.94889933526,
                        "lat": 23.932290452567
                    },
                    {
                        "label": "佛冈县",
                        "value": "441821",
                        "cityCode": "441800",
                        "provinceCode": "440000",
                        "lon": 113.56668917499,
                        "lat": 23.881077228129
                    },
                    {
                        "label": "阳山县",
                        "value": "441823",
                        "cityCode": "441800",
                        "provinceCode": "440000",
                        "lon": 112.68133014518,
                        "lat": 24.509485552315
                    },
                    {
                        "label": "连山壮族瑶族自治县",
                        "value": "441825",
                        "cityCode": "441800",
                        "provinceCode": "440000",
                        "lon": 112.10080575295,
                        "lat": 24.515164969495
                    },
                    {
                        "label": "连南瑶族自治县",
                        "value": "441826",
                        "cityCode": "441800",
                        "provinceCode": "440000",
                        "lon": 112.26364236788,
                        "lat": 24.574155992653
                    },
                    {
                        "label": "英德市",
                        "value": "441881",
                        "cityCode": "441800",
                        "provinceCode": "440000",
                        "lon": 113.32316898492,
                        "lat": 24.225680391225
                    },
                    {
                        "label": "连州市",
                        "value": "441882",
                        "cityCode": "441800",
                        "provinceCode": "440000",
                        "lon": 112.45918890578,
                        "lat": 24.937020846031
                    }
                ]
            },
            {
                "label": "东莞市",
                "value": "441900",
                "provinceCode": "440000",
                "lon": 113.76343399076,
                "lat": 23.043023815368,
                "children": [
                    {
                        "label": "东莞市",
                        "value": "441900",
                        "cityCode": "441900",
                        "provinceCode": "440000",
                        "lon": 113.76343399076,
                        "lat": 23.043023815368
                    }
                ]
            },
            {
                "label": "中山市",
                "value": "442000",
                "provinceCode": "440000",
                "lon": 113.4220600208,
                "lat": 22.545177514513,
                "children": [
                    {
                        "label": "中山市",
                        "value": "442000",
                        "cityCode": "442000",
                        "provinceCode": "440000",
                        "lon": 113.4220600208,
                        "lat": 22.545177514513
                    }
                ]
            },
            {
                "label": "潮州市",
                "value": "445100",
                "provinceCode": "440000",
                "lon": 116.63007599086,
                "lat": 23.661811676517,
                "children": [
                    {
                        "label": "湘桥区",
                        "value": "445102",
                        "cityCode": "445100",
                        "provinceCode": "440000",
                        "lon": 116.67789952964,
                        "lat": 23.700043577114
                    },
                    {
                        "label": "潮安区",
                        "value": "445103",
                        "cityCode": "445100",
                        "provinceCode": "440000",
                        "lon": 116.60876927831,
                        "lat": 23.717386141778
                    },
                    {
                        "label": "饶平县",
                        "value": "445122",
                        "cityCode": "445100",
                        "provinceCode": "440000",
                        "lon": 116.90612266997,
                        "lat": 23.865029718048
                    }
                ]
            },
            {
                "label": "揭阳市",
                "value": "445200",
                "provinceCode": "440000",
                "lon": 116.37950085538,
                "lat": 23.547999466926,
                "children": [
                    {
                        "label": "榕城区",
                        "value": "445202",
                        "cityCode": "445200",
                        "provinceCode": "440000",
                        "lon": 116.3692235802,
                        "lat": 23.529452754199
                    },
                    {
                        "label": "揭东区",
                        "value": "445203",
                        "cityCode": "445200",
                        "provinceCode": "440000",
                        "lon": 116.37807073325,
                        "lat": 23.585024810833
                    },
                    {
                        "label": "揭西县",
                        "value": "445222",
                        "cityCode": "445200",
                        "provinceCode": "440000",
                        "lon": 115.91682503049,
                        "lat": 23.494712399671
                    },
                    {
                        "label": "惠来县",
                        "value": "445224",
                        "cityCode": "445200",
                        "provinceCode": "440000",
                        "lon": 116.2247989034,
                        "lat": 23.034046544147
                    },
                    {
                        "label": "普宁市",
                        "value": "445281",
                        "cityCode": "445200",
                        "provinceCode": "440000",
                        "lon": 116.07816590835,
                        "lat": 23.288953583142
                    }
                ]
            },
            {
                "label": "云浮市",
                "value": "445300",
                "provinceCode": "440000",
                "lon": 112.05094595865,
                "lat": 22.937975685537,
                "children": [
                    {
                        "label": "云城区",
                        "value": "445302",
                        "cityCode": "445300",
                        "provinceCode": "440000",
                        "lon": 112.17160356227,
                        "lat": 22.973002378136
                    },
                    {
                        "label": "云安区",
                        "value": "445303",
                        "cityCode": "445300",
                        "provinceCode": "440000",
                        "lon": 111.96143088808,
                        "lat": 22.856466364893
                    },
                    {
                        "label": "新兴县",
                        "value": "445321",
                        "cityCode": "445300",
                        "provinceCode": "440000",
                        "lon": 112.21754109744,
                        "lat": 22.626992446128
                    },
                    {
                        "label": "郁南县",
                        "value": "445322",
                        "cityCode": "445300",
                        "provinceCode": "440000",
                        "lon": 111.61993760725,
                        "lat": 23.043633197681
                    },
                    {
                        "label": "罗定市",
                        "value": "445381",
                        "cityCode": "445300",
                        "provinceCode": "440000",
                        "lon": 111.49324209266,
                        "lat": 22.690983986437
                    }
                ]
            }
        ],
        "label": "广东省",
        "value": "440000"
    },
    {
        "country": "china",
        "lon": 108.92427442706,
        "lat": 23.552254688119,
        "children": [
            {
                "label": "南宁市",
                "value": "450100",
                "provinceCode": "450000",
                "lon": 108.29723355587,
                "lat": 22.806492935603,
                "children": [
                    {
                        "label": "兴宁区",
                        "value": "450102",
                        "cityCode": "450100",
                        "provinceCode": "450000",
                        "lon": 108.41762068739,
                        "lat": 22.924530825243
                    },
                    {
                        "label": "青秀区",
                        "value": "450103",
                        "cityCode": "450100",
                        "provinceCode": "450000",
                        "lon": 108.54167973252,
                        "lat": 22.829217973591
                    },
                    {
                        "label": "江南区",
                        "value": "450105",
                        "cityCode": "450100",
                        "provinceCode": "450000",
                        "lon": 108.13559066584,
                        "lat": 22.663806639444
                    },
                    {
                        "label": "西乡塘区",
                        "value": "450107",
                        "cityCode": "450100",
                        "provinceCode": "450000",
                        "lon": 108.21544203073,
                        "lat": 22.912937296114
                    },
                    {
                        "label": "良庆区",
                        "value": "450108",
                        "cityCode": "450100",
                        "provinceCode": "450000",
                        "lon": 108.37044913796,
                        "lat": 22.498910081219
                    },
                    {
                        "label": "邕宁区",
                        "value": "450109",
                        "cityCode": "450100",
                        "provinceCode": "450000",
                        "lon": 108.62620569962,
                        "lat": 22.595811549706
                    },
                    {
                        "label": "武鸣区",
                        "value": "450110",
                        "cityCode": "450100",
                        "provinceCode": "450000",
                        "lon": 108.23369489981,
                        "lat": 23.233267218289
                    },
                    {
                        "label": "隆安县",
                        "value": "450123",
                        "cityCode": "450100",
                        "provinceCode": "450000",
                        "lon": 107.69066557406,
                        "lat": 23.110227709531
                    },
                    {
                        "label": "马山县",
                        "value": "450124",
                        "cityCode": "450100",
                        "provinceCode": "450000",
                        "lon": 108.1696043635,
                        "lat": 23.664942974082
                    },
                    {
                        "label": "上林县",
                        "value": "450125",
                        "cityCode": "450100",
                        "provinceCode": "450000",
                        "lon": 108.64581538209,
                        "lat": 23.521730154673
                    },
                    {
                        "label": "宾阳县",
                        "value": "450126",
                        "cityCode": "450100",
                        "provinceCode": "450000",
                        "lon": 108.94049469657,
                        "lat": 23.168344342302
                    },
                    {
                        "label": "横县",
                        "value": "450127",
                        "cityCode": "450100",
                        "provinceCode": "450000",
                        "lon": 109.16892656267,
                        "lat": 22.774919317685
                    }
                ]
            },
            {
                "label": "柳州市",
                "value": "450200",
                "provinceCode": "450000",
                "lon": 109.42240181015,
                "lat": 24.329053352467,
                "children": [
                    {
                        "label": "城中区",
                        "value": "450202",
                        "cityCode": "450200",
                        "provinceCode": "450000",
                        "lon": 109.48318080161,
                        "lat": 24.371128485733
                    },
                    {
                        "label": "鱼峰区",
                        "value": "450203",
                        "cityCode": "450200",
                        "provinceCode": "450000",
                        "lon": 109.45632703637,
                        "lat": 24.275815550781
                    },
                    {
                        "label": "柳南区",
                        "value": "450204",
                        "cityCode": "450200",
                        "provinceCode": "450000",
                        "lon": 109.34346581857,
                        "lat": 24.306183897363
                    },
                    {
                        "label": "柳北区",
                        "value": "450205",
                        "cityCode": "450200",
                        "provinceCode": "450000",
                        "lon": 109.41391452987,
                        "lat": 24.471742756535
                    },
                    {
                        "label": "柳江区",
                        "value": "450206",
                        "cityCode": "450200",
                        "provinceCode": "450000",
                        "lon": 109.33837797157,
                        "lat": 24.21578019619
                    },
                    {
                        "label": "柳城县",
                        "value": "450222",
                        "cityCode": "450200",
                        "provinceCode": "450000",
                        "lon": 109.23019655363,
                        "lat": 24.62988200842
                    },
                    {
                        "label": "鹿寨县",
                        "value": "450223",
                        "cityCode": "450200",
                        "provinceCode": "450000",
                        "lon": 109.80281600679,
                        "lat": 24.532198388889
                    },
                    {
                        "label": "融安县",
                        "value": "450224",
                        "cityCode": "450200",
                        "provinceCode": "450000",
                        "lon": 109.51401020724,
                        "lat": 25.139782632024
                    },
                    {
                        "label": "融水苗族自治县",
                        "value": "450225",
                        "cityCode": "450200",
                        "provinceCode": "450000",
                        "lon": 109.05786347353,
                        "lat": 25.343698638547
                    },
                    {
                        "label": "三江侗族自治县",
                        "value": "450226",
                        "cityCode": "450200",
                        "provinceCode": "450000",
                        "lon": 109.5100810614,
                        "lat": 25.74756560612
                    }
                ]
            },
            {
                "label": "桂林市",
                "value": "450300",
                "provinceCode": "450000",
                "lon": 110.26092014748,
                "lat": 25.262901245955,
                "children": [
                    {
                        "label": "秀峰区",
                        "value": "450302",
                        "cityCode": "450300",
                        "provinceCode": "450000",
                        "lon": 110.27454852003,
                        "lat": 25.287138490985
                    },
                    {
                        "label": "叠彩区",
                        "value": "450303",
                        "cityCode": "450300",
                        "provinceCode": "450000",
                        "lon": 110.336225817,
                        "lat": 25.318874237568
                    },
                    {
                        "label": "象山区",
                        "value": "450304",
                        "cityCode": "450300",
                        "provinceCode": "450000",
                        "lon": 110.28460774513,
                        "lat": 25.215755465426
                    },
                    {
                        "label": "七星区",
                        "value": "450305",
                        "cityCode": "450300",
                        "provinceCode": "450000",
                        "lon": 110.35658833681,
                        "lat": 25.264669861823
                    },
                    {
                        "label": "雁山区",
                        "value": "450311",
                        "cityCode": "450300",
                        "provinceCode": "450000",
                        "lon": 110.37148547606,
                        "lat": 25.112805740761
                    },
                    {
                        "label": "临桂区",
                        "value": "450312",
                        "cityCode": "450300",
                        "provinceCode": "450000",
                        "lon": 110.05831249425,
                        "lat": 25.266798702759
                    },
                    {
                        "label": "阳朔县",
                        "value": "450321",
                        "cityCode": "450300",
                        "provinceCode": "450000",
                        "lon": 110.48292929478,
                        "lat": 24.857282289724
                    },
                    {
                        "label": "灵川县",
                        "value": "450323",
                        "cityCode": "450300",
                        "provinceCode": "450000",
                        "lon": 110.41812911351,
                        "lat": 25.381008804927
                    },
                    {
                        "label": "全州县",
                        "value": "450324",
                        "cityCode": "450300",
                        "provinceCode": "450000",
                        "lon": 111.02643476452,
                        "lat": 25.936464773168
                    },
                    {
                        "label": "兴安县",
                        "value": "450325",
                        "cityCode": "450300",
                        "provinceCode": "450000",
                        "lon": 110.60102057414,
                        "lat": 25.6070310342
                    },
                    {
                        "label": "永福县",
                        "value": "450326",
                        "cityCode": "450300",
                        "provinceCode": "450000",
                        "lon": 109.91693042182,
                        "lat": 24.997329894857
                    },
                    {
                        "label": "灌阳县",
                        "value": "450327",
                        "cityCode": "450300",
                        "provinceCode": "450000",
                        "lon": 111.0777084233,
                        "lat": 25.458880833514
                    },
                    {
                        "label": "龙胜各族自治县",
                        "value": "450328",
                        "cityCode": "450300",
                        "provinceCode": "450000",
                        "lon": 110.0102504878,
                        "lat": 25.868327982022
                    },
                    {
                        "label": "资源县",
                        "value": "450329",
                        "cityCode": "450300",
                        "provinceCode": "450000",
                        "lon": 110.59842700994,
                        "lat": 26.067857197159
                    },
                    {
                        "label": "平乐县",
                        "value": "450330",
                        "cityCode": "450300",
                        "provinceCode": "450000",
                        "lon": 110.79768988938,
                        "lat": 24.558919773879
                    },
                    {
                        "label": "恭城瑶族自治县",
                        "value": "450332",
                        "cityCode": "450300",
                        "provinceCode": "450000",
                        "lon": 110.90944732333,
                        "lat": 24.949325584117
                    }
                ]
            },
            {
                "label": "梧州市",
                "value": "450400",
                "provinceCode": "450000",
                "lon": 111.30547195007,
                "lat": 23.485394636734,
                "children": [
                    {
                        "label": "万秀区",
                        "value": "450403",
                        "cityCode": "450400",
                        "provinceCode": "450000",
                        "lon": 111.42162608637,
                        "lat": 23.563455294046
                    },
                    {
                        "label": "长洲区",
                        "value": "450405",
                        "cityCode": "450400",
                        "provinceCode": "450000",
                        "lon": 111.1899141988,
                        "lat": 23.560200006306
                    },
                    {
                        "label": "龙圩区",
                        "value": "450406",
                        "cityCode": "450400",
                        "provinceCode": "450000",
                        "lon": 111.32167060016,
                        "lat": 23.205423202289
                    },
                    {
                        "label": "苍梧县",
                        "value": "450421",
                        "cityCode": "450400",
                        "provinceCode": "450000",
                        "lon": 111.29835212828,
                        "lat": 23.626737954219
                    },
                    {
                        "label": "藤县",
                        "value": "450422",
                        "cityCode": "450400",
                        "provinceCode": "450000",
                        "lon": 110.77883787789,
                        "lat": 23.510902782468
                    },
                    {
                        "label": "蒙山县",
                        "value": "450423",
                        "cityCode": "450400",
                        "provinceCode": "450000",
                        "lon": 110.56122298515,
                        "lat": 24.133850543878
                    },
                    {
                        "label": "岑溪市",
                        "value": "450481",
                        "cityCode": "450400",
                        "provinceCode": "450000",
                        "lon": 111.02872021172,
                        "lat": 22.925290987321
                    }
                ]
            },
            {
                "label": "北海市",
                "value": "450500",
                "provinceCode": "450000",
                "lon": 109.12262791919,
                "lat": 21.47271823501,
                "children": [
                    {
                        "label": "海城区",
                        "value": "450502",
                        "cityCode": "450500",
                        "provinceCode": "450000",
                        "lon": 109.16534360381,
                        "lat": 21.518620780285
                    },
                    {
                        "label": "银海区",
                        "value": "450503",
                        "cityCode": "450500",
                        "provinceCode": "450000",
                        "lon": 109.2515908141,
                        "lat": 21.48972262057
                    },
                    {
                        "label": "铁山港区",
                        "value": "450512",
                        "cityCode": "450500",
                        "provinceCode": "450000",
                        "lon": 109.42248930511,
                        "lat": 21.574915371765
                    },
                    {
                        "label": "合浦县",
                        "value": "450521",
                        "cityCode": "450500",
                        "provinceCode": "450000",
                        "lon": 109.33539345631,
                        "lat": 21.740444343774
                    }
                ]
            },
            {
                "label": "防城港市",
                "value": "450600",
                "provinceCode": "450000",
                "lon": 108.35179115286,
                "lat": 21.617398470472,
                "children": [
                    {
                        "label": "港口区",
                        "value": "450602",
                        "cityCode": "450600",
                        "provinceCode": "450000",
                        "lon": 108.44916612265,
                        "lat": 21.662035674238
                    },
                    {
                        "label": "防城区",
                        "value": "450603",
                        "cityCode": "450600",
                        "provinceCode": "450000",
                        "lon": 108.02974018357,
                        "lat": 21.764841822261
                    },
                    {
                        "label": "上思县",
                        "value": "450621",
                        "cityCode": "450600",
                        "provinceCode": "450000",
                        "lon": 107.90234352919,
                        "lat": 22.053625294887
                    },
                    {
                        "label": "东兴市",
                        "value": "450681",
                        "cityCode": "450600",
                        "provinceCode": "450000",
                        "lon": 108.0610807332,
                        "lat": 21.627169839712
                    }
                ]
            },
            {
                "label": "钦州市",
                "value": "450700",
                "provinceCode": "450000",
                "lon": 108.63879805642,
                "lat": 21.973350465313,
                "children": [
                    {
                        "label": "钦南区",
                        "value": "450702",
                        "cityCode": "450700",
                        "provinceCode": "450000",
                        "lon": 108.8165239388,
                        "lat": 21.89668072285
                    },
                    {
                        "label": "钦北区",
                        "value": "450703",
                        "cityCode": "450700",
                        "provinceCode": "450000",
                        "lon": 108.52867631111,
                        "lat": 22.171133309191
                    },
                    {
                        "label": "灵山县",
                        "value": "450721",
                        "cityCode": "450700",
                        "provinceCode": "450000",
                        "lon": 109.14774755818,
                        "lat": 22.315715686267
                    },
                    {
                        "label": "浦北县",
                        "value": "450722",
                        "cityCode": "450700",
                        "provinceCode": "450000",
                        "lon": 109.54236668008,
                        "lat": 22.271304072712
                    }
                ]
            },
            {
                "label": "贵港市",
                "value": "450800",
                "provinceCode": "450000",
                "lon": 109.61370755658,
                "lat": 23.103373164409,
                "children": [
                    {
                        "label": "港北区",
                        "value": "450802",
                        "cityCode": "450800",
                        "provinceCode": "450000",
                        "lon": 109.68955750941,
                        "lat": 23.244654866397
                    },
                    {
                        "label": "港南区",
                        "value": "450803",
                        "cityCode": "450800",
                        "provinceCode": "450000",
                        "lon": 109.7098514885,
                        "lat": 22.87475110083
                    },
                    {
                        "label": "覃塘区",
                        "value": "450804",
                        "cityCode": "450800",
                        "provinceCode": "450000",
                        "lon": 109.4013360968,
                        "lat": 23.147899675106
                    },
                    {
                        "label": "平南县",
                        "value": "450821",
                        "cityCode": "450800",
                        "provinceCode": "450000",
                        "lon": 110.41260119285,
                        "lat": 23.538682883685
                    },
                    {
                        "label": "桂平市",
                        "value": "450881",
                        "cityCode": "450800",
                        "provinceCode": "450000",
                        "lon": 110.08711890997,
                        "lat": 23.3332806173
                    }
                ]
            },
            {
                "label": "玉林市",
                "value": "450900",
                "provinceCode": "450000",
                "lon": 110.15167631614,
                "lat": 22.643973608377,
                "children": [
                    {
                        "label": "玉州区",
                        "value": "450902",
                        "cityCode": "450900",
                        "provinceCode": "450000",
                        "lon": 110.0645342655,
                        "lat": 22.557212692568
                    },
                    {
                        "label": "福绵区",
                        "value": "450903",
                        "cityCode": "450900",
                        "provinceCode": "450000",
                        "lon": 109.99939646175,
                        "lat": 22.485121229661
                    },
                    {
                        "label": "容县",
                        "value": "450921",
                        "cityCode": "450900",
                        "provinceCode": "450000",
                        "lon": 110.61027737584,
                        "lat": 22.831614121088
                    },
                    {
                        "label": "陆川县",
                        "value": "450922",
                        "cityCode": "450900",
                        "provinceCode": "450000",
                        "lon": 110.27211293424,
                        "lat": 22.251747037814
                    },
                    {
                        "label": "博白县",
                        "value": "450923",
                        "cityCode": "450900",
                        "provinceCode": "450000",
                        "lon": 109.87890451509,
                        "lat": 22.066766171087
                    },
                    {
                        "label": "兴业县",
                        "value": "450924",
                        "cityCode": "450900",
                        "provinceCode": "450000",
                        "lon": 109.92861094693,
                        "lat": 22.798461756462
                    },
                    {
                        "label": "北流市",
                        "value": "450981",
                        "cityCode": "450900",
                        "provinceCode": "450000",
                        "lon": 110.46705456426,
                        "lat": 22.528890370522
                    }
                ]
            },
            {
                "label": "百色市",
                "value": "451000",
                "provinceCode": "450000",
                "lon": 106.63182140365,
                "lat": 23.90151236791,
                "children": [
                    {
                        "label": "右江区",
                        "value": "451002",
                        "cityCode": "451000",
                        "provinceCode": "450000",
                        "lon": 106.50559640624,
                        "lat": 23.941865593712
                    },
                    {
                        "label": "田东县",
                        "value": "451022",
                        "cityCode": "451000",
                        "provinceCode": "450000",
                        "lon": 107.19163711741,
                        "lat": 23.614585367817
                    },
                    {
                        "label": "平果县",
                        "value": "451023",
                        "cityCode": "451000",
                        "provinceCode": "450000",
                        "lon": 107.57751209903,
                        "lat": 23.540954424157
                    },
                    {
                        "label": "德保县",
                        "value": "451024",
                        "cityCode": "451000",
                        "provinceCode": "450000",
                        "lon": 106.59428466728,
                        "lat": 23.382214509826
                    },
                    {
                        "label": "那坡县",
                        "value": "451026",
                        "cityCode": "451000",
                        "provinceCode": "450000",
                        "lon": 105.8347049622,
                        "lat": 23.247545560208
                    },
                    {
                        "label": "凌云县",
                        "value": "451027",
                        "cityCode": "451000",
                        "provinceCode": "450000",
                        "lon": 106.64837922239,
                        "lat": 24.363726145418
                    },
                    {
                        "label": "乐业县",
                        "value": "451028",
                        "cityCode": "451000",
                        "provinceCode": "450000",
                        "lon": 106.5178987429,
                        "lat": 24.829664240385
                    },
                    {
                        "label": "田林县",
                        "value": "451029",
                        "cityCode": "451000",
                        "provinceCode": "450000",
                        "lon": 105.99982724993,
                        "lat": 24.392538479127
                    },
                    {
                        "label": "西林县",
                        "value": "451030",
                        "cityCode": "451000",
                        "provinceCode": "450000",
                        "lon": 105.09732745516,
                        "lat": 24.391377583083
                    },
                    {
                        "label": "隆林各族自治县",
                        "value": "451031",
                        "cityCode": "451000",
                        "provinceCode": "450000",
                        "lon": 105.30321343556,
                        "lat": 24.680432837057
                    },
                    {
                        "label": "靖西市",
                        "value": "451081",
                        "cityCode": "451000",
                        "provinceCode": "450000",
                        "lon": 106.38310874744,
                        "lat": 23.221036271428
                    }
                ]
            },
            {
                "label": "贺州市",
                "value": "451100",
                "provinceCode": "450000",
                "lon": 111.55259417884,
                "lat": 24.411053547113,
                "children": [
                    {
                        "label": "八步区",
                        "value": "451102",
                        "cityCode": "451100",
                        "provinceCode": "450000",
                        "lon": 111.68835191834,
                        "lat": 24.309335821524
                    },
                    {
                        "label": "平桂区",
                        "value": "451103",
                        "cityCode": "451100",
                        "provinceCode": "450000",
                        "lon": 111.4583206726,
                        "lat": 24.272024331072
                    },
                    {
                        "label": "昭平县",
                        "value": "451121",
                        "cityCode": "451100",
                        "provinceCode": "450000",
                        "lon": 110.97690768696,
                        "lat": 24.108072861819
                    },
                    {
                        "label": "钟山县",
                        "value": "451122",
                        "cityCode": "451100",
                        "provinceCode": "450000",
                        "lon": 111.24883282187,
                        "lat": 24.513864981375
                    },
                    {
                        "label": "富川瑶族自治县",
                        "value": "451123",
                        "cityCode": "451100",
                        "provinceCode": "450000",
                        "lon": 111.31324328294,
                        "lat": 24.891613643714
                    }
                ]
            },
            {
                "label": "河池市",
                "value": "451200",
                "provinceCode": "450000",
                "lon": 108.06994770937,
                "lat": 24.699520782873,
                "children": [
                    {
                        "label": "金城江区",
                        "value": "451202",
                        "cityCode": "451200",
                        "provinceCode": "450000",
                        "lon": 107.87344356952,
                        "lat": 24.660762069433
                    },
                    {
                        "label": "南丹县",
                        "value": "451221",
                        "cityCode": "451200",
                        "provinceCode": "450000",
                        "lon": 107.46800068753,
                        "lat": 25.11943883054
                    },
                    {
                        "label": "天峨县",
                        "value": "451222",
                        "cityCode": "451200",
                        "provinceCode": "450000",
                        "lon": 106.99659443884,
                        "lat": 25.01883375149
                    },
                    {
                        "label": "凤山县",
                        "value": "451223",
                        "cityCode": "451200",
                        "provinceCode": "450000",
                        "lon": 107.01971572195,
                        "lat": 24.560064974996
                    },
                    {
                        "label": "东兰县",
                        "value": "451224",
                        "cityCode": "451200",
                        "provinceCode": "450000",
                        "lon": 107.41353376084,
                        "lat": 24.511600489222
                    },
                    {
                        "label": "罗城仫佬族自治县",
                        "value": "451225",
                        "cityCode": "451200",
                        "provinceCode": "450000",
                        "lon": 108.82719124199,
                        "lat": 24.904567511665
                    },
                    {
                        "label": "环江毛南族自治县",
                        "value": "451226",
                        "cityCode": "451200",
                        "provinceCode": "450000",
                        "lon": 108.29198518646,
                        "lat": 25.104531056442
                    },
                    {
                        "label": "巴马瑶族自治县",
                        "value": "451227",
                        "cityCode": "451200",
                        "provinceCode": "450000",
                        "lon": 107.20766596976,
                        "lat": 24.157595548736
                    },
                    {
                        "label": "都安瑶族自治县",
                        "value": "451228",
                        "cityCode": "451200",
                        "provinceCode": "450000",
                        "lon": 108.11806068056,
                        "lat": 24.169778074597
                    },
                    {
                        "label": "大化瑶族自治县",
                        "value": "451229",
                        "cityCode": "451200",
                        "provinceCode": "450000",
                        "lon": 107.71195932144,
                        "lat": 23.970744702117
                    }
                ]
            },
            {
                "label": "来宾市",
                "value": "451300",
                "provinceCode": "450000",
                "lon": 109.23181650474,
                "lat": 23.741165926515,
                "children": [
                    {
                        "label": "兴宾区",
                        "value": "451302",
                        "cityCode": "451300",
                        "provinceCode": "450000",
                        "lon": 109.19320522678,
                        "lat": 23.664270771977
                    },
                    {
                        "label": "忻城县",
                        "value": "451321",
                        "cityCode": "451300",
                        "provinceCode": "450000",
                        "lon": 108.75231859732,
                        "lat": 24.018747261796
                    },
                    {
                        "label": "象州县",
                        "value": "451322",
                        "cityCode": "451300",
                        "provinceCode": "450000",
                        "lon": 109.77196784577,
                        "lat": 24.019170132851
                    },
                    {
                        "label": "武宣县",
                        "value": "451323",
                        "cityCode": "451300",
                        "provinceCode": "450000",
                        "lon": 109.68768015891,
                        "lat": 23.61072110732
                    },
                    {
                        "label": "金秀瑶族自治县",
                        "value": "451324",
                        "cityCode": "451300",
                        "provinceCode": "450000",
                        "lon": 110.13777637174,
                        "lat": 24.089876611192
                    },
                    {
                        "label": "合山市",
                        "value": "451381",
                        "cityCode": "451300",
                        "provinceCode": "450000",
                        "lon": 108.94253993058,
                        "lat": 23.802816135427
                    }
                ]
            },
            {
                "label": "崇左市",
                "value": "451400",
                "provinceCode": "450000",
                "lon": 107.35732203837,
                "lat": 22.415455296546,
                "children": [
                    {
                        "label": "江州区",
                        "value": "451402",
                        "cityCode": "451400",
                        "provinceCode": "450000",
                        "lon": 107.46135714079,
                        "lat": 22.529826577387
                    },
                    {
                        "label": "扶绥县",
                        "value": "451421",
                        "cityCode": "451400",
                        "provinceCode": "450000",
                        "lon": 107.82912504554,
                        "lat": 22.524058231311
                    },
                    {
                        "label": "宁明县",
                        "value": "451422",
                        "cityCode": "451400",
                        "provinceCode": "450000",
                        "lon": 107.29465888577,
                        "lat": 22.005062342039
                    },
                    {
                        "label": "龙州县",
                        "value": "451423",
                        "cityCode": "451400",
                        "provinceCode": "450000",
                        "lon": 106.85853904762,
                        "lat": 22.431578425316
                    },
                    {
                        "label": "大新县",
                        "value": "451424",
                        "cityCode": "451400",
                        "provinceCode": "450000",
                        "lon": 107.13710947577,
                        "lat": 22.813462764842
                    },
                    {
                        "label": "天等县",
                        "value": "451425",
                        "cityCode": "451400",
                        "provinceCode": "450000",
                        "lon": 107.08133912276,
                        "lat": 23.117161246424
                    },
                    {
                        "label": "凭祥市",
                        "value": "451481",
                        "cityCode": "451400",
                        "provinceCode": "450000",
                        "lon": 106.83705317757,
                        "lat": 22.093647276973
                    }
                ]
            }
        ],
        "label": "广西壮族自治区",
        "value": "450000"
    },
    {
        "country": "china",
        "lon": 109.73375548794,
        "lat": 19.180500801261,
        "children": [
            {
                "label": "海口市",
                "value": "460100",
                "provinceCode": "460000",
                "lon": 110.33080184834,
                "lat": 20.022071276952,
                "children": [
                    {
                        "label": "秀英区",
                        "value": "460105",
                        "cityCode": "460100",
                        "provinceCode": "460000",
                        "lon": 110.26320040619,
                        "lat": 19.884344360797
                    },
                    {
                        "label": "龙华区",
                        "value": "460106",
                        "cityCode": "460100",
                        "provinceCode": "460000",
                        "lon": 110.33522411653,
                        "lat": 19.905350664019
                    },
                    {
                        "label": "琼山区",
                        "value": "460107",
                        "cityCode": "460100",
                        "provinceCode": "460000",
                        "lon": 110.48011046473,
                        "lat": 19.741333613805
                    },
                    {
                        "label": "美兰区",
                        "value": "460108",
                        "cityCode": "460100",
                        "provinceCode": "460000",
                        "lon": 110.50726929452,
                        "lat": 19.942908977934
                    }
                ]
            },
            {
                "label": "三亚市",
                "value": "460200",
                "provinceCode": "460000",
                "lon": 109.52277128136,
                "lat": 18.257775914897,
                "children": [
                    {
                        "label": "海棠区",
                        "value": "460202",
                        "cityCode": "460200",
                        "provinceCode": "460000",
                        "lon": 109.73605457423,
                        "lat": 18.38141790489
                    },
                    {
                        "label": "吉阳区",
                        "value": "460203",
                        "cityCode": "460200",
                        "provinceCode": "460000",
                        "lon": 109.57378482237,
                        "lat": 18.266590591978
                    },
                    {
                        "label": "天涯区",
                        "value": "460204",
                        "cityCode": "460200",
                        "provinceCode": "460000",
                        "lon": 109.38879057584,
                        "lat": 18.395908258064
                    },
                    {
                        "label": "崖州区",
                        "value": "460205",
                        "cityCode": "460200",
                        "provinceCode": "460000",
                        "lon": 109.18636245975,
                        "lat": 18.448774794407
                    }
                ]
            },
            {
                "label": "三沙市",
                "value": "460300",
                "provinceCode": "460000",
                "lon": 113.75535610385,
                "lat": 12.464712920653,
                "children": [
                    {
                        "label": "西沙群岛",
                        "value": "460321",
                        "cityCode": "460300",
                        "provinceCode": "460000",
                        "lon": 111.67308686126,
                        "lat": 16.497085431044
                    },
                    {
                        "label": "南沙群岛",
                        "value": "460322",
                        "cityCode": "460300",
                        "provinceCode": "460000",
                        "lon": 112.66030170907,
                        "lat": 4.9743661921368
                    },
                    {
                        "label": "中沙群岛的岛礁及其海域",
                        "value": "460323",
                        "cityCode": "460300",
                        "provinceCode": "460000",
                        "lon": 113.75535610385,
                        "lat": 12.464712920653
                    }
                ]
            },
            {
                "label": "儋州市",
                "value": "460400",
                "provinceCode": "460000",
                "lon": 109.33458619886,
                "lat": 19.574787798597,
                "children": [
                    {
                        "label": "儋州市",
                        "value": "460400",
                        "cityCode": "460400",
                        "provinceCode": "460000",
                        "lon": 109.33458619886,
                        "lat": 19.574787798597
                    }
                ]
            },
            {
                "label": "省直辖县级行政区划",
                "value": "469000",
                "provinceCode": "460000",
                "lon": 109.73375548794,
                "lat": 19.180500801261,
                "children": [
                    {
                        "label": "五指山市",
                        "value": "469001",
                        "cityCode": "469000",
                        "provinceCode": "460000",
                        "lon": 109.51775006369,
                        "lat": 18.831305749013
                    },
                    {
                        "label": "琼海市",
                        "value": "469002",
                        "cityCode": "469000",
                        "provinceCode": "460000",
                        "lon": 110.41435935151,
                        "lat": 19.214830368617
                    },
                    {
                        "label": "文昌市",
                        "value": "469005",
                        "cityCode": "469000",
                        "provinceCode": "460000",
                        "lon": 110.78090944499,
                        "lat": 19.750947380145
                    },
                    {
                        "label": "万宁市",
                        "value": "469006",
                        "cityCode": "469000",
                        "provinceCode": "460000",
                        "lon": 110.29250485724,
                        "lat": 18.839885909177
                    },
                    {
                        "label": "东方市",
                        "value": "469007",
                        "cityCode": "469000",
                        "provinceCode": "460000",
                        "lon": 108.85100963157,
                        "lat": 18.998160861218
                    },
                    {
                        "label": "定安县",
                        "value": "469021",
                        "cityCode": "469000",
                        "provinceCode": "460000",
                        "lon": 110.20642407813,
                        "lat": 20.050057124473
                    },
                    {
                        "label": "屯昌县",
                        "value": "469022",
                        "cityCode": "469000",
                        "provinceCode": "460000",
                        "lon": 110.06336404474,
                        "lat": 19.347749127852
                    },
                    {
                        "label": "澄迈县",
                        "value": "469023",
                        "cityCode": "469000",
                        "provinceCode": "460000",
                        "lon": 109.99673620157,
                        "lat": 19.693135069577
                    },
                    {
                        "label": "临高县",
                        "value": "469024",
                        "cityCode": "469000",
                        "provinceCode": "460000",
                        "lon": 109.72410152868,
                        "lat": 19.805922012409
                    },
                    {
                        "label": "白沙黎族自治县",
                        "value": "469025",
                        "cityCode": "469000",
                        "provinceCode": "460000",
                        "lon": 109.35858558291,
                        "lat": 19.216056142062
                    },
                    {
                        "label": "昌江黎族自治县",
                        "value": "469026",
                        "cityCode": "469000",
                        "provinceCode": "460000",
                        "lon": 109.01129968163,
                        "lat": 19.222482900957
                    },
                    {
                        "label": "乐东黎族自治县",
                        "value": "469027",
                        "cityCode": "469000",
                        "provinceCode": "460000",
                        "lon": 109.0626980127,
                        "lat": 18.658613560734
                    },
                    {
                        "label": "陵水黎族自治县",
                        "value": "469028",
                        "cityCode": "469000",
                        "provinceCode": "460000",
                        "lon": 109.94866071004,
                        "lat": 18.575984851566
                    },
                    {
                        "label": "保亭黎族苗族自治县",
                        "value": "469029",
                        "cityCode": "469000",
                        "provinceCode": "460000",
                        "lon": 109.65611337969,
                        "lat": 18.597592346267
                    },
                    {
                        "label": "琼中黎族苗族自治县",
                        "value": "469030",
                        "cityCode": "469000",
                        "provinceCode": "460000",
                        "lon": 109.86184857077,
                        "lat": 19.039771066968
                    }
                ]
            }
        ],
        "label": "海南省",
        "value": "460000"
    },
    {
        "country": "china",
        "lon": 106.53063501341,
        "lat": 29.544606108886,
        "children": [
            {
                "label": "市辖区",
                "value": "500100",
                "provinceCode": "500000",
                "lon": 106.53063501341,
                "lat": 29.544606108886,
                "children": [
                    {
                        "label": "万州区",
                        "value": "500101",
                        "cityCode": "500100",
                        "provinceCode": "500000",
                        "lon": 108.4134386367,
                        "lat": 30.710054184366
                    },
                    {
                        "label": "涪陵区",
                        "value": "500102",
                        "cityCode": "500100",
                        "provinceCode": "500000",
                        "lon": 107.34079973803,
                        "lat": 29.66467054056
                    },
                    {
                        "label": "渝中区",
                        "value": "500103",
                        "cityCode": "500100",
                        "provinceCode": "500000",
                        "lon": 106.54696678483,
                        "lat": 29.555236194395
                    },
                    {
                        "label": "大渡口区",
                        "value": "500104",
                        "cityCode": "500100",
                        "provinceCode": "500000",
                        "lon": 106.46532181465,
                        "lat": 29.424139786946
                    },
                    {
                        "label": "江北区",
                        "value": "500105",
                        "cityCode": "500100",
                        "provinceCode": "500000",
                        "lon": 106.71361473094,
                        "lat": 29.619317744064
                    },
                    {
                        "label": "沙坪坝区",
                        "value": "500106",
                        "cityCode": "500100",
                        "provinceCode": "500000",
                        "lon": 106.37480489265,
                        "lat": 29.630548136629
                    },
                    {
                        "label": "九龙坡区",
                        "value": "500107",
                        "cityCode": "500100",
                        "provinceCode": "500000",
                        "lon": 106.37059488439,
                        "lat": 29.434566154958
                    },
                    {
                        "label": "南岸区",
                        "value": "500108",
                        "cityCode": "500100",
                        "provinceCode": "500000",
                        "lon": 106.66717849904,
                        "lat": 29.541514618903
                    },
                    {
                        "label": "北碚区",
                        "value": "500109",
                        "cityCode": "500100",
                        "provinceCode": "500000",
                        "lon": 106.52034245432,
                        "lat": 29.866596066865
                    },
                    {
                        "label": "綦江区",
                        "value": "500110",
                        "cityCode": "500100",
                        "provinceCode": "500000",
                        "lon": 106.73584657225,
                        "lat": 28.825949323551
                    },
                    {
                        "label": "大足区",
                        "value": "500111",
                        "cityCode": "500100",
                        "provinceCode": "500000",
                        "lon": 105.76093297492,
                        "lat": 29.622204718555
                    },
                    {
                        "label": "渝北区",
                        "value": "500112",
                        "cityCode": "500100",
                        "provinceCode": "500000",
                        "lon": 106.7537985312,
                        "lat": 29.816264082426
                    },
                    {
                        "label": "巴南区",
                        "value": "500113",
                        "cityCode": "500100",
                        "provinceCode": "500000",
                        "lon": 106.7582741592,
                        "lat": 29.378027968889
                    },
                    {
                        "label": "黔江区",
                        "value": "500114",
                        "cityCode": "500100",
                        "provinceCode": "500000",
                        "lon": 108.71480796402,
                        "lat": 29.440981033584
                    },
                    {
                        "label": "长寿区",
                        "value": "500115",
                        "cityCode": "500100",
                        "provinceCode": "500000",
                        "lon": 107.14661537132,
                        "lat": 29.96049135503
                    },
                    {
                        "label": "江津区",
                        "value": "500116",
                        "cityCode": "500100",
                        "provinceCode": "500000",
                        "lon": 106.26928185639,
                        "lat": 29.035351190668
                    },
                    {
                        "label": "合川区",
                        "value": "500117",
                        "cityCode": "500100",
                        "provinceCode": "500000",
                        "lon": 106.31802875449,
                        "lat": 30.118708260134
                    },
                    {
                        "label": "永川区",
                        "value": "500118",
                        "cityCode": "500100",
                        "provinceCode": "500000",
                        "lon": 105.88035760368,
                        "lat": 29.296487646991
                    },
                    {
                        "label": "南川区",
                        "value": "500119",
                        "cityCode": "500100",
                        "provinceCode": "500000",
                        "lon": 107.17788827954,
                        "lat": 29.141685769527
                    },
                    {
                        "label": "璧山区",
                        "value": "500120",
                        "cityCode": "500100",
                        "provinceCode": "500000",
                        "lon": 106.21326949786,
                        "lat": 29.588328631909
                    },
                    {
                        "label": "铜梁区",
                        "value": "500151",
                        "cityCode": "500100",
                        "provinceCode": "500000",
                        "lon": 106.03488288304,
                        "lat": 29.813265758673
                    },
                    {
                        "label": "潼南区",
                        "value": "500152",
                        "cityCode": "500100",
                        "provinceCode": "500000",
                        "lon": 105.78466162818,
                        "lat": 30.116632232545
                    },
                    {
                        "label": "荣昌区",
                        "value": "500153",
                        "cityCode": "500100",
                        "provinceCode": "500000",
                        "lon": 105.52149235061,
                        "lat": 29.472620663129
                    },
                    {
                        "label": "开州区",
                        "value": "500154",
                        "cityCode": "500100",
                        "provinceCode": "500000",
                        "lon": 108.42256829126,
                        "lat": 31.262995406524
                    }
                ]
            },
            {
                "label": "县",
                "value": "500200",
                "provinceCode": "500000",
                "lon": 106.53063501341,
                "lat": 29.544606108886,
                "children": [
                    {
                        "label": "城口县",
                        "value": "500229",
                        "cityCode": "500200",
                        "provinceCode": "500000",
                        "lon": 108.74185516517,
                        "lat": 31.888131392209
                    },
                    {
                        "label": "丰都县",
                        "value": "500230",
                        "cityCode": "500200",
                        "provinceCode": "500000",
                        "lon": 107.8375173643,
                        "lat": 29.890595717682
                    },
                    {
                        "label": "垫江县",
                        "value": "500231",
                        "cityCode": "500200",
                        "provinceCode": "500000",
                        "lon": 107.44444454166,
                        "lat": 30.259498445887
                    },
                    {
                        "label": "忠县",
                        "value": "500233",
                        "cityCode": "500200",
                        "provinceCode": "500000",
                        "lon": 106.53063501341,
                        "lat": 29.544606108886
                    },
                    {
                        "label": "云阳县",
                        "value": "500235",
                        "cityCode": "500200",
                        "provinceCode": "500000",
                        "lon": 108.86318575675,
                        "lat": 31.042409267237
                    },
                    {
                        "label": "奉节县",
                        "value": "500236",
                        "cityCode": "500200",
                        "provinceCode": "500000",
                        "lon": 109.35566670168,
                        "lat": 30.958552797156
                    },
                    {
                        "label": "巫山县",
                        "value": "500237",
                        "cityCode": "500200",
                        "provinceCode": "500000",
                        "lon": 109.90861122268,
                        "lat": 31.121151720268
                    },
                    {
                        "label": "巫溪县",
                        "value": "500238",
                        "cityCode": "500200",
                        "provinceCode": "500000",
                        "lon": 109.36053147066,
                        "lat": 31.509161376321
                    },
                    {
                        "label": "石柱土家族自治县",
                        "value": "500240",
                        "cityCode": "500200",
                        "provinceCode": "500000",
                        "lon": 108.30489042793,
                        "lat": 30.099636944155
                    },
                    {
                        "label": "秀山土家族苗族自治县",
                        "value": "500241",
                        "cityCode": "500200",
                        "provinceCode": "500000",
                        "lon": 109.02532125368,
                        "lat": 28.498315398405
                    },
                    {
                        "label": "酉阳土家族苗族自治县",
                        "value": "500242",
                        "cityCode": "500200",
                        "provinceCode": "500000",
                        "lon": 108.80680823733,
                        "lat": 28.905277662391
                    },
                    {
                        "label": "彭水苗族土家族自治县",
                        "value": "500243",
                        "cityCode": "500200",
                        "provinceCode": "500000",
                        "lon": 108.27286773419,
                        "lat": 29.359628264894
                    }
                ]
            }
        ],
        "label": "重庆市",
        "value": "500000"
    },
    {
        "country": "china",
        "lon": 102.8991597236,
        "lat": 30.367480937958,
        "children": [
            {
                "label": "成都市",
                "value": "510100",
                "provinceCode": "510000",
                "lon": 104.0679234633,
                "lat": 30.67994284542,
                "children": [
                    {
                        "label": "锦江区",
                        "value": "510104",
                        "cityCode": "510100",
                        "provinceCode": "510000",
                        "lon": 104.12426938462,
                        "lat": 30.606301824621
                    },
                    {
                        "label": "青羊区",
                        "value": "510105",
                        "cityCode": "510100",
                        "provinceCode": "510000",
                        "lon": 103.98842870094,
                        "lat": 30.685101946314
                    },
                    {
                        "label": "金牛区",
                        "value": "510106",
                        "cityCode": "510100",
                        "provinceCode": "510000",
                        "lon": 104.06137695451,
                        "lat": 30.735622100763
                    },
                    {
                        "label": "武侯区",
                        "value": "510107",
                        "cityCode": "510100",
                        "provinceCode": "510000",
                        "lon": 104.04124020837,
                        "lat": 30.612881788753
                    },
                    {
                        "label": "成华区",
                        "value": "510108",
                        "cityCode": "510100",
                        "provinceCode": "510000",
                        "lon": 104.15003204704,
                        "lat": 30.695040111899
                    },
                    {
                        "label": "龙泉驿区",
                        "value": "510112",
                        "cityCode": "510100",
                        "provinceCode": "510000",
                        "lon": 104.30118080707,
                        "lat": 30.603368382019
                    },
                    {
                        "label": "青白江区",
                        "value": "510113",
                        "cityCode": "510100",
                        "provinceCode": "510000",
                        "lon": 104.34642982356,
                        "lat": 30.796353967983
                    },
                    {
                        "label": "新都区",
                        "value": "510114",
                        "cityCode": "510100",
                        "provinceCode": "510000",
                        "lon": 104.11658349961,
                        "lat": 30.839503886637
                    },
                    {
                        "label": "温江区",
                        "value": "510115",
                        "cityCode": "510100",
                        "provinceCode": "510000",
                        "lon": 103.81646839534,
                        "lat": 30.730254927008
                    },
                    {
                        "label": "双流区",
                        "value": "510116",
                        "cityCode": "510100",
                        "provinceCode": "510000",
                        "lon": 104.0328303402,
                        "lat": 30.450175430612
                    },
                    {
                        "label": "金堂县",
                        "value": "510121",
                        "cityCode": "510100",
                        "provinceCode": "510000",
                        "lon": 104.61537139695,
                        "lat": 30.728612610912
                    },
                    {
                        "label": "大邑县",
                        "value": "510129",
                        "cityCode": "510100",
                        "provinceCode": "510000",
                        "lon": 103.38845160801,
                        "lat": 30.614941412606
                    },
                    {
                        "label": "蒲江县",
                        "value": "510131",
                        "cityCode": "510100",
                        "provinceCode": "510000",
                        "lon": 103.49773846901,
                        "lat": 30.239938504594
                    },
                    {
                        "label": "新津县",
                        "value": "510132",
                        "cityCode": "510100",
                        "provinceCode": "510000",
                        "lon": 103.83217681027,
                        "lat": 30.42786608997
                    },
                    {
                        "label": "都江堰市",
                        "value": "510181",
                        "cityCode": "510100",
                        "provinceCode": "510000",
                        "lon": 103.63734201321,
                        "lat": 31.039123659728
                    },
                    {
                        "label": "彭州市",
                        "value": "510182",
                        "cityCode": "510100",
                        "provinceCode": "510000",
                        "lon": 103.88986635887,
                        "lat": 31.148577255886
                    },
                    {
                        "label": "邛崃市",
                        "value": "510183",
                        "cityCode": "510100",
                        "provinceCode": "510000",
                        "lon": 103.37651244321,
                        "lat": 30.388736018151
                    },
                    {
                        "label": "崇州市",
                        "value": "510184",
                        "cityCode": "510100",
                        "provinceCode": "510000",
                        "lon": 103.52946689588,
                        "lat": 30.71964092397
                    },
                    {
                        "label": "简阳市",
                        "value": "510185",
                        "cityCode": "510100",
                        "provinceCode": "510000",
                        "lon": 104.55059629796,
                        "lat": 30.37250750046
                    }
                ]
            },
            {
                "label": "自贡市",
                "value": "510300",
                "provinceCode": "510000",
                "lon": 104.77607133936,
                "lat": 29.359156889476,
                "children": [
                    {
                        "label": "自流井区",
                        "value": "510302",
                        "cityCode": "510300",
                        "provinceCode": "510000",
                        "lon": 104.70785437828,
                        "lat": 29.28261396923
                    },
                    {
                        "label": "贡井区",
                        "value": "510303",
                        "cityCode": "510300",
                        "provinceCode": "510000",
                        "lon": 104.6027348472,
                        "lat": 29.314590727756
                    },
                    {
                        "label": "大安区",
                        "value": "510304",
                        "cityCode": "510300",
                        "provinceCode": "510000",
                        "lon": 104.87756638738,
                        "lat": 29.411547695333
                    },
                    {
                        "label": "沿滩区",
                        "value": "510311",
                        "cityCode": "510300",
                        "provinceCode": "510000",
                        "lon": 104.854763441,
                        "lat": 29.242640479342
                    },
                    {
                        "label": "荣县",
                        "value": "510321",
                        "cityCode": "510300",
                        "provinceCode": "510000",
                        "lon": 104.372407917,
                        "lat": 29.398978496698
                    },
                    {
                        "label": "富顺县",
                        "value": "510322",
                        "cityCode": "510300",
                        "provinceCode": "510000",
                        "lon": 105.02222048778,
                        "lat": 29.152297063892
                    }
                ]
            },
            {
                "label": "攀枝花市",
                "value": "510400",
                "provinceCode": "510000",
                "lon": 101.72242315249,
                "lat": 26.587571257109,
                "children": [
                    {
                        "label": "东区",
                        "value": "510402",
                        "cityCode": "510400",
                        "provinceCode": "510000",
                        "lon": 101.72242315249,
                        "lat": 26.587571257109
                    },
                    {
                        "label": "西区",
                        "value": "510403",
                        "cityCode": "510400",
                        "provinceCode": "510000",
                        "lon": 101.72242315249,
                        "lat": 26.587571257109
                    },
                    {
                        "label": "仁和区",
                        "value": "510411",
                        "cityCode": "510400",
                        "provinceCode": "510000",
                        "lon": 101.66970205128,
                        "lat": 26.56790741922
                    },
                    {
                        "label": "米易县",
                        "value": "510421",
                        "cityCode": "510400",
                        "provinceCode": "510000",
                        "lon": 102.00072626456,
                        "lat": 26.932749356485
                    },
                    {
                        "label": "盐边县",
                        "value": "510422",
                        "cityCode": "510400",
                        "provinceCode": "510000",
                        "lon": 101.58605027726,
                        "lat": 26.940087094351
                    }
                ]
            },
            {
                "label": "泸州市",
                "value": "510500",
                "provinceCode": "510000",
                "lon": 105.44397028921,
                "lat": 28.89592980386,
                "children": [
                    {
                        "label": "江阳区",
                        "value": "510502",
                        "cityCode": "510500",
                        "provinceCode": "510000",
                        "lon": 105.37171257028,
                        "lat": 28.87690067554
                    },
                    {
                        "label": "纳溪区",
                        "value": "510503",
                        "cityCode": "510500",
                        "provinceCode": "510000",
                        "lon": 105.3906055521,
                        "lat": 28.614041373614
                    },
                    {
                        "label": "龙马潭区",
                        "value": "510504",
                        "cityCode": "510500",
                        "provinceCode": "510000",
                        "lon": 105.4378416897,
                        "lat": 28.987460236388
                    },
                    {
                        "label": "泸县",
                        "value": "510521",
                        "cityCode": "510500",
                        "provinceCode": "510000",
                        "lon": 105.50826734902,
                        "lat": 29.124919969133
                    },
                    {
                        "label": "合江县",
                        "value": "510522",
                        "cityCode": "510500",
                        "provinceCode": "510000",
                        "lon": 105.93160013109,
                        "lat": 28.751865254096
                    },
                    {
                        "label": "叙永县",
                        "value": "510524",
                        "cityCode": "510500",
                        "provinceCode": "510000",
                        "lon": 105.46859233328,
                        "lat": 28.099206628496
                    },
                    {
                        "label": "古蔺县",
                        "value": "510525",
                        "cityCode": "510500",
                        "provinceCode": "510000",
                        "lon": 105.93629331276,
                        "lat": 27.983319448381
                    }
                ]
            },
            {
                "label": "德阳市",
                "value": "510600",
                "provinceCode": "510000",
                "lon": 104.40239781824,
                "lat": 31.131139652701,
                "children": [
                    {
                        "label": "旌阳区",
                        "value": "510603",
                        "cityCode": "510600",
                        "provinceCode": "510000",
                        "lon": 104.41525849556,
                        "lat": 31.179805144786
                    },
                    {
                        "label": "中江县",
                        "value": "510623",
                        "cityCode": "510600",
                        "provinceCode": "510000",
                        "lon": 104.80495180574,
                        "lat": 30.887114236708
                    },
                    {
                        "label": "广汉市",
                        "value": "510681",
                        "cityCode": "510600",
                        "provinceCode": "510000",
                        "lon": 104.29847583599,
                        "lat": 31.006480881164
                    },
                    {
                        "label": "什邡市",
                        "value": "510682",
                        "cityCode": "510600",
                        "provinceCode": "510000",
                        "lon": 104.01987074915,
                        "lat": 31.29369418585
                    },
                    {
                        "label": "绵竹市",
                        "value": "510683",
                        "cityCode": "510600",
                        "provinceCode": "510000",
                        "lon": 104.12929386201,
                        "lat": 31.436657312108
                    }
                ]
            },
            {
                "label": "绵阳市",
                "value": "510700",
                "provinceCode": "510000",
                "lon": 104.70551897529,
                "lat": 31.504701258061,
                "children": [
                    {
                        "label": "涪城区",
                        "value": "510703",
                        "cityCode": "510700",
                        "provinceCode": "510000",
                        "lon": 104.67051389601,
                        "lat": 31.435734812547
                    },
                    {
                        "label": "游仙区",
                        "value": "510704",
                        "cityCode": "510700",
                        "provinceCode": "510000",
                        "lon": 104.98157984665,
                        "lat": 31.518816009605
                    },
                    {
                        "label": "安州区",
                        "value": "510705",
                        "cityCode": "510700",
                        "provinceCode": "510000",
                        "lon": 104.37720699346,
                        "lat": 31.589559671673
                    },
                    {
                        "label": "三台县",
                        "value": "510722",
                        "cityCode": "510700",
                        "provinceCode": "510000",
                        "lon": 105.04258112078,
                        "lat": 31.118872490873
                    },
                    {
                        "label": "盐亭县",
                        "value": "510723",
                        "cityCode": "510700",
                        "provinceCode": "510000",
                        "lon": 105.4790711008,
                        "lat": 31.247942979309
                    },
                    {
                        "label": "梓潼县",
                        "value": "510725",
                        "cityCode": "510700",
                        "provinceCode": "510000",
                        "lon": 105.19383418448,
                        "lat": 31.653620996937
                    },
                    {
                        "label": "北川羌族自治县",
                        "value": "510726",
                        "cityCode": "510700",
                        "provinceCode": "510000",
                        "lon": 104.25834135739,
                        "lat": 31.962527312739
                    },
                    {
                        "label": "平武县",
                        "value": "510727",
                        "cityCode": "510700",
                        "provinceCode": "510000",
                        "lon": 104.40430826693,
                        "lat": 32.446911722865
                    },
                    {
                        "label": "江油市",
                        "value": "510781",
                        "cityCode": "510700",
                        "provinceCode": "510000",
                        "lon": 104.93314929993,
                        "lat": 31.952426668806
                    }
                ]
            },
            {
                "label": "广元市",
                "value": "510800",
                "provinceCode": "510000",
                "lon": 105.81968694,
                "lat": 32.441040158428,
                "children": [
                    {
                        "label": "利州区",
                        "value": "510802",
                        "cityCode": "510800",
                        "provinceCode": "510000",
                        "lon": 105.7853172322,
                        "lat": 32.478529639449
                    },
                    {
                        "label": "昭化区",
                        "value": "510811",
                        "cityCode": "510800",
                        "provinceCode": "510000",
                        "lon": 105.82174977463,
                        "lat": 32.141760307902
                    },
                    {
                        "label": "朝天区",
                        "value": "510812",
                        "cityCode": "510800",
                        "provinceCode": "510000",
                        "lon": 106.02216392398,
                        "lat": 32.708417209014
                    },
                    {
                        "label": "旺苍县",
                        "value": "510821",
                        "cityCode": "510800",
                        "provinceCode": "510000",
                        "lon": 106.40182287359,
                        "lat": 32.372139642174
                    },
                    {
                        "label": "青川县",
                        "value": "510822",
                        "cityCode": "510800",
                        "provinceCode": "510000",
                        "lon": 105.19044673467,
                        "lat": 32.515859827572
                    },
                    {
                        "label": "剑阁县",
                        "value": "510823",
                        "cityCode": "510800",
                        "provinceCode": "510000",
                        "lon": 105.50302096949,
                        "lat": 31.921947731961
                    },
                    {
                        "label": "苍溪县",
                        "value": "510824",
                        "cityCode": "510800",
                        "provinceCode": "510000",
                        "lon": 106.11328295036,
                        "lat": 31.918551658673
                    }
                ]
            },
            {
                "label": "遂宁市",
                "value": "510900",
                "provinceCode": "510000",
                "lon": 105.56488779226,
                "lat": 30.55749135038,
                "children": [
                    {
                        "label": "船山区",
                        "value": "510903",
                        "cityCode": "510900",
                        "provinceCode": "510000",
                        "lon": 105.62152802077,
                        "lat": 30.523499649283
                    },
                    {
                        "label": "安居区",
                        "value": "510904",
                        "cityCode": "510900",
                        "provinceCode": "510000",
                        "lon": 105.41441146849,
                        "lat": 30.363522338679
                    },
                    {
                        "label": "蓬溪县",
                        "value": "510921",
                        "cityCode": "510900",
                        "provinceCode": "510000",
                        "lon": 105.71608763636,
                        "lat": 30.657491289748
                    },
                    {
                        "label": "大英县",
                        "value": "510923",
                        "cityCode": "510900",
                        "provinceCode": "510000",
                        "lon": 105.25637201729,
                        "lat": 30.580190633917
                    }
                ]
            },
            {
                "label": "内江市",
                "value": "511000",
                "provinceCode": "510000",
                "lon": 105.07305599171,
                "lat": 29.599461534775,
                "children": [
                    {
                        "label": "市中区",
                        "value": "511002",
                        "cityCode": "511000",
                        "provinceCode": "510000",
                        "lon": 104.95397876928,
                        "lat": 29.55164493068
                    },
                    {
                        "label": "东兴区",
                        "value": "511011",
                        "cityCode": "511000",
                        "provinceCode": "510000",
                        "lon": 105.20216881381,
                        "lat": 29.628088552472
                    },
                    {
                        "label": "威远县",
                        "value": "511024",
                        "cityCode": "511000",
                        "provinceCode": "510000",
                        "lon": 104.59397578195,
                        "lat": 29.599588801619
                    },
                    {
                        "label": "资中县",
                        "value": "511025",
                        "cityCode": "511000",
                        "provinceCode": "510000",
                        "lon": 104.80746566888,
                        "lat": 29.813836235002
                    }
                ]
            },
            {
                "label": "乐山市",
                "value": "511100",
                "provinceCode": "510000",
                "lon": 103.76082423877,
                "lat": 29.600957611095,
                "children": [
                    {
                        "label": "市中区",
                        "value": "511102",
                        "cityCode": "511100",
                        "provinceCode": "510000",
                        "lon": 104.95397876928,
                        "lat": 29.55164493068
                    },
                    {
                        "label": "沙湾区",
                        "value": "511111",
                        "cityCode": "511100",
                        "provinceCode": "510000",
                        "lon": 103.60454818519,
                        "lat": 29.316409760812
                    },
                    {
                        "label": "五通桥区",
                        "value": "511112",
                        "cityCode": "511100",
                        "provinceCode": "510000",
                        "lon": 103.84663334546,
                        "lat": 29.395443506532
                    },
                    {
                        "label": "金口河区",
                        "value": "511113",
                        "cityCode": "511100",
                        "provinceCode": "510000",
                        "lon": 103.07336628607,
                        "lat": 29.293819974164
                    },
                    {
                        "label": "犍为县",
                        "value": "511123",
                        "cityCode": "511100",
                        "provinceCode": "510000",
                        "lon": 103.98019853458,
                        "lat": 29.231190495122
                    },
                    {
                        "label": "井研县",
                        "value": "511124",
                        "cityCode": "511100",
                        "provinceCode": "510000",
                        "lon": 104.05532967168,
                        "lat": 29.644500661501
                    },
                    {
                        "label": "夹江县",
                        "value": "511126",
                        "cityCode": "511100",
                        "provinceCode": "510000",
                        "lon": 103.55926293457,
                        "lat": 29.7761069203
                    },
                    {
                        "label": "沐川县",
                        "value": "511129",
                        "cityCode": "511100",
                        "provinceCode": "510000",
                        "lon": 103.82650268685,
                        "lat": 29.006905081763
                    },
                    {
                        "label": "峨边彝族自治县",
                        "value": "511132",
                        "cityCode": "511100",
                        "provinceCode": "510000",
                        "lon": 103.2167397181,
                        "lat": 29.050415556838
                    },
                    {
                        "label": "马边彝族自治县",
                        "value": "511133",
                        "cityCode": "511100",
                        "provinceCode": "510000",
                        "lon": 103.48138754926,
                        "lat": 28.776739333365
                    },
                    {
                        "label": "峨眉山市",
                        "value": "511181",
                        "cityCode": "511100",
                        "provinceCode": "510000",
                        "lon": 103.40091230856,
                        "lat": 29.50700404085
                    }
                ]
            },
            {
                "label": "南充市",
                "value": "511300",
                "provinceCode": "510000",
                "lon": 106.10555398379,
                "lat": 30.800965168237,
                "children": [
                    {
                        "label": "顺庆区",
                        "value": "511302",
                        "cityCode": "511300",
                        "provinceCode": "510000",
                        "lon": 106.11579825983,
                        "lat": 30.949624560849
                    },
                    {
                        "label": "高坪区",
                        "value": "511303",
                        "cityCode": "511300",
                        "provinceCode": "510000",
                        "lon": 106.25975917374,
                        "lat": 30.75468404314
                    },
                    {
                        "label": "嘉陵区",
                        "value": "511304",
                        "cityCode": "511300",
                        "provinceCode": "510000",
                        "lon": 105.93870307769,
                        "lat": 30.665451829003
                    },
                    {
                        "label": "南部县",
                        "value": "511321",
                        "cityCode": "511300",
                        "provinceCode": "510000",
                        "lon": 105.92351381942,
                        "lat": 31.349802866479
                    },
                    {
                        "label": "营山县",
                        "value": "511322",
                        "cityCode": "511300",
                        "provinceCode": "510000",
                        "lon": 106.7185269662,
                        "lat": 31.162322799073
                    },
                    {
                        "label": "蓬安县",
                        "value": "511323",
                        "cityCode": "511300",
                        "provinceCode": "510000",
                        "lon": 106.42891733521,
                        "lat": 31.007075500318
                    },
                    {
                        "label": "仪陇县",
                        "value": "511324",
                        "cityCode": "511300",
                        "provinceCode": "510000",
                        "lon": 106.53472488695,
                        "lat": 31.443593221681
                    },
                    {
                        "label": "西充县",
                        "value": "511325",
                        "cityCode": "511300",
                        "provinceCode": "510000",
                        "lon": 105.85733163521,
                        "lat": 31.063877074354
                    },
                    {
                        "label": "阆中市",
                        "value": "511381",
                        "cityCode": "511300",
                        "provinceCode": "510000",
                        "lon": 106.07809314825,
                        "lat": 31.602117348886
                    }
                ]
            },
            {
                "label": "眉山市",
                "value": "511400",
                "provinceCode": "510000",
                "lon": 103.84142956287,
                "lat": 30.061115079945,
                "children": [
                    {
                        "label": "东坡区",
                        "value": "511402",
                        "cityCode": "511400",
                        "provinceCode": "510000",
                        "lon": 103.74833257305,
                        "lat": 30.057372008382
                    },
                    {
                        "label": "彭山区",
                        "value": "511403",
                        "cityCode": "511400",
                        "provinceCode": "510000",
                        "lon": 103.84644479804,
                        "lat": 30.24443648473
                    },
                    {
                        "label": "仁寿县",
                        "value": "511421",
                        "cityCode": "511400",
                        "provinceCode": "510000",
                        "lon": 104.22551880085,
                        "lat": 29.985868914405
                    },
                    {
                        "label": "洪雅县",
                        "value": "511423",
                        "cityCode": "511400",
                        "provinceCode": "510000",
                        "lon": 103.18015949893,
                        "lat": 29.694316499556
                    },
                    {
                        "label": "丹棱县",
                        "value": "511424",
                        "cityCode": "511400",
                        "provinceCode": "510000",
                        "lon": 103.43451305805,
                        "lat": 30.014802935586
                    },
                    {
                        "label": "青神县",
                        "value": "511425",
                        "cityCode": "511400",
                        "provinceCode": "510000",
                        "lon": 103.83750799161,
                        "lat": 29.82275999862
                    }
                ]
            },
            {
                "label": "宜宾市",
                "value": "511500",
                "provinceCode": "510000",
                "lon": 104.63301906153,
                "lat": 28.769674796266,
                "children": [
                    {
                        "label": "翠屏区",
                        "value": "511502",
                        "cityCode": "511500",
                        "provinceCode": "510000",
                        "lon": 104.69325460374,
                        "lat": 28.81581998264
                    },
                    {
                        "label": "南溪区",
                        "value": "511503",
                        "cityCode": "511500",
                        "provinceCode": "510000",
                        "lon": 104.92244522579,
                        "lat": 28.891857434171
                    },
                    {
                        "label": "江安县",
                        "value": "511523",
                        "cityCode": "511500",
                        "provinceCode": "510000",
                        "lon": 105.12877827717,
                        "lat": 28.663532600917
                    },
                    {
                        "label": "长宁县",
                        "value": "511524",
                        "cityCode": "511500",
                        "provinceCode": "510000",
                        "lon": 104.93114856989,
                        "lat": 28.515433786755
                    },
                    {
                        "label": "高县",
                        "value": "511525",
                        "cityCode": "511500",
                        "provinceCode": "510000",
                        "lon": 104.5930664103,
                        "lat": 28.463200492005
                    },
                    {
                        "label": "珙县",
                        "value": "511526",
                        "cityCode": "511500",
                        "provinceCode": "510000",
                        "lon": 104.8066179908,
                        "lat": 28.196990137689
                    },
                    {
                        "label": "筠连县",
                        "value": "511527",
                        "cityCode": "511500",
                        "provinceCode": "510000",
                        "lon": 104.58843340511,
                        "lat": 28.042098884244
                    },
                    {
                        "label": "兴文县",
                        "value": "511528",
                        "cityCode": "511500",
                        "provinceCode": "510000",
                        "lon": 105.14122589128,
                        "lat": 28.255538437302
                    },
                    {
                        "label": "屏山县",
                        "value": "511529",
                        "cityCode": "511500",
                        "provinceCode": "510000",
                        "lon": 103.99911803649,
                        "lat": 28.702428662485
                    }
                ]
            },
            {
                "label": "广安市",
                "value": "511600",
                "provinceCode": "510000",
                "lon": 106.63572033137,
                "lat": 30.463983887888,
                "children": [
                    {
                        "label": "广安区",
                        "value": "511602",
                        "cityCode": "511600",
                        "provinceCode": "510000",
                        "lon": 106.75891196362,
                        "lat": 30.599249987199
                    },
                    {
                        "label": "前锋区",
                        "value": "511603",
                        "cityCode": "511600",
                        "provinceCode": "510000",
                        "lon": 106.86565774045,
                        "lat": 30.543834838815
                    },
                    {
                        "label": "岳池县",
                        "value": "511621",
                        "cityCode": "511600",
                        "provinceCode": "510000",
                        "lon": 106.4208329851,
                        "lat": 30.540768629653
                    },
                    {
                        "label": "武胜县",
                        "value": "511622",
                        "cityCode": "511600",
                        "provinceCode": "510000",
                        "lon": 106.23136624407,
                        "lat": 30.373904543993
                    },
                    {
                        "label": "邻水县",
                        "value": "511623",
                        "cityCode": "511600",
                        "provinceCode": "510000",
                        "lon": 107.00333361946,
                        "lat": 30.263283994028
                    },
                    {
                        "label": "华蓥市",
                        "value": "511681",
                        "cityCode": "511600",
                        "provinceCode": "510000",
                        "lon": 106.75941195402,
                        "lat": 30.321832376319
                    }
                ]
            },
            {
                "label": "达州市",
                "value": "511700",
                "provinceCode": "510000",
                "lon": 107.49497344659,
                "lat": 31.214198858945,
                "children": [
                    {
                        "label": "通川区",
                        "value": "511702",
                        "cityCode": "511700",
                        "provinceCode": "510000",
                        "lon": 107.51920394973,
                        "lat": 31.238764440346
                    },
                    {
                        "label": "达川区",
                        "value": "511703",
                        "cityCode": "511700",
                        "provinceCode": "510000",
                        "lon": 107.42129730953,
                        "lat": 31.187291385014
                    },
                    {
                        "label": "宣汉县",
                        "value": "511722",
                        "cityCode": "511700",
                        "provinceCode": "510000",
                        "lon": 107.93603281988,
                        "lat": 31.51979762495
                    },
                    {
                        "label": "开江县",
                        "value": "511723",
                        "cityCode": "511700",
                        "provinceCode": "510000",
                        "lon": 107.89101188441,
                        "lat": 31.05158729925
                    },
                    {
                        "label": "大竹县",
                        "value": "511724",
                        "cityCode": "511700",
                        "provinceCode": "510000",
                        "lon": 107.27987739412,
                        "lat": 30.690772377766
                    },
                    {
                        "label": "渠县",
                        "value": "511725",
                        "cityCode": "511700",
                        "provinceCode": "510000",
                        "lon": 106.98760176612,
                        "lat": 30.94881416065
                    },
                    {
                        "label": "万源市",
                        "value": "511781",
                        "cityCode": "511700",
                        "provinceCode": "510000",
                        "lon": 107.99381097493,
                        "lat": 31.986241088206
                    }
                ]
            },
            {
                "label": "雅安市",
                "value": "511800",
                "provinceCode": "510000",
                "lon": 103.00935646635,
                "lat": 29.999716337066,
                "children": [
                    {
                        "label": "雨城区",
                        "value": "511802",
                        "cityCode": "511800",
                        "provinceCode": "510000",
                        "lon": 103.03840450831,
                        "lat": 29.928506655301
                    },
                    {
                        "label": "名山区",
                        "value": "511803",
                        "cityCode": "511800",
                        "provinceCode": "510000",
                        "lon": 103.23102630214,
                        "lat": 30.117458953474
                    },
                    {
                        "label": "荥经县",
                        "value": "511822",
                        "cityCode": "511800",
                        "provinceCode": "510000",
                        "lon": 102.69194616494,
                        "lat": 29.740877769322
                    },
                    {
                        "label": "汉源县",
                        "value": "511823",
                        "cityCode": "511800",
                        "provinceCode": "510000",
                        "lon": 102.62513643454,
                        "lat": 29.431575643201
                    },
                    {
                        "label": "石棉县",
                        "value": "511824",
                        "cityCode": "511800",
                        "provinceCode": "510000",
                        "lon": 102.2939695159,
                        "lat": 29.235484876512
                    },
                    {
                        "label": "天全县",
                        "value": "511825",
                        "cityCode": "511800",
                        "provinceCode": "510000",
                        "lon": 102.57830462584,
                        "lat": 30.078874542047
                    },
                    {
                        "label": "芦山县",
                        "value": "511826",
                        "cityCode": "511800",
                        "provinceCode": "510000",
                        "lon": 103.01809878481,
                        "lat": 30.440281571631
                    },
                    {
                        "label": "宝兴县",
                        "value": "511827",
                        "cityCode": "511800",
                        "provinceCode": "510000",
                        "lon": 102.71689365787,
                        "lat": 30.567649711279
                    }
                ]
            },
            {
                "label": "巴中市",
                "value": "511900",
                "provinceCode": "510000",
                "lon": 106.75791584175,
                "lat": 31.86918915916,
                "children": [
                    {
                        "label": "巴州区",
                        "value": "511902",
                        "cityCode": "511900",
                        "provinceCode": "510000",
                        "lon": 106.739266453,
                        "lat": 31.785302790667
                    },
                    {
                        "label": "恩阳区",
                        "value": "511903",
                        "cityCode": "511900",
                        "provinceCode": "510000",
                        "lon": 106.75791584175,
                        "lat": 31.86918915916
                    },
                    {
                        "label": "通江县",
                        "value": "511921",
                        "cityCode": "511900",
                        "provinceCode": "510000",
                        "lon": 107.35277526385,
                        "lat": 32.13640689395
                    },
                    {
                        "label": "南江县",
                        "value": "511922",
                        "cityCode": "511900",
                        "provinceCode": "510000",
                        "lon": 106.83618103409,
                        "lat": 32.337239209081
                    },
                    {
                        "label": "平昌县",
                        "value": "511923",
                        "cityCode": "511900",
                        "provinceCode": "510000",
                        "lon": 107.16735749976,
                        "lat": 31.59771477028
                    }
                ]
            },
            {
                "label": "资阳市",
                "value": "512000",
                "provinceCode": "510000",
                "lon": 104.63593030167,
                "lat": 30.132191433952,
                "children": [
                    {
                        "label": "雁江区",
                        "value": "512002",
                        "cityCode": "512000",
                        "provinceCode": "510000",
                        "lon": 104.75541652784,
                        "lat": 30.091647255037
                    },
                    {
                        "label": "安岳县",
                        "value": "512021",
                        "cityCode": "512000",
                        "provinceCode": "510000",
                        "lon": 105.4008757725,
                        "lat": 29.999677270422
                    },
                    {
                        "label": "乐至县",
                        "value": "512022",
                        "cityCode": "512000",
                        "provinceCode": "510000",
                        "lon": 105.02831576248,
                        "lat": 30.313944636249
                    }
                ]
            },
            {
                "label": "阿坝藏族羌族自治州",
                "value": "513200",
                "provinceCode": "510000",
                "lon": 102.22856468921,
                "lat": 31.905762858339,
                "children": [
                    {
                        "label": "马尔康市",
                        "value": "513201",
                        "cityCode": "513200",
                        "provinceCode": "510000",
                        "lon": 101.9836278113,
                        "lat": 32.007871202647
                    },
                    {
                        "label": "汶川县",
                        "value": "513221",
                        "cityCode": "513200",
                        "provinceCode": "510000",
                        "lon": 103.29431691527,
                        "lat": 31.168774069592
                    },
                    {
                        "label": "理县",
                        "value": "513222",
                        "cityCode": "513200",
                        "provinceCode": "510000",
                        "lon": 103.42033582964,
                        "lat": 31.566906370691
                    },
                    {
                        "label": "茂县",
                        "value": "513223",
                        "cityCode": "513200",
                        "provinceCode": "510000",
                        "lon": 102.8991597236,
                        "lat": 30.367480937958
                    },
                    {
                        "label": "松潘县",
                        "value": "513224",
                        "cityCode": "513200",
                        "provinceCode": "510000",
                        "lon": 103.532712222,
                        "lat": 32.625458557695
                    },
                    {
                        "label": "九寨沟县",
                        "value": "513225",
                        "cityCode": "513200",
                        "provinceCode": "510000",
                        "lon": 103.9340437688,
                        "lat": 33.317446497617
                    },
                    {
                        "label": "金川县",
                        "value": "513226",
                        "cityCode": "513200",
                        "provinceCode": "510000",
                        "lon": 101.80476934386,
                        "lat": 31.52757038818
                    },
                    {
                        "label": "小金县",
                        "value": "513227",
                        "cityCode": "513200",
                        "provinceCode": "510000",
                        "lon": 102.41921664895,
                        "lat": 30.969288643982
                    },
                    {
                        "label": "黑水县",
                        "value": "513228",
                        "cityCode": "513200",
                        "provinceCode": "510000",
                        "lon": 103.01249848065,
                        "lat": 32.052158211237
                    },
                    {
                        "label": "壤塘县",
                        "value": "513230",
                        "cityCode": "513200",
                        "provinceCode": "510000",
                        "lon": 101.05971696123,
                        "lat": 32.148226253207
                    },
                    {
                        "label": "阿坝县",
                        "value": "513231",
                        "cityCode": "513200",
                        "provinceCode": "510000",
                        "lon": 101.70212990273,
                        "lat": 32.916574446999
                    },
                    {
                        "label": "若尔盖县",
                        "value": "513232",
                        "cityCode": "513200",
                        "provinceCode": "510000",
                        "lon": 102.97487609843,
                        "lat": 33.584805758741
                    },
                    {
                        "label": "红原县",
                        "value": "513233",
                        "cityCode": "513200",
                        "provinceCode": "510000",
                        "lon": 102.64115041582,
                        "lat": 32.736132092126
                    }
                ]
            },
            {
                "label": "甘孜藏族自治州",
                "value": "513300",
                "provinceCode": "510000",
                "lon": 101.96923206306,
                "lat": 30.055144114356,
                "children": [
                    {
                        "label": "康定市",
                        "value": "513301",
                        "cityCode": "513300",
                        "provinceCode": "510000",
                        "lon": 101.75312764174,
                        "lat": 29.963390007018
                    },
                    {
                        "label": "泸定县",
                        "value": "513322",
                        "cityCode": "513300",
                        "provinceCode": "510000",
                        "lon": 102.12006613226,
                        "lat": 29.747744290103
                    },
                    {
                        "label": "丹巴县",
                        "value": "513323",
                        "cityCode": "513300",
                        "provinceCode": "510000",
                        "lon": 101.75239771652,
                        "lat": 30.9670743425
                    },
                    {
                        "label": "九龙县",
                        "value": "513324",
                        "cityCode": "513300",
                        "provinceCode": "510000",
                        "lon": 101.63507969271,
                        "lat": 28.917804185231
                    },
                    {
                        "label": "雅江县",
                        "value": "513325",
                        "cityCode": "513300",
                        "provinceCode": "510000",
                        "lon": 100.96923972469,
                        "lat": 29.922924021131
                    },
                    {
                        "label": "道孚县",
                        "value": "513326",
                        "cityCode": "513300",
                        "provinceCode": "510000",
                        "lon": 101.19484158408,
                        "lat": 30.870125609599
                    },
                    {
                        "label": "炉霍县",
                        "value": "513327",
                        "cityCode": "513300",
                        "provinceCode": "510000",
                        "lon": 100.67587127372,
                        "lat": 31.492154542768
                    },
                    {
                        "label": "甘孜县",
                        "value": "513328",
                        "cityCode": "513300",
                        "provinceCode": "510000",
                        "lon": 99.762676935333,
                        "lat": 32.029329338001
                    },
                    {
                        "label": "新龙县",
                        "value": "513329",
                        "cityCode": "513300",
                        "provinceCode": "510000",
                        "lon": 100.28751803177,
                        "lat": 30.945762801068
                    },
                    {
                        "label": "德格县",
                        "value": "513330",
                        "cityCode": "513300",
                        "provinceCode": "510000",
                        "lon": 98.967480948584,
                        "lat": 32.059408545008
                    },
                    {
                        "label": "白玉县",
                        "value": "513331",
                        "cityCode": "513300",
                        "provinceCode": "510000",
                        "lon": 99.291922023716,
                        "lat": 31.052585679081
                    },
                    {
                        "label": "石渠县",
                        "value": "513332",
                        "cityCode": "513300",
                        "provinceCode": "510000",
                        "lon": 98.204993247891,
                        "lat": 33.187627237402
                    },
                    {
                        "label": "色达县",
                        "value": "513333",
                        "cityCode": "513300",
                        "provinceCode": "510000",
                        "lon": 100.21388463777,
                        "lat": 32.356620371592
                    },
                    {
                        "label": "理塘县",
                        "value": "513334",
                        "cityCode": "513300",
                        "provinceCode": "510000",
                        "lon": 100.18511019101,
                        "lat": 29.895282575765
                    },
                    {
                        "label": "巴塘县",
                        "value": "513335",
                        "cityCode": "513300",
                        "provinceCode": "510000",
                        "lon": 99.300290950528,
                        "lat": 29.916287662541
                    },
                    {
                        "label": "乡城县",
                        "value": "513336",
                        "cityCode": "513300",
                        "provinceCode": "510000",
                        "lon": 99.738451912881,
                        "lat": 29.11737591967
                    },
                    {
                        "label": "稻城县",
                        "value": "513337",
                        "cityCode": "513300",
                        "provinceCode": "510000",
                        "lon": 100.26589077053,
                        "lat": 28.766496640591
                    },
                    {
                        "label": "得荣县",
                        "value": "513338",
                        "cityCode": "513300",
                        "provinceCode": "510000",
                        "lon": 99.324235091425,
                        "lat": 28.736358436486
                    }
                ]
            },
            {
                "label": "凉山彝族自治州",
                "value": "513400",
                "provinceCode": "510000",
                "lon": 102.2595908032,
                "lat": 27.892392903666,
                "children": [
                    {
                        "label": "西昌市",
                        "value": "513401",
                        "cityCode": "513400",
                        "provinceCode": "510000",
                        "lon": 102.11788786038,
                        "lat": 27.86337739584
                    },
                    {
                        "label": "木里藏族自治县",
                        "value": "513422",
                        "cityCode": "513400",
                        "provinceCode": "510000",
                        "lon": 100.95305714268,
                        "lat": 28.360344107012
                    },
                    {
                        "label": "盐源县",
                        "value": "513423",
                        "cityCode": "513400",
                        "provinceCode": "510000",
                        "lon": 101.46762448738,
                        "lat": 27.603027908142
                    },
                    {
                        "label": "德昌县",
                        "value": "513424",
                        "cityCode": "513400",
                        "provinceCode": "510000",
                        "lon": 102.19173440069,
                        "lat": 27.331194175431
                    },
                    {
                        "label": "会理县",
                        "value": "513425",
                        "cityCode": "513400",
                        "provinceCode": "510000",
                        "lon": 102.2639270515,
                        "lat": 26.591300796186
                    },
                    {
                        "label": "会东县",
                        "value": "513426",
                        "cityCode": "513400",
                        "provinceCode": "510000",
                        "lon": 102.74296743101,
                        "lat": 26.573608339176
                    },
                    {
                        "label": "宁南县",
                        "value": "513427",
                        "cityCode": "513400",
                        "provinceCode": "510000",
                        "lon": 102.71663446894,
                        "lat": 27.091250349517
                    },
                    {
                        "label": "普格县",
                        "value": "513428",
                        "cityCode": "513400",
                        "provinceCode": "510000",
                        "lon": 102.56809148368,
                        "lat": 27.54828572105
                    },
                    {
                        "label": "布拖县",
                        "value": "513429",
                        "cityCode": "513400",
                        "provinceCode": "510000",
                        "lon": 102.88192797888,
                        "lat": 27.599974195145
                    },
                    {
                        "label": "金阳县",
                        "value": "513430",
                        "cityCode": "513400",
                        "provinceCode": "510000",
                        "lon": 103.20105938361,
                        "lat": 27.706169003934
                    },
                    {
                        "label": "昭觉县",
                        "value": "513431",
                        "cityCode": "513400",
                        "provinceCode": "510000",
                        "lon": 102.83281789781,
                        "lat": 28.013719135153
                    },
                    {
                        "label": "喜德县",
                        "value": "513432",
                        "cityCode": "513400",
                        "provinceCode": "510000",
                        "lon": 102.44996824625,
                        "lat": 28.196488558773
                    },
                    {
                        "label": "冕宁县",
                        "value": "513433",
                        "cityCode": "513400",
                        "provinceCode": "510000",
                        "lon": 102.06891407501,
                        "lat": 28.514858657537
                    },
                    {
                        "label": "越西县",
                        "value": "513434",
                        "cityCode": "513400",
                        "provinceCode": "510000",
                        "lon": 102.6286813356,
                        "lat": 28.592190495109
                    },
                    {
                        "label": "甘洛县",
                        "value": "513435",
                        "cityCode": "513400",
                        "provinceCode": "510000",
                        "lon": 102.76740070722,
                        "lat": 28.974853435967
                    },
                    {
                        "label": "美姑县",
                        "value": "513436",
                        "cityCode": "513400",
                        "provinceCode": "510000",
                        "lon": 103.10172987962,
                        "lat": 28.443545061087
                    },
                    {
                        "label": "雷波县",
                        "value": "513437",
                        "cityCode": "513400",
                        "provinceCode": "510000",
                        "lon": 103.5125046952,
                        "lat": 28.279340727749
                    }
                ]
            }
        ],
        "label": "四川省",
        "value": "510000"
    },
    {
        "country": "china",
        "lon": 106.7349961033,
        "lat": 26.902825927797,
        "children": [
            {
                "label": "贵阳市",
                "value": "520100",
                "provinceCode": "520000",
                "lon": 106.70917709618,
                "lat": 26.629906741441,
                "children": [
                    {
                        "label": "南明区",
                        "value": "520102",
                        "cityCode": "520100",
                        "provinceCode": "520000",
                        "lon": 106.72417349818,
                        "lat": 26.541413272278
                    },
                    {
                        "label": "云岩区",
                        "value": "520103",
                        "cityCode": "520100",
                        "provinceCode": "520000",
                        "lon": 106.71791401556,
                        "lat": 26.6035246503
                    },
                    {
                        "label": "花溪区",
                        "value": "520111",
                        "cityCode": "520100",
                        "provinceCode": "520000",
                        "lon": 106.66527322287,
                        "lat": 26.39791693477
                    },
                    {
                        "label": "乌当区",
                        "value": "520112",
                        "cityCode": "520100",
                        "provinceCode": "520000",
                        "lon": 106.73344967037,
                        "lat": 26.688326312941
                    },
                    {
                        "label": "白云区",
                        "value": "520113",
                        "cityCode": "520100",
                        "provinceCode": "520000",
                        "lon": 106.68674281438,
                        "lat": 26.71973739529
                    },
                    {
                        "label": "观山湖区",
                        "value": "520115",
                        "cityCode": "520100",
                        "provinceCode": "520000",
                        "lon": 106.59533224014,
                        "lat": 26.650328732081
                    },
                    {
                        "label": "开阳县",
                        "value": "520121",
                        "cityCode": "520100",
                        "provinceCode": "520000",
                        "lon": 107.04688065585,
                        "lat": 27.075427307857
                    },
                    {
                        "label": "息烽县",
                        "value": "520122",
                        "cityCode": "520100",
                        "provinceCode": "520000",
                        "lon": 106.68198036543,
                        "lat": 27.150807565921
                    },
                    {
                        "label": "修文县",
                        "value": "520123",
                        "cityCode": "520100",
                        "provinceCode": "520000",
                        "lon": 106.590592735,
                        "lat": 26.931538038107
                    },
                    {
                        "label": "清镇市",
                        "value": "520181",
                        "cityCode": "520100",
                        "provinceCode": "520000",
                        "lon": 106.35381440326,
                        "lat": 26.688621110571
                    }
                ]
            },
            {
                "label": "六盘水市",
                "value": "520200",
                "provinceCode": "520000",
                "lon": 104.85208676007,
                "lat": 26.591866060319,
                "children": [
                    {
                        "label": "钟山区",
                        "value": "520201",
                        "cityCode": "520200",
                        "provinceCode": "520000",
                        "lon": 104.76254690076,
                        "lat": 26.731157002932
                    },
                    {
                        "label": "六枝特区",
                        "value": "520203",
                        "cityCode": "520200",
                        "provinceCode": "520000",
                        "lon": 105.3830336754,
                        "lat": 26.235865065306
                    },
                    {
                        "label": "水城县",
                        "value": "520221",
                        "cityCode": "520200",
                        "provinceCode": "520000",
                        "lon": 104.93035685319,
                        "lat": 26.430546898236
                    }
                ]
            },
            {
                "label": "遵义市",
                "value": "520300",
                "provinceCode": "520000",
                "lon": 106.93126031648,
                "lat": 27.699961377076,
                "children": [
                    {
                        "label": "红花岗区",
                        "value": "520302",
                        "cityCode": "520300",
                        "provinceCode": "520000",
                        "lon": 106.92265113614,
                        "lat": 27.670445028837
                    },
                    {
                        "label": "汇川区",
                        "value": "520303",
                        "cityCode": "520300",
                        "provinceCode": "520000",
                        "lon": 107.00310975556,
                        "lat": 27.887590184121
                    },
                    {
                        "label": "播州区",
                        "value": "520304",
                        "cityCode": "520300",
                        "provinceCode": "520000",
                        "lon": 106.87453374646,
                        "lat": 27.634108765721
                    },
                    {
                        "label": "桐梓县",
                        "value": "520322",
                        "cityCode": "520300",
                        "provinceCode": "520000",
                        "lon": 106.88633093203,
                        "lat": 28.414479762728
                    },
                    {
                        "label": "绥阳县",
                        "value": "520323",
                        "cityCode": "520300",
                        "provinceCode": "520000",
                        "lon": 107.20354220552,
                        "lat": 28.146365347962
                    },
                    {
                        "label": "正安县",
                        "value": "520324",
                        "cityCode": "520300",
                        "provinceCode": "520000",
                        "lon": 107.412773457,
                        "lat": 28.506639188144
                    },
                    {
                        "label": "道真仡佬族苗族自治县",
                        "value": "520325",
                        "cityCode": "520300",
                        "provinceCode": "520000",
                        "lon": 107.61686480802,
                        "lat": 28.934154342524
                    },
                    {
                        "label": "务川仡佬族苗族自治县",
                        "value": "520326",
                        "cityCode": "520300",
                        "provinceCode": "520000",
                        "lon": 107.91993460165,
                        "lat": 28.661403914202
                    },
                    {
                        "label": "凤冈县",
                        "value": "520327",
                        "cityCode": "520300",
                        "provinceCode": "520000",
                        "lon": 107.77157370195,
                        "lat": 27.928826877455
                    },
                    {
                        "label": "湄潭县",
                        "value": "520328",
                        "cityCode": "520300",
                        "provinceCode": "520000",
                        "lon": 107.49167985383,
                        "lat": 27.764873370783
                    },
                    {
                        "label": "余庆县",
                        "value": "520329",
                        "cityCode": "520300",
                        "provinceCode": "520000",
                        "lon": 107.70936003115,
                        "lat": 27.394794444136
                    },
                    {
                        "label": "习水县",
                        "value": "520330",
                        "cityCode": "520300",
                        "provinceCode": "520000",
                        "lon": 106.35892584857,
                        "lat": 28.357319781328
                    },
                    {
                        "label": "赤水市",
                        "value": "520381",
                        "cityCode": "520300",
                        "provinceCode": "520000",
                        "lon": 105.92051307621,
                        "lat": 28.493333651299
                    },
                    {
                        "label": "仁怀市",
                        "value": "520382",
                        "cityCode": "520300",
                        "provinceCode": "520000",
                        "lon": 106.34790800681,
                        "lat": 27.839203217967
                    }
                ]
            },
            {
                "label": "安顺市",
                "value": "520400",
                "provinceCode": "520000",
                "lon": 105.92826996576,
                "lat": 26.228594577737,
                "children": [
                    {
                        "label": "西秀区",
                        "value": "520402",
                        "cityCode": "520400",
                        "provinceCode": "520000",
                        "lon": 106.0600169739,
                        "lat": 26.197376772867
                    },
                    {
                        "label": "平坝区",
                        "value": "520403",
                        "cityCode": "520400",
                        "provinceCode": "520000",
                        "lon": 106.28653433135,
                        "lat": 26.443751196397
                    },
                    {
                        "label": "普定县",
                        "value": "520422",
                        "cityCode": "520400",
                        "provinceCode": "520000",
                        "lon": 105.74269311886,
                        "lat": 26.345747551067
                    },
                    {
                        "label": "镇宁布依族苗族自治县",
                        "value": "520423",
                        "cityCode": "520400",
                        "provinceCode": "520000",
                        "lon": 105.83355264869,
                        "lat": 25.844353005861
                    },
                    {
                        "label": "关岭布依族苗族自治县",
                        "value": "520424",
                        "cityCode": "520400",
                        "provinceCode": "520000",
                        "lon": 105.56872665252,
                        "lat": 25.862190437976
                    },
                    {
                        "label": "紫云苗族布依族自治县",
                        "value": "520425",
                        "cityCode": "520400",
                        "provinceCode": "520000",
                        "lon": 106.18836244554,
                        "lat": 25.700614716072
                    }
                ]
            },
            {
                "label": "毕节市",
                "value": "520500",
                "provinceCode": "520000",
                "lon": 105.33332337117,
                "lat": 27.408562131331,
                "children": [
                    {
                        "label": "七星关区",
                        "value": "520502",
                        "cityCode": "520500",
                        "provinceCode": "520000",
                        "lon": 105.42355760084,
                        "lat": 27.464053316005
                    },
                    {
                        "label": "大方县",
                        "value": "520521",
                        "cityCode": "520500",
                        "provinceCode": "520000",
                        "lon": 105.73720221998,
                        "lat": 27.253059626031
                    },
                    {
                        "label": "黔西县",
                        "value": "520522",
                        "cityCode": "520500",
                        "provinceCode": "520000",
                        "lon": 106.14050275681,
                        "lat": 27.086384569459
                    },
                    {
                        "label": "金沙县",
                        "value": "520523",
                        "cityCode": "520500",
                        "provinceCode": "520000",
                        "lon": 106.22685215924,
                        "lat": 27.471542677862
                    },
                    {
                        "label": "织金县",
                        "value": "520524",
                        "cityCode": "520500",
                        "provinceCode": "520000",
                        "lon": 105.73204873021,
                        "lat": 26.615333373403
                    },
                    {
                        "label": "纳雍县",
                        "value": "520525",
                        "cityCode": "520500",
                        "provinceCode": "520000",
                        "lon": 105.26868668571,
                        "lat": 26.795102083008
                    },
                    {
                        "label": "威宁彝族回族苗族自治县",
                        "value": "520526",
                        "cityCode": "520500",
                        "provinceCode": "520000",
                        "lon": 104.22408619137,
                        "lat": 26.921382002531
                    },
                    {
                        "label": "赫章县",
                        "value": "520527",
                        "cityCode": "520500",
                        "provinceCode": "520000",
                        "lon": 104.5980318783,
                        "lat": 27.15332246261
                    }
                ]
            },
            {
                "label": "铜仁市",
                "value": "520600",
                "provinceCode": "520000",
                "lon": 109.16855802826,
                "lat": 27.674902690624,
                "children": [
                    {
                        "label": "碧江区",
                        "value": "520602",
                        "cityCode": "520600",
                        "provinceCode": "520000",
                        "lon": 109.19370501854,
                        "lat": 27.716136520691
                    },
                    {
                        "label": "万山区",
                        "value": "520603",
                        "cityCode": "520600",
                        "provinceCode": "520000",
                        "lon": 109.11781910744,
                        "lat": 27.546566730898
                    },
                    {
                        "label": "江口县",
                        "value": "520621",
                        "cityCode": "520600",
                        "provinceCode": "520000",
                        "lon": 109.16855802826,
                        "lat": 27.674902690624
                    },
                    {
                        "label": "玉屏侗族自治县",
                        "value": "520622",
                        "cityCode": "520600",
                        "provinceCode": "520000",
                        "lon": 109.00175995258,
                        "lat": 27.337802674507
                    },
                    {
                        "label": "石阡县",
                        "value": "520623",
                        "cityCode": "520600",
                        "provinceCode": "520000",
                        "lon": 108.14106368738,
                        "lat": 27.496152657798
                    },
                    {
                        "label": "思南县",
                        "value": "520624",
                        "cityCode": "520600",
                        "provinceCode": "520000",
                        "lon": 108.19797894198,
                        "lat": 27.856658927235
                    },
                    {
                        "label": "印江土家族苗族自治县",
                        "value": "520625",
                        "cityCode": "520600",
                        "provinceCode": "520000",
                        "lon": 108.52830153805,
                        "lat": 27.986045252865
                    },
                    {
                        "label": "德江县",
                        "value": "520626",
                        "cityCode": "520600",
                        "provinceCode": "520000",
                        "lon": 108.06756938624,
                        "lat": 28.30284362728
                    },
                    {
                        "label": "沿河土家族自治县",
                        "value": "520627",
                        "cityCode": "520600",
                        "provinceCode": "520000",
                        "lon": 108.33962765519,
                        "lat": 28.642296722444
                    },
                    {
                        "label": "松桃苗族自治县",
                        "value": "520628",
                        "cityCode": "520600",
                        "provinceCode": "520000",
                        "lon": 109.16855802826,
                        "lat": 27.674902690624
                    }
                ]
            },
            {
                "label": "黔西南布依族苗族自治州",
                "value": "522300",
                "provinceCode": "520000",
                "lon": 104.90055779825,
                "lat": 25.095148055927,
                "children": [
                    {
                        "label": "兴义市",
                        "value": "522301",
                        "cityCode": "522300",
                        "provinceCode": "520000",
                        "lon": 105.07190822677,
                        "lat": 25.236664590554
                    },
                    {
                        "label": "普安县",
                        "value": "522323",
                        "cityCode": "522300",
                        "provinceCode": "520000",
                        "lon": 105.00016731249,
                        "lat": 25.72781408682
                    },
                    {
                        "label": "晴隆县",
                        "value": "522324",
                        "cityCode": "522300",
                        "provinceCode": "520000",
                        "lon": 105.19013699964,
                        "lat": 25.697662011039
                    },
                    {
                        "label": "贞丰县",
                        "value": "522325",
                        "cityCode": "522300",
                        "provinceCode": "520000",
                        "lon": 105.63574297484,
                        "lat": 25.438979713387
                    },
                    {
                        "label": "望谟县",
                        "value": "522326",
                        "cityCode": "522300",
                        "provinceCode": "520000",
                        "lon": 106.13757227494,
                        "lat": 24.936694569809
                    },
                    {
                        "label": "册亨县",
                        "value": "522327",
                        "cityCode": "522300",
                        "provinceCode": "520000",
                        "lon": 105.79746392761,
                        "lat": 24.940047609962
                    },
                    {
                        "label": "安龙县",
                        "value": "522328",
                        "cityCode": "522300",
                        "provinceCode": "520000",
                        "lon": 105.34855137966,
                        "lat": 24.950885976914
                    }
                ]
            },
            {
                "label": "黔东南苗族侗族自治州",
                "value": "522600",
                "provinceCode": "520000",
                "lon": 107.98535257274,
                "lat": 26.583991766542,
                "children": [
                    {
                        "label": "凯里市",
                        "value": "522601",
                        "cityCode": "522600",
                        "provinceCode": "520000",
                        "lon": 108.03104164859,
                        "lat": 26.670643028177
                    },
                    {
                        "label": "黄平县",
                        "value": "522622",
                        "cityCode": "522600",
                        "provinceCode": "520000",
                        "lon": 108.08892037089,
                        "lat": 26.802372712542
                    },
                    {
                        "label": "施秉县",
                        "value": "522623",
                        "cityCode": "522600",
                        "provinceCode": "520000",
                        "lon": 108.01532489539,
                        "lat": 27.147665744201
                    },
                    {
                        "label": "三穗县",
                        "value": "522624",
                        "cityCode": "522600",
                        "provinceCode": "520000",
                        "lon": 108.76221698279,
                        "lat": 26.940229768581
                    },
                    {
                        "label": "镇远县",
                        "value": "522625",
                        "cityCode": "522600",
                        "provinceCode": "520000",
                        "lon": 108.48422420195,
                        "lat": 26.912627316255
                    },
                    {
                        "label": "岑巩县",
                        "value": "522626",
                        "cityCode": "522600",
                        "provinceCode": "520000",
                        "lon": 108.95781984971,
                        "lat": 27.440109779329
                    },
                    {
                        "label": "天柱县",
                        "value": "522627",
                        "cityCode": "522600",
                        "provinceCode": "520000",
                        "lon": 109.47993207974,
                        "lat": 27.027180472033
                    },
                    {
                        "label": "锦屏县",
                        "value": "522628",
                        "cityCode": "522600",
                        "provinceCode": "520000",
                        "lon": 109.15647562165,
                        "lat": 26.497609137737
                    },
                    {
                        "label": "剑河县",
                        "value": "522629",
                        "cityCode": "522600",
                        "provinceCode": "520000",
                        "lon": 106.7349961033,
                        "lat": 26.902825927797
                    },
                    {
                        "label": "台江县",
                        "value": "522630",
                        "cityCode": "522600",
                        "provinceCode": "520000",
                        "lon": 108.17122222338,
                        "lat": 26.676404735086
                    },
                    {
                        "label": "黎平县",
                        "value": "522631",
                        "cityCode": "522600",
                        "provinceCode": "520000",
                        "lon": 109.33697304601,
                        "lat": 25.938276335425
                    },
                    {
                        "label": "榕江县",
                        "value": "522632",
                        "cityCode": "522600",
                        "provinceCode": "520000",
                        "lon": 108.43782402746,
                        "lat": 26.250544367069
                    },
                    {
                        "label": "从江县",
                        "value": "522633",
                        "cityCode": "522600",
                        "provinceCode": "520000",
                        "lon": 108.78396090306,
                        "lat": 25.758440923722
                    },
                    {
                        "label": "雷山县",
                        "value": "522634",
                        "cityCode": "522600",
                        "provinceCode": "520000",
                        "lon": 108.09819178205,
                        "lat": 26.346498520621
                    },
                    {
                        "label": "麻江县",
                        "value": "522635",
                        "cityCode": "522600",
                        "provinceCode": "520000",
                        "lon": 107.79954768993,
                        "lat": 26.512050397344
                    },
                    {
                        "label": "丹寨县",
                        "value": "522636",
                        "cityCode": "522600",
                        "provinceCode": "520000",
                        "lon": 108.11538894273,
                        "lat": 26.126097716769
                    }
                ]
            },
            {
                "label": "黔南布依族苗族自治州",
                "value": "522700",
                "provinceCode": "520000",
                "lon": 107.52320511006,
                "lat": 26.264535997442,
                "children": [
                    {
                        "label": "都匀市",
                        "value": "522701",
                        "cityCode": "522700",
                        "provinceCode": "520000",
                        "lon": 106.7349961033,
                        "lat": 26.902825927797
                    },
                    {
                        "label": "福泉市",
                        "value": "522702",
                        "cityCode": "522700",
                        "provinceCode": "520000",
                        "lon": 106.7349961033,
                        "lat": 26.902825927797
                    },
                    {
                        "label": "荔波县",
                        "value": "522722",
                        "cityCode": "522700",
                        "provinceCode": "520000",
                        "lon": 107.79056706026,
                        "lat": 25.597752027123
                    },
                    {
                        "label": "贵定县",
                        "value": "522723",
                        "cityCode": "522700",
                        "provinceCode": "520000",
                        "lon": 107.16183225437,
                        "lat": 26.262176502508
                    },
                    {
                        "label": "瓮安县",
                        "value": "522725",
                        "cityCode": "522700",
                        "provinceCode": "520000",
                        "lon": 107.5629905221,
                        "lat": 27.189412906689
                    },
                    {
                        "label": "独山县",
                        "value": "522726",
                        "cityCode": "522700",
                        "provinceCode": "520000",
                        "lon": 107.56375230978,
                        "lat": 25.636840589583
                    },
                    {
                        "label": "平塘县",
                        "value": "522727",
                        "cityCode": "522700",
                        "provinceCode": "520000",
                        "lon": 107.37217138777,
                        "lat": 25.850446129607
                    },
                    {
                        "label": "罗甸县",
                        "value": "522728",
                        "cityCode": "522700",
                        "provinceCode": "520000",
                        "lon": 106.7349961033,
                        "lat": 26.902825927797
                    },
                    {
                        "label": "长顺县",
                        "value": "522729",
                        "cityCode": "522700",
                        "provinceCode": "520000",
                        "lon": 106.40419817264,
                        "lat": 26.000476134172
                    },
                    {
                        "label": "龙里县",
                        "value": "522730",
                        "cityCode": "522700",
                        "provinceCode": "520000",
                        "lon": 107.00653768938,
                        "lat": 26.51764181381
                    },
                    {
                        "label": "惠水县",
                        "value": "522731",
                        "cityCode": "522700",
                        "provinceCode": "520000",
                        "lon": 106.72222309186,
                        "lat": 25.98299665897
                    },
                    {
                        "label": "三都水族自治县",
                        "value": "522732",
                        "cityCode": "522700",
                        "provinceCode": "520000",
                        "lon": 107.95650555321,
                        "lat": 25.852864250197
                    }
                ]
            }
        ],
        "label": "贵州省",
        "value": "520000"
    },
    {
        "country": "china",
        "lon": 101.59295163701,
        "lat": 24.864212795483,
        "children": [
            {
                "label": "昆明市",
                "value": "530100",
                "provinceCode": "530000",
                "lon": 102.71460113878,
                "lat": 25.049153100453,
                "children": [
                    {
                        "label": "五华区",
                        "value": "530102",
                        "cityCode": "530100",
                        "provinceCode": "530000",
                        "lon": 102.64937733166,
                        "lat": 25.261305956605
                    },
                    {
                        "label": "盘龙区",
                        "value": "530103",
                        "cityCode": "530100",
                        "provinceCode": "530000",
                        "lon": 102.76755633841,
                        "lat": 25.274019484219
                    },
                    {
                        "label": "官渡区",
                        "value": "530111",
                        "cityCode": "530100",
                        "provinceCode": "530000",
                        "lon": 102.82881924705,
                        "lat": 25.031310976713
                    },
                    {
                        "label": "西山区",
                        "value": "530112",
                        "cityCode": "530100",
                        "provinceCode": "530000",
                        "lon": 102.60347769299,
                        "lat": 24.983630124462
                    },
                    {
                        "label": "东川区",
                        "value": "530113",
                        "cityCode": "530100",
                        "provinceCode": "530000",
                        "lon": 103.07856150869,
                        "lat": 26.139328854726
                    },
                    {
                        "label": "呈贡区",
                        "value": "530114",
                        "cityCode": "530100",
                        "provinceCode": "530000",
                        "lon": 102.88428310764,
                        "lat": 24.855409037478
                    },
                    {
                        "label": "富民县",
                        "value": "530124",
                        "cityCode": "530100",
                        "provinceCode": "530000",
                        "lon": 102.58410264122,
                        "lat": 25.363439290284
                    },
                    {
                        "label": "宜良县",
                        "value": "530125",
                        "cityCode": "530100",
                        "provinceCode": "530000",
                        "lon": 103.1928154872,
                        "lat": 24.944907933143
                    },
                    {
                        "label": "石林彝族自治县",
                        "value": "530126",
                        "cityCode": "530100",
                        "provinceCode": "530000",
                        "lon": 103.42733563256,
                        "lat": 24.754309493364
                    },
                    {
                        "label": "嵩明县",
                        "value": "530127",
                        "cityCode": "530100",
                        "provinceCode": "530000",
                        "lon": 103.00652503386,
                        "lat": 25.317900180495
                    },
                    {
                        "label": "禄劝彝族苗族自治县",
                        "value": "530128",
                        "cityCode": "530100",
                        "provinceCode": "530000",
                        "lon": 102.59302748518,
                        "lat": 25.943771040548
                    },
                    {
                        "label": "寻甸回族彝族自治县",
                        "value": "530129",
                        "cityCode": "530100",
                        "provinceCode": "530000",
                        "lon": 103.12781347645,
                        "lat": 25.666609835146
                    },
                    {
                        "label": "安宁市",
                        "value": "530181",
                        "cityCode": "530100",
                        "provinceCode": "530000",
                        "lon": 102.39112679952,
                        "lat": 24.852355456268
                    }
                ]
            },
            {
                "label": "曲靖市",
                "value": "530300",
                "provinceCode": "530000",
                "lon": 103.78253888803,
                "lat": 25.520758142871,
                "children": [
                    {
                        "label": "麒麟区",
                        "value": "530302",
                        "cityCode": "530300",
                        "provinceCode": "530000",
                        "lon": 103.91332638626,
                        "lat": 25.360057471573
                    },
                    {
                        "label": "沾益区",
                        "value": "530303",
                        "cityCode": "530300",
                        "provinceCode": "530000",
                        "lon": 103.86810959342,
                        "lat": 25.79421035848
                    },
                    {
                        "label": "陆良县",
                        "value": "530322",
                        "cityCode": "530300",
                        "provinceCode": "530000",
                        "lon": 103.70738599876,
                        "lat": 25.037570538056
                    },
                    {
                        "label": "师宗县",
                        "value": "530323",
                        "cityCode": "530300",
                        "provinceCode": "530000",
                        "lon": 104.12947917517,
                        "lat": 24.680198025566
                    },
                    {
                        "label": "罗平县",
                        "value": "530324",
                        "cityCode": "530300",
                        "provinceCode": "530000",
                        "lon": 104.34927875646,
                        "lat": 24.983157127291
                    },
                    {
                        "label": "富源县",
                        "value": "530325",
                        "cityCode": "530300",
                        "provinceCode": "530000",
                        "lon": 104.36745192446,
                        "lat": 25.467214378875
                    },
                    {
                        "label": "会泽县",
                        "value": "530326",
                        "cityCode": "530300",
                        "provinceCode": "530000",
                        "lon": 103.46854362948,
                        "lat": 26.46221827304
                    },
                    {
                        "label": "宣威市",
                        "value": "530381",
                        "cityCode": "530300",
                        "provinceCode": "530000",
                        "lon": 104.15257073219,
                        "lat": 26.276828622628
                    }
                ]
            },
            {
                "label": "玉溪市",
                "value": "530400",
                "provinceCode": "530000",
                "lon": 102.54506789248,
                "lat": 24.370447134438,
                "children": [
                    {
                        "label": "红塔区",
                        "value": "530402",
                        "cityCode": "530400",
                        "provinceCode": "530000",
                        "lon": 102.49989459797,
                        "lat": 24.369853985289
                    },
                    {
                        "label": "江川区",
                        "value": "530403",
                        "cityCode": "530400",
                        "provinceCode": "530000",
                        "lon": 102.75575323372,
                        "lat": 24.367487731796
                    },
                    {
                        "label": "澄江县",
                        "value": "530422",
                        "cityCode": "530400",
                        "provinceCode": "530000",
                        "lon": 102.94685033975,
                        "lat": 24.678380080254
                    },
                    {
                        "label": "通海县",
                        "value": "530423",
                        "cityCode": "530400",
                        "provinceCode": "530000",
                        "lon": 102.71141640598,
                        "lat": 24.117558495247
                    },
                    {
                        "label": "华宁县",
                        "value": "530424",
                        "cityCode": "530400",
                        "provinceCode": "530000",
                        "lon": 102.99906774243,
                        "lat": 24.284812305871
                    },
                    {
                        "label": "易门县",
                        "value": "530425",
                        "cityCode": "530400",
                        "provinceCode": "530000",
                        "lon": 102.12219715311,
                        "lat": 24.6964042729
                    },
                    {
                        "label": "峨山彝族自治县",
                        "value": "530426",
                        "cityCode": "530400",
                        "provinceCode": "530000",
                        "lon": 102.21924987866,
                        "lat": 24.246114547538
                    },
                    {
                        "label": "新平彝族傣族自治县",
                        "value": "530427",
                        "cityCode": "530400",
                        "provinceCode": "530000",
                        "lon": 101.73913066729,
                        "lat": 24.029740767019
                    },
                    {
                        "label": "元江哈尼族彝族傣族自治县",
                        "value": "530428",
                        "cityCode": "530400",
                        "provinceCode": "530000",
                        "lon": 102.01115013144,
                        "lat": 23.605002999101
                    }
                ]
            },
            {
                "label": "保山市",
                "value": "530500",
                "provinceCode": "530000",
                "lon": 99.177995613278,
                "lat": 25.12048919619,
                "children": [
                    {
                        "label": "隆阳区",
                        "value": "530502",
                        "cityCode": "530500",
                        "provinceCode": "530000",
                        "lon": 99.069046057861,
                        "lat": 25.205265354944
                    },
                    {
                        "label": "施甸县",
                        "value": "530521",
                        "cityCode": "530500",
                        "provinceCode": "530000",
                        "lon": 99.157489563481,
                        "lat": 24.657220496518
                    },
                    {
                        "label": "龙陵县",
                        "value": "530523",
                        "cityCode": "530500",
                        "provinceCode": "530000",
                        "lon": 98.842541709908,
                        "lat": 24.499046233076
                    },
                    {
                        "label": "昌宁县",
                        "value": "530524",
                        "cityCode": "530500",
                        "provinceCode": "530000",
                        "lon": 99.591112178323,
                        "lat": 24.758162812306
                    },
                    {
                        "label": "腾冲市",
                        "value": "530581",
                        "cityCode": "530500",
                        "provinceCode": "530000",
                        "lon": 98.43366397623,
                        "lat": 25.248177969272
                    }
                ]
            },
            {
                "label": "昭通市",
                "value": "530600",
                "provinceCode": "530000",
                "lon": 103.72502065573,
                "lat": 27.340632963635,
                "children": [
                    {
                        "label": "昭阳区",
                        "value": "530602",
                        "cityCode": "530600",
                        "provinceCode": "530000",
                        "lon": 103.60727718737,
                        "lat": 27.427583042152
                    },
                    {
                        "label": "鲁甸县",
                        "value": "530621",
                        "cityCode": "530600",
                        "provinceCode": "530000",
                        "lon": 103.42585557677,
                        "lat": 27.205702890521
                    },
                    {
                        "label": "巧家县",
                        "value": "530622",
                        "cityCode": "530600",
                        "provinceCode": "530000",
                        "lon": 103.13002031079,
                        "lat": 27.008327725094
                    },
                    {
                        "label": "盐津县",
                        "value": "530623",
                        "cityCode": "530600",
                        "provinceCode": "530000",
                        "lon": 104.23053478313,
                        "lat": 28.130706512198
                    },
                    {
                        "label": "大关县",
                        "value": "530624",
                        "cityCode": "530600",
                        "provinceCode": "530000",
                        "lon": 103.91217766939,
                        "lat": 27.905095827254
                    },
                    {
                        "label": "永善县",
                        "value": "530625",
                        "cityCode": "530600",
                        "provinceCode": "530000",
                        "lon": 103.65282254144,
                        "lat": 27.953163331681
                    },
                    {
                        "label": "绥江县",
                        "value": "530626",
                        "cityCode": "530600",
                        "provinceCode": "530000",
                        "lon": 104.01558782767,
                        "lat": 28.538865566801
                    },
                    {
                        "label": "镇雄县",
                        "value": "530627",
                        "cityCode": "530600",
                        "provinceCode": "530000",
                        "lon": 104.83385203039,
                        "lat": 27.568915967438
                    },
                    {
                        "label": "彝良县",
                        "value": "530628",
                        "cityCode": "530600",
                        "provinceCode": "530000",
                        "lon": 104.24144905945,
                        "lat": 27.630986376229
                    },
                    {
                        "label": "威信县",
                        "value": "530629",
                        "cityCode": "530600",
                        "provinceCode": "530000",
                        "lon": 105.05028255746,
                        "lat": 27.891462851573
                    }
                ]
            },
            {
                "label": "丽江市",
                "value": "530700",
                "provinceCode": "530000",
                "lon": 100.22962839888,
                "lat": 26.875351089481,
                "children": [
                    {
                        "label": "古城区",
                        "value": "530702",
                        "cityCode": "530700",
                        "provinceCode": "530000",
                        "lon": 100.32859641682,
                        "lat": 26.859300417703
                    },
                    {
                        "label": "玉龙纳西族自治县",
                        "value": "530721",
                        "cityCode": "530700",
                        "provinceCode": "530000",
                        "lon": 99.951633936724,
                        "lat": 27.104463367195
                    },
                    {
                        "label": "永胜县",
                        "value": "530722",
                        "cityCode": "530700",
                        "provinceCode": "530000",
                        "lon": 100.70492052637,
                        "lat": 26.491706080711
                    },
                    {
                        "label": "华坪县",
                        "value": "530723",
                        "cityCode": "530700",
                        "provinceCode": "530000",
                        "lon": 101.25172921237,
                        "lat": 26.645807144841
                    },
                    {
                        "label": "宁蒗彝族自治县",
                        "value": "530724",
                        "cityCode": "530700",
                        "provinceCode": "530000",
                        "lon": 100.7783019296,
                        "lat": 27.265588579997
                    }
                ]
            },
            {
                "label": "普洱市",
                "value": "530800",
                "provinceCode": "530000",
                "lon": 100.98005773013,
                "lat": 22.788777780149,
                "children": [
                    {
                        "label": "思茅区",
                        "value": "530802",
                        "cityCode": "530800",
                        "provinceCode": "530000",
                        "lon": 100.85525310555,
                        "lat": 22.739133092283
                    },
                    {
                        "label": "宁洱哈尼族彝族自治县",
                        "value": "530821",
                        "cityCode": "530800",
                        "provinceCode": "530000",
                        "lon": 101.19686023959,
                        "lat": 23.097350457989
                    },
                    {
                        "label": "墨江哈尼族自治县",
                        "value": "530822",
                        "cityCode": "530800",
                        "provinceCode": "530000",
                        "lon": 101.55548645512,
                        "lat": 23.363251135433
                    },
                    {
                        "label": "景东彝族自治县",
                        "value": "530823",
                        "cityCode": "530800",
                        "provinceCode": "530000",
                        "lon": 100.79520569746,
                        "lat": 24.39672894394
                    },
                    {
                        "label": "景谷傣族彝族自治县",
                        "value": "530824",
                        "cityCode": "530800",
                        "provinceCode": "530000",
                        "lon": 100.56429126294,
                        "lat": 23.368117190796
                    },
                    {
                        "label": "镇沅彝族哈尼族拉祜族自治县",
                        "value": "530825",
                        "cityCode": "530800",
                        "provinceCode": "530000",
                        "lon": 101.11331766944,
                        "lat": 24.011540716931
                    },
                    {
                        "label": "江城哈尼族彝族自治县",
                        "value": "530826",
                        "cityCode": "530800",
                        "provinceCode": "530000",
                        "lon": 101.79692922563,
                        "lat": 22.625657650356
                    },
                    {
                        "label": "孟连傣族拉祜族佤族自治县",
                        "value": "530827",
                        "cityCode": "530800",
                        "provinceCode": "530000",
                        "lon": 99.580342878181,
                        "lat": 22.334366217371
                    },
                    {
                        "label": "澜沧拉祜族自治县",
                        "value": "530828",
                        "cityCode": "530800",
                        "provinceCode": "530000",
                        "lon": 99.98453733381,
                        "lat": 22.665993561569
                    },
                    {
                        "label": "西盟佤族自治县",
                        "value": "530829",
                        "cityCode": "530800",
                        "provinceCode": "530000",
                        "lon": 99.522119995137,
                        "lat": 22.708423462771
                    }
                ]
            },
            {
                "label": "临沧市",
                "value": "530900",
                "provinceCode": "530000",
                "lon": 100.09261291373,
                "lat": 23.887806103773,
                "children": [
                    {
                        "label": "临翔区",
                        "value": "530902",
                        "cityCode": "530900",
                        "provinceCode": "530000",
                        "lon": 100.13990768016,
                        "lat": 23.849570452879
                    },
                    {
                        "label": "凤庆县",
                        "value": "530921",
                        "cityCode": "530900",
                        "provinceCode": "530000",
                        "lon": 99.92091022745,
                        "lat": 24.610505511987
                    },
                    {
                        "label": "云县",
                        "value": "530922",
                        "cityCode": "530900",
                        "provinceCode": "530000",
                        "lon": 100.23368014335,
                        "lat": 24.32740647676
                    },
                    {
                        "label": "永德县",
                        "value": "530923",
                        "cityCode": "530900",
                        "provinceCode": "530000",
                        "lon": 99.427631734164,
                        "lat": 24.089579787148
                    },
                    {
                        "label": "镇康县",
                        "value": "530924",
                        "cityCode": "530900",
                        "provinceCode": "530000",
                        "lon": 99.005735747996,
                        "lat": 23.901062771813
                    },
                    {
                        "label": "双江拉祜族佤族布朗族傣族自治县",
                        "value": "530925",
                        "cityCode": "530900",
                        "provinceCode": "530000",
                        "lon": 99.840913908222,
                        "lat": 23.476856812064
                    },
                    {
                        "label": "耿马傣族佤族自治县",
                        "value": "530926",
                        "cityCode": "530900",
                        "provinceCode": "530000",
                        "lon": 99.434265495794,
                        "lat": 23.641730399889
                    },
                    {
                        "label": "沧源佤族自治县",
                        "value": "530927",
                        "cityCode": "530900",
                        "provinceCode": "530000",
                        "lon": 99.270497931724,
                        "lat": 23.274581274109
                    }
                ]
            },
            {
                "label": "楚雄彝族自治州",
                "value": "532300",
                "provinceCode": "530000",
                "lon": 101.52938223914,
                "lat": 25.066355674186,
                "children": [
                    {
                        "label": "楚雄市",
                        "value": "532301",
                        "cityCode": "532300",
                        "provinceCode": "530000",
                        "lon": 101.32863799918,
                        "lat": 24.880252472651
                    },
                    {
                        "label": "双柏县",
                        "value": "532322",
                        "cityCode": "532300",
                        "provinceCode": "530000",
                        "lon": 101.64032208579,
                        "lat": 24.535545259465
                    },
                    {
                        "label": "牟定县",
                        "value": "532323",
                        "cityCode": "532300",
                        "provinceCode": "530000",
                        "lon": 101.59675770511,
                        "lat": 25.407356738979
                    },
                    {
                        "label": "南华县",
                        "value": "532324",
                        "cityCode": "532300",
                        "provinceCode": "530000",
                        "lon": 101.0380121979,
                        "lat": 25.103522672439
                    },
                    {
                        "label": "姚安县",
                        "value": "532325",
                        "cityCode": "532300",
                        "provinceCode": "530000",
                        "lon": 101.2112377333,
                        "lat": 25.516954435787
                    },
                    {
                        "label": "大姚县",
                        "value": "532326",
                        "cityCode": "532300",
                        "provinceCode": "530000",
                        "lon": 101.24291307892,
                        "lat": 25.947669905565
                    },
                    {
                        "label": "永仁县",
                        "value": "532327",
                        "cityCode": "532300",
                        "provinceCode": "530000",
                        "lon": 101.56019002604,
                        "lat": 26.143679315458
                    },
                    {
                        "label": "元谋县",
                        "value": "532328",
                        "cityCode": "532300",
                        "provinceCode": "530000",
                        "lon": 101.87051082301,
                        "lat": 25.783195511954
                    },
                    {
                        "label": "武定县",
                        "value": "532329",
                        "cityCode": "532300",
                        "provinceCode": "530000",
                        "lon": 102.20117587964,
                        "lat": 25.731109547237
                    },
                    {
                        "label": "禄丰县",
                        "value": "532331",
                        "cityCode": "532300",
                        "provinceCode": "530000",
                        "lon": 102.02612983069,
                        "lat": 25.185818987516
                    }
                ]
            },
            {
                "label": "红河哈尼族彝族自治州",
                "value": "532500",
                "provinceCode": "530000",
                "lon": 103.38406475716,
                "lat": 23.367717516499,
                "children": [
                    {
                        "label": "个旧市",
                        "value": "532501",
                        "cityCode": "532500",
                        "provinceCode": "530000",
                        "lon": 101.59295163701,
                        "lat": 24.864212795483
                    },
                    {
                        "label": "开远市",
                        "value": "532502",
                        "cityCode": "532500",
                        "provinceCode": "530000",
                        "lon": 101.59295163701,
                        "lat": 24.864212795483
                    },
                    {
                        "label": "蒙自市",
                        "value": "532503",
                        "cityCode": "532500",
                        "provinceCode": "530000",
                        "lon": 103.51669152583,
                        "lat": 23.338656934664
                    },
                    {
                        "label": "弥勒市",
                        "value": "532504",
                        "cityCode": "532500",
                        "provinceCode": "530000",
                        "lon": 103.445318018,
                        "lat": 24.251508766722
                    },
                    {
                        "label": "屏边苗族自治县",
                        "value": "532523",
                        "cityCode": "532500",
                        "provinceCode": "530000",
                        "lon": 103.89743584577,
                        "lat": 23.21267768326
                    },
                    {
                        "label": "建水县",
                        "value": "532524",
                        "cityCode": "532500",
                        "provinceCode": "530000",
                        "lon": 102.79065788154,
                        "lat": 23.987913437671
                    },
                    {
                        "label": "石屏县",
                        "value": "532525",
                        "cityCode": "532500",
                        "provinceCode": "530000",
                        "lon": 102.40773898854,
                        "lat": 23.789535774797
                    },
                    {
                        "label": "泸西县",
                        "value": "532527",
                        "cityCode": "532500",
                        "provinceCode": "530000",
                        "lon": 103.75100845447,
                        "lat": 24.539744740964
                    },
                    {
                        "label": "元阳县",
                        "value": "532528",
                        "cityCode": "532500",
                        "provinceCode": "530000",
                        "lon": 102.73114873474,
                        "lat": 23.141055739179
                    },
                    {
                        "label": "红河县",
                        "value": "532529",
                        "cityCode": "532500",
                        "provinceCode": "530000",
                        "lon": 102.51563446331,
                        "lat": 23.211095049214
                    },
                    {
                        "label": "金平苗族瑶族傣族自治县",
                        "value": "532530",
                        "cityCode": "532500",
                        "provinceCode": "530000",
                        "lon": 103.25176348949,
                        "lat": 22.996373389905
                    },
                    {
                        "label": "绿春县",
                        "value": "532531",
                        "cityCode": "532500",
                        "provinceCode": "530000",
                        "lon": 102.35379214946,
                        "lat": 23.091544011399
                    },
                    {
                        "label": "河口瑶族自治县",
                        "value": "532532",
                        "cityCode": "532500",
                        "provinceCode": "530000",
                        "lon": 103.67125958623,
                        "lat": 22.862620371198
                    }
                ]
            },
            {
                "label": "文山壮族苗族自治州",
                "value": "532600",
                "provinceCode": "530000",
                "lon": 104.24629431757,
                "lat": 23.37408685041,
                "children": [
                    {
                        "label": "文山市",
                        "value": "532601",
                        "cityCode": "532600",
                        "provinceCode": "530000",
                        "lon": 104.03093981246,
                        "lat": 23.416009535072
                    },
                    {
                        "label": "砚山县",
                        "value": "532622",
                        "cityCode": "532600",
                        "provinceCode": "530000",
                        "lon": 104.5218246496,
                        "lat": 23.89947126948
                    },
                    {
                        "label": "西畴县",
                        "value": "532623",
                        "cityCode": "532600",
                        "provinceCode": "530000",
                        "lon": 104.8239553349,
                        "lat": 23.49211237168
                    },
                    {
                        "label": "麻栗坡县",
                        "value": "532624",
                        "cityCode": "532600",
                        "provinceCode": "530000",
                        "lon": 105.06044414168,
                        "lat": 23.433721461415
                    },
                    {
                        "label": "马关县",
                        "value": "532625",
                        "cityCode": "532600",
                        "provinceCode": "530000",
                        "lon": 101.59295163701,
                        "lat": 24.864212795483
                    },
                    {
                        "label": "丘北县",
                        "value": "532626",
                        "cityCode": "532600",
                        "provinceCode": "530000",
                        "lon": 104.34003905514,
                        "lat": 24.08610830304
                    },
                    {
                        "label": "广南县",
                        "value": "532627",
                        "cityCode": "532600",
                        "provinceCode": "530000",
                        "lon": 104.83870730798,
                        "lat": 24.222835784674
                    },
                    {
                        "label": "富宁县",
                        "value": "532628",
                        "cityCode": "532600",
                        "provinceCode": "530000",
                        "lon": 105.60430973793,
                        "lat": 23.396160831269
                    }
                ]
            },
            {
                "label": "西双版纳傣族自治州",
                "value": "532800",
                "provinceCode": "530000",
                "lon": 100.80303827521,
                "lat": 22.009433002236,
                "children": [
                    {
                        "label": "景洪市",
                        "value": "532801",
                        "cityCode": "532800",
                        "provinceCode": "530000",
                        "lon": 101.59295163701,
                        "lat": 24.864212795483
                    },
                    {
                        "label": "勐海县",
                        "value": "532822",
                        "cityCode": "532800",
                        "provinceCode": "530000",
                        "lon": 100.33738150932,
                        "lat": 21.960731038528
                    },
                    {
                        "label": "勐腊县",
                        "value": "532823",
                        "cityCode": "532800",
                        "provinceCode": "530000",
                        "lon": 101.46195902318,
                        "lat": 21.736659717735
                    }
                ]
            },
            {
                "label": "大理白族自治州",
                "value": "532900",
                "provinceCode": "530000",
                "lon": 100.22367478928,
                "lat": 25.596899639421,
                "children": [
                    {
                        "label": "大理市",
                        "value": "532901",
                        "cityCode": "532900",
                        "provinceCode": "530000",
                        "lon": 100.15242712507,
                        "lat": 25.57616489493
                    },
                    {
                        "label": "漾濞彝族自治县",
                        "value": "532922",
                        "cityCode": "532900",
                        "provinceCode": "530000",
                        "lon": 99.898375043674,
                        "lat": 25.605571782134
                    },
                    {
                        "label": "祥云县",
                        "value": "532923",
                        "cityCode": "532900",
                        "provinceCode": "530000",
                        "lon": 100.57035927192,
                        "lat": 25.501610700196
                    },
                    {
                        "label": "宾川县",
                        "value": "532924",
                        "cityCode": "532900",
                        "provinceCode": "530000",
                        "lon": 100.62753770311,
                        "lat": 25.875307433534
                    },
                    {
                        "label": "弥渡县",
                        "value": "532925",
                        "cityCode": "532900",
                        "provinceCode": "530000",
                        "lon": 100.58186613328,
                        "lat": 25.1911077724
                    },
                    {
                        "label": "南涧彝族自治县",
                        "value": "532926",
                        "cityCode": "532900",
                        "provinceCode": "530000",
                        "lon": 100.42490043802,
                        "lat": 24.903013805535
                    },
                    {
                        "label": "巍山彝族回族自治县",
                        "value": "532927",
                        "cityCode": "532900",
                        "provinceCode": "530000",
                        "lon": 100.26759078972,
                        "lat": 25.343492434694
                    },
                    {
                        "label": "永平县",
                        "value": "532928",
                        "cityCode": "532900",
                        "provinceCode": "530000",
                        "lon": 99.600792211043,
                        "lat": 25.374646522171
                    },
                    {
                        "label": "云龙县",
                        "value": "532929",
                        "cityCode": "532900",
                        "provinceCode": "530000",
                        "lon": 99.310077976062,
                        "lat": 25.894118475707
                    },
                    {
                        "label": "洱源县",
                        "value": "532930",
                        "cityCode": "532900",
                        "provinceCode": "530000",
                        "lon": 100.03831537618,
                        "lat": 26.294924841349
                    },
                    {
                        "label": "剑川县",
                        "value": "532931",
                        "cityCode": "532900",
                        "provinceCode": "530000",
                        "lon": 99.750307802477,
                        "lat": 26.439596125001
                    },
                    {
                        "label": "鹤庆县",
                        "value": "532932",
                        "cityCode": "532900",
                        "provinceCode": "530000",
                        "lon": 100.27717450154,
                        "lat": 26.3354536106
                    }
                ]
            },
            {
                "label": "德宏傣族景颇族自治州",
                "value": "533100",
                "provinceCode": "530000",
                "lon": 98.589434287407,
                "lat": 24.441239663008,
                "children": [
                    {
                        "label": "瑞丽市",
                        "value": "533102",
                        "cityCode": "533100",
                        "provinceCode": "530000",
                        "lon": 101.59295163701,
                        "lat": 24.864212795483
                    },
                    {
                        "label": "芒市",
                        "value": "533103",
                        "cityCode": "533100",
                        "provinceCode": "530000",
                        "lon": 98.589434287407,
                        "lat": 24.441239663008
                    },
                    {
                        "label": "梁河县",
                        "value": "533122",
                        "cityCode": "533100",
                        "provinceCode": "530000",
                        "lon": 98.322123152856,
                        "lat": 24.743716502863
                    },
                    {
                        "label": "盈江县",
                        "value": "533123",
                        "cityCode": "533100",
                        "provinceCode": "530000",
                        "lon": 97.950762066645,
                        "lat": 24.706749398739
                    },
                    {
                        "label": "陇川县",
                        "value": "533124",
                        "cityCode": "533100",
                        "provinceCode": "530000",
                        "lon": 97.965384779773,
                        "lat": 24.381370607265
                    }
                ]
            },
            {
                "label": "怒江傈僳族自治州",
                "value": "533300",
                "provinceCode": "530000",
                "lon": 98.859932042482,
                "lat": 25.860676978165,
                "children": [
                    {
                        "label": "泸水市",
                        "value": "533301",
                        "cityCode": "533300",
                        "provinceCode": "530000",
                        "lon": 98.86274058298,
                        "lat": 26.042265332796
                    },
                    {
                        "label": "福贡县",
                        "value": "533323",
                        "cityCode": "533300",
                        "provinceCode": "530000",
                        "lon": 98.86865857308,
                        "lat": 26.996507466856
                    },
                    {
                        "label": "贡山独龙族怒族自治县",
                        "value": "533324",
                        "cityCode": "533300",
                        "provinceCode": "530000",
                        "lon": 101.59295163701,
                        "lat": 24.864212795483
                    },
                    {
                        "label": "兰坪白族普米族自治县",
                        "value": "533325",
                        "cityCode": "533300",
                        "provinceCode": "530000",
                        "lon": 99.117417482927,
                        "lat": 26.443506114149
                    }
                ]
            },
            {
                "label": "迪庆藏族自治州",
                "value": "533400",
                "provinceCode": "530000",
                "lon": 99.713681598883,
                "lat": 27.831029461167,
                "children": [
                    {
                        "label": "香格里拉市",
                        "value": "533401",
                        "cityCode": "533400",
                        "provinceCode": "530000",
                        "lon": 99.85507644287,
                        "lat": 27.866680825387
                    },
                    {
                        "label": "德钦县",
                        "value": "533422",
                        "cityCode": "533400",
                        "provinceCode": "530000",
                        "lon": 99.037553971725,
                        "lat": 28.351417174855
                    },
                    {
                        "label": "维西傈僳族自治县",
                        "value": "533423",
                        "cityCode": "533400",
                        "provinceCode": "530000",
                        "lon": 99.152722827441,
                        "lat": 27.45295793965
                    }
                ]
            }
        ],
        "label": "云南省",
        "value": "530000"
    },
    {
        "country": "china",
        "lon": 89.137981684031,
        "lat": 31.367315402715,
        "children": [
            {
                "label": "拉萨市",
                "value": "540100",
                "provinceCode": "540000",
                "lon": 91.111890895984,
                "lat": 29.662557062057,
                "children": [
                    {
                        "label": "城关区",
                        "value": "540102",
                        "cityCode": "540100",
                        "provinceCode": "540000",
                        "lon": 91.168729990815,
                        "lat": 29.666400338845
                    },
                    {
                        "label": "堆龙德庆区",
                        "value": "540103",
                        "cityCode": "540100",
                        "provinceCode": "540000",
                        "lon": 90.8294509947,
                        "lat": 29.796237760398
                    },
                    {
                        "label": "林周县",
                        "value": "540121",
                        "cityCode": "540100",
                        "provinceCode": "540000",
                        "lon": 91.347042959548,
                        "lat": 30.116477915324
                    },
                    {
                        "label": "当雄县",
                        "value": "540122",
                        "cityCode": "540100",
                        "provinceCode": "540000",
                        "lon": 90.894814857309,
                        "lat": 30.424299479353
                    },
                    {
                        "label": "尼木县",
                        "value": "540123",
                        "cityCode": "540100",
                        "provinceCode": "540000",
                        "lon": 90.095471065982,
                        "lat": 29.603193843519
                    },
                    {
                        "label": "曲水县",
                        "value": "540124",
                        "cityCode": "540100",
                        "provinceCode": "540000",
                        "lon": 90.714553495792,
                        "lat": 29.445004244787
                    },
                    {
                        "label": "墨竹工卡县",
                        "value": "540127",
                        "cityCode": "540100",
                        "provinceCode": "540000",
                        "lon": 92.031891526243,
                        "lat": 29.916717538581
                    }
                ]
            },
            {
                "label": "日喀则市",
                "value": "540200",
                "provinceCode": "540000",
                "lon": 88.956062773518,
                "lat": 29.268160032655,
                "children": [
                    {
                        "label": "桑珠孜区",
                        "value": "540202",
                        "cityCode": "540200",
                        "provinceCode": "540000",
                        "lon": 88.956062773518,
                        "lat": 29.268160032655
                    },
                    {
                        "label": "南木林县",
                        "value": "540221",
                        "cityCode": "540200",
                        "provinceCode": "540000",
                        "lon": 88.956062773518,
                        "lat": 29.268160032655
                    },
                    {
                        "label": "江孜县",
                        "value": "540222",
                        "cityCode": "540200",
                        "provinceCode": "540000",
                        "lon": 88.956062773518,
                        "lat": 29.268160032655
                    },
                    {
                        "label": "定日县",
                        "value": "540223",
                        "cityCode": "540200",
                        "provinceCode": "540000",
                        "lon": 88.956062773518,
                        "lat": 29.268160032655
                    },
                    {
                        "label": "萨迦县",
                        "value": "540224",
                        "cityCode": "540200",
                        "provinceCode": "540000",
                        "lon": 88.956062773518,
                        "lat": 29.268160032655
                    },
                    {
                        "label": "拉孜县",
                        "value": "540225",
                        "cityCode": "540200",
                        "provinceCode": "540000",
                        "lon": 88.956062773518,
                        "lat": 29.268160032655
                    },
                    {
                        "label": "昂仁县",
                        "value": "540226",
                        "cityCode": "540200",
                        "provinceCode": "540000",
                        "lon": 88.956062773518,
                        "lat": 29.268160032655
                    },
                    {
                        "label": "谢通门县",
                        "value": "540227",
                        "cityCode": "540200",
                        "provinceCode": "540000",
                        "lon": 88.956062773518,
                        "lat": 29.268160032655
                    },
                    {
                        "label": "白朗县",
                        "value": "540228",
                        "cityCode": "540200",
                        "provinceCode": "540000",
                        "lon": 89.113585077496,
                        "lat": 28.795794414747
                    },
                    {
                        "label": "仁布县",
                        "value": "540229",
                        "cityCode": "540200",
                        "provinceCode": "540000",
                        "lon": 90.003352252057,
                        "lat": 29.247386928273
                    },
                    {
                        "label": "康马县",
                        "value": "540230",
                        "cityCode": "540200",
                        "provinceCode": "540000",
                        "lon": 88.956062773518,
                        "lat": 29.268160032655
                    },
                    {
                        "label": "定结县",
                        "value": "540231",
                        "cityCode": "540200",
                        "provinceCode": "540000",
                        "lon": 88.956062773518,
                        "lat": 29.268160032655
                    },
                    {
                        "label": "仲巴县",
                        "value": "540232",
                        "cityCode": "540200",
                        "provinceCode": "540000",
                        "lon": 88.956062773518,
                        "lat": 29.268160032655
                    },
                    {
                        "label": "亚东县",
                        "value": "540233",
                        "cityCode": "540200",
                        "provinceCode": "540000",
                        "lon": 88.956062773518,
                        "lat": 29.268160032655
                    },
                    {
                        "label": "吉隆县",
                        "value": "540234",
                        "cityCode": "540200",
                        "provinceCode": "540000",
                        "lon": 88.956062773518,
                        "lat": 29.268160032655
                    },
                    {
                        "label": "聂拉木县",
                        "value": "540235",
                        "cityCode": "540200",
                        "provinceCode": "540000",
                        "lon": 88.956062773518,
                        "lat": 29.268160032655
                    },
                    {
                        "label": "萨嘎县",
                        "value": "540236",
                        "cityCode": "540200",
                        "provinceCode": "540000",
                        "lon": 88.956062773518,
                        "lat": 29.268160032655
                    },
                    {
                        "label": "岗巴县",
                        "value": "540237",
                        "cityCode": "540200",
                        "provinceCode": "540000",
                        "lon": 88.956062773518,
                        "lat": 29.268160032655
                    }
                ]
            },
            {
                "label": "昌都市",
                "value": "540300",
                "provinceCode": "540000",
                "lon": 96.362440472918,
                "lat": 30.510924801158,
                "children": [
                    {
                        "label": "卡若区",
                        "value": "540302",
                        "cityCode": "540300",
                        "provinceCode": "540000",
                        "lon": 97.334535331605,
                        "lat": 31.529862428285
                    },
                    {
                        "label": "江达县",
                        "value": "540321",
                        "cityCode": "540300",
                        "provinceCode": "540000",
                        "lon": 98.118022293299,
                        "lat": 31.780569180094
                    },
                    {
                        "label": "贡觉县",
                        "value": "540322",
                        "cityCode": "540300",
                        "provinceCode": "540000",
                        "lon": 98.426429044036,
                        "lat": 30.736504388643
                    },
                    {
                        "label": "类乌齐县",
                        "value": "540323",
                        "cityCode": "540300",
                        "provinceCode": "540000",
                        "lon": 96.391967073454,
                        "lat": 31.449065979774
                    },
                    {
                        "label": "丁青县",
                        "value": "540324",
                        "cityCode": "540300",
                        "provinceCode": "540000",
                        "lon": 95.522471824657,
                        "lat": 31.685241377535
                    },
                    {
                        "label": "察雅县",
                        "value": "540325",
                        "cityCode": "540300",
                        "provinceCode": "540000",
                        "lon": 97.836858866086,
                        "lat": 30.618372794064
                    },
                    {
                        "label": "八宿县",
                        "value": "540326",
                        "cityCode": "540300",
                        "provinceCode": "540000",
                        "lon": 96.879160712332,
                        "lat": 30.074689806895
                    },
                    {
                        "label": "左贡县",
                        "value": "540327",
                        "cityCode": "540300",
                        "provinceCode": "540000",
                        "lon": 97.887595370154,
                        "lat": 29.444978973304
                    },
                    {
                        "label": "芒康县",
                        "value": "540328",
                        "cityCode": "540300",
                        "provinceCode": "540000",
                        "lon": 98.554769564416,
                        "lat": 29.51433481024
                    },
                    {
                        "label": "洛隆县",
                        "value": "540329",
                        "cityCode": "540300",
                        "provinceCode": "540000",
                        "lon": 95.916491128377,
                        "lat": 30.698457783096
                    },
                    {
                        "label": "边坝县",
                        "value": "540330",
                        "cityCode": "540300",
                        "provinceCode": "540000",
                        "lon": 94.483413447372,
                        "lat": 30.96906728495
                    }
                ]
            },
            {
                "label": "林芝市",
                "value": "540400",
                "provinceCode": "540000",
                "lon": 95.466234246683,
                "lat": 29.128080197802,
                "children": [
                    {
                        "label": "巴宜区",
                        "value": "540402",
                        "cityCode": "540400",
                        "provinceCode": "540000",
                        "lon": 94.375930017941,
                        "lat": 29.813114097649
                    },
                    {
                        "label": "工布江达县",
                        "value": "540421",
                        "cityCode": "540400",
                        "provinceCode": "540000",
                        "lon": 93.262111473599,
                        "lat": 30.032418475925
                    },
                    {
                        "label": "米林县",
                        "value": "540422",
                        "cityCode": "540400",
                        "provinceCode": "540000",
                        "lon": 94.174542402829,
                        "lat": 29.25246445514
                    },
                    {
                        "label": "墨脱县",
                        "value": "540423",
                        "cityCode": "540400",
                        "provinceCode": "540000",
                        "lon": 94.931464872257,
                        "lat": 28.754711260372
                    },
                    {
                        "label": "波密县",
                        "value": "540424",
                        "cityCode": "540400",
                        "provinceCode": "540000",
                        "lon": 95.345896846749,
                        "lat": 30.019416163945
                    },
                    {
                        "label": "察隅县",
                        "value": "540425",
                        "cityCode": "540400",
                        "provinceCode": "540000",
                        "lon": 97.229506149139,
                        "lat": 28.653566547177
                    },
                    {
                        "label": "朗县",
                        "value": "540426",
                        "cityCode": "540400",
                        "provinceCode": "540000",
                        "lon": 93.126863813454,
                        "lat": 29.087717194008
                    }
                ]
            },
            {
                "label": "山南市",
                "value": "540500",
                "provinceCode": "540000",
                "lon": 92.22087273151,
                "lat": 28.354982378107,
                "children": [
                    {
                        "label": "乃东区",
                        "value": "540502",
                        "cityCode": "540500",
                        "provinceCode": "540000",
                        "lon": 91.797519071958,
                        "lat": 29.167743326287
                    },
                    {
                        "label": "扎囊县",
                        "value": "540521",
                        "cityCode": "540500",
                        "provinceCode": "540000",
                        "lon": 91.407298324182,
                        "lat": 29.266820605393
                    },
                    {
                        "label": "贡嘎县",
                        "value": "540522",
                        "cityCode": "540500",
                        "provinceCode": "540000",
                        "lon": 90.860869080783,
                        "lat": 29.240130838536
                    },
                    {
                        "label": "桑日县",
                        "value": "540523",
                        "cityCode": "540500",
                        "provinceCode": "540000",
                        "lon": 92.231280965366,
                        "lat": 29.42065032555
                    },
                    {
                        "label": "琼结县",
                        "value": "540524",
                        "cityCode": "540500",
                        "provinceCode": "540000",
                        "lon": 91.584038524668,
                        "lat": 29.013065914396
                    },
                    {
                        "label": "曲松县",
                        "value": "540525",
                        "cityCode": "540500",
                        "provinceCode": "540000",
                        "lon": 92.237345606421,
                        "lat": 28.954175694618
                    },
                    {
                        "label": "措美县",
                        "value": "540526",
                        "cityCode": "540500",
                        "provinceCode": "540000",
                        "lon": 91.551753322243,
                        "lat": 28.585924343435
                    },
                    {
                        "label": "洛扎县",
                        "value": "540527",
                        "cityCode": "540500",
                        "provinceCode": "540000",
                        "lon": 90.897039902791,
                        "lat": 28.210518915815
                    },
                    {
                        "label": "加查县",
                        "value": "540528",
                        "cityCode": "540500",
                        "provinceCode": "540000",
                        "lon": 92.727658842783,
                        "lat": 29.275255680226
                    },
                    {
                        "label": "隆子县",
                        "value": "540529",
                        "cityCode": "540500",
                        "provinceCode": "540000",
                        "lon": 93.019223010095,
                        "lat": 28.486722025563
                    },
                    {
                        "label": "错那县",
                        "value": "540530",
                        "cityCode": "540500",
                        "provinceCode": "540000",
                        "lon": 92.888732384978,
                        "lat": 27.66585127009
                    },
                    {
                        "label": "浪卡子县",
                        "value": "540531",
                        "cityCode": "540500",
                        "provinceCode": "540000",
                        "lon": 90.702914725708,
                        "lat": 28.732790957089
                    }
                ]
            },
            {
                "label": "阿里地区",
                "value": "542500",
                "provinceCode": "540000",
                "lon": 81.10766868949,
                "lat": 30.404556588325,
                "children": [
                    {
                        "label": "普兰县",
                        "value": "542521",
                        "cityCode": "542500",
                        "provinceCode": "540000",
                        "lon": 81.530582849369,
                        "lat": 30.637119738777
                    },
                    {
                        "label": "札达县",
                        "value": "542522",
                        "cityCode": "542500",
                        "provinceCode": "540000",
                        "lon": 79.552757074516,
                        "lat": 31.553648618356
                    },
                    {
                        "label": "噶尔县",
                        "value": "542523",
                        "cityCode": "542500",
                        "provinceCode": "540000",
                        "lon": 80.315974443536,
                        "lat": 32.005501431945
                    },
                    {
                        "label": "日土县",
                        "value": "542524",
                        "cityCode": "542500",
                        "provinceCode": "540000",
                        "lon": 80.719742169545,
                        "lat": 33.984683055318
                    },
                    {
                        "label": "革吉县",
                        "value": "542525",
                        "cityCode": "542500",
                        "provinceCode": "540000",
                        "lon": 82.03379760961,
                        "lat": 32.057883395434
                    },
                    {
                        "label": "改则县",
                        "value": "542526",
                        "cityCode": "542500",
                        "provinceCode": "540000",
                        "lon": 84.285002167349,
                        "lat": 33.841204623772
                    },
                    {
                        "label": "措勤县",
                        "value": "542527",
                        "cityCode": "542500",
                        "provinceCode": "540000",
                        "lon": 85.210285811396,
                        "lat": 30.749850801541
                    }
                ]
            }
        ],
        "label": "西藏自治区",
        "value": "540000"
    },
    {
        "country": "china",
        "lon": 109.50378929073,
        "lat": 35.860026261323,
        "children": [
            {
                "label": "西安市",
                "value": "610100",
                "provinceCode": "610000",
                "lon": 108.9530982792,
                "lat": 34.277799897831,
                "children": [
                    {
                        "label": "新城区",
                        "value": "610102",
                        "cityCode": "610100",
                        "provinceCode": "610000",
                        "lon": 108.99153865841,
                        "lat": 34.271473780191
                    },
                    {
                        "label": "碑林区",
                        "value": "610103",
                        "cityCode": "610100",
                        "provinceCode": "610000",
                        "lon": 108.96625890407,
                        "lat": 34.255484557671
                    },
                    {
                        "label": "莲湖区",
                        "value": "610104",
                        "cityCode": "610100",
                        "provinceCode": "610000",
                        "lon": 108.91554659362,
                        "lat": 34.273192373169
                    },
                    {
                        "label": "灞桥区",
                        "value": "610111",
                        "cityCode": "610100",
                        "provinceCode": "610000",
                        "lon": 109.10875495118,
                        "lat": 34.303915149746
                    },
                    {
                        "label": "未央区",
                        "value": "610112",
                        "cityCode": "610100",
                        "provinceCode": "610000",
                        "lon": 108.92646199371,
                        "lat": 34.331331489423
                    },
                    {
                        "label": "雁塔区",
                        "value": "610113",
                        "cityCode": "610100",
                        "provinceCode": "610000",
                        "lon": 108.93879042836,
                        "lat": 34.221414918471
                    },
                    {
                        "label": "阎良区",
                        "value": "610114",
                        "cityCode": "610100",
                        "provinceCode": "610000",
                        "lon": 109.31341715315,
                        "lat": 34.686373084486
                    },
                    {
                        "label": "临潼区",
                        "value": "610115",
                        "cityCode": "610100",
                        "provinceCode": "610000",
                        "lon": 109.3104528348,
                        "lat": 34.456277329548
                    },
                    {
                        "label": "长安区",
                        "value": "610116",
                        "cityCode": "610100",
                        "provinceCode": "610000",
                        "lon": 108.87425634018,
                        "lat": 34.066898727937
                    },
                    {
                        "label": "高陵区",
                        "value": "610117",
                        "cityCode": "610100",
                        "provinceCode": "610000",
                        "lon": 109.07152291236,
                        "lat": 34.513346424398
                    },
                    {
                        "label": "蓝田县",
                        "value": "610122",
                        "cityCode": "610100",
                        "provinceCode": "610000",
                        "lon": 109.42339003093,
                        "lat": 34.100786931955
                    },
                    {
                        "label": "周至县",
                        "value": "610124",
                        "cityCode": "610100",
                        "provinceCode": "610000",
                        "lon": 108.11354147874,
                        "lat": 33.953602363476
                    }
                ]
            },
            {
                "label": "铜川市",
                "value": "610200",
                "provinceCode": "610000",
                "lon": 108.9680670134,
                "lat": 34.908367696384,
                "children": [
                    {
                        "label": "王益区",
                        "value": "610202",
                        "cityCode": "610200",
                        "provinceCode": "610000",
                        "lon": 109.06850448637,
                        "lat": 35.070041017281
                    },
                    {
                        "label": "印台区",
                        "value": "610203",
                        "cityCode": "610200",
                        "provinceCode": "610000",
                        "lon": 109.18538598068,
                        "lat": 35.160933883455
                    },
                    {
                        "label": "耀州区",
                        "value": "610204",
                        "cityCode": "610200",
                        "provinceCode": "610000",
                        "lon": 108.8354996676,
                        "lat": 35.032000358937
                    },
                    {
                        "label": "宜君县",
                        "value": "610222",
                        "cityCode": "610200",
                        "provinceCode": "610000",
                        "lon": 109.20440179145,
                        "lat": 35.383901876425
                    }
                ]
            },
            {
                "label": "宝鸡市",
                "value": "610300",
                "provinceCode": "610000",
                "lon": 107.17064545238,
                "lat": 34.364080809748,
                "children": [
                    {
                        "label": "渭滨区",
                        "value": "610302",
                        "cityCode": "610300",
                        "provinceCode": "610000",
                        "lon": 107.10824439064,
                        "lat": 34.311027035867
                    },
                    {
                        "label": "金台区",
                        "value": "610303",
                        "cityCode": "610300",
                        "provinceCode": "610000",
                        "lon": 107.11761362728,
                        "lat": 34.40317453128
                    },
                    {
                        "label": "陈仓区",
                        "value": "610304",
                        "cityCode": "610300",
                        "provinceCode": "610000",
                        "lon": 106.92358089475,
                        "lat": 34.482540082479
                    },
                    {
                        "label": "凤翔县",
                        "value": "610322",
                        "cityCode": "610300",
                        "provinceCode": "610000",
                        "lon": 107.43678881989,
                        "lat": 34.577025723794
                    },
                    {
                        "label": "岐山县",
                        "value": "610323",
                        "cityCode": "610300",
                        "provinceCode": "610000",
                        "lon": 107.68898501373,
                        "lat": 34.410705264779
                    },
                    {
                        "label": "扶风县",
                        "value": "610324",
                        "cityCode": "610300",
                        "provinceCode": "610000",
                        "lon": 107.92510162193,
                        "lat": 34.41197448025
                    },
                    {
                        "label": "眉县",
                        "value": "610326",
                        "cityCode": "610300",
                        "provinceCode": "610000",
                        "lon": 107.83384402175,
                        "lat": 34.150539928532
                    },
                    {
                        "label": "陇县",
                        "value": "610327",
                        "cityCode": "610300",
                        "provinceCode": "610000",
                        "lon": 106.7730643229,
                        "lat": 34.876941335239
                    },
                    {
                        "label": "千阳县",
                        "value": "610328",
                        "cityCode": "610300",
                        "provinceCode": "610000",
                        "lon": 107.17797400373,
                        "lat": 34.766951491427
                    },
                    {
                        "label": "麟游县",
                        "value": "610329",
                        "cityCode": "610300",
                        "provinceCode": "610000",
                        "lon": 107.71077450759,
                        "lat": 34.785692691421
                    },
                    {
                        "label": "凤县",
                        "value": "610330",
                        "cityCode": "610300",
                        "provinceCode": "610000",
                        "lon": 106.76610395886,
                        "lat": 33.993251781372
                    },
                    {
                        "label": "太白县",
                        "value": "610331",
                        "cityCode": "610300",
                        "provinceCode": "610000",
                        "lon": 107.4168652793,
                        "lat": 33.94297244023
                    }
                ]
            },
            {
                "label": "咸阳市",
                "value": "610400",
                "provinceCode": "610000",
                "lon": 108.7075092782,
                "lat": 34.345372995999,
                "children": [
                    {
                        "label": "秦都区",
                        "value": "610402",
                        "cityCode": "610400",
                        "provinceCode": "610000",
                        "lon": 108.68341537696,
                        "lat": 34.354285427987
                    },
                    {
                        "label": "杨陵区",
                        "value": "610403",
                        "cityCode": "610400",
                        "provinceCode": "610000",
                        "lon": 108.05873803758,
                        "lat": 34.290198720106
                    },
                    {
                        "label": "渭城区",
                        "value": "610404",
                        "cityCode": "610400",
                        "provinceCode": "610000",
                        "lon": 108.81731239458,
                        "lat": 34.423852572977
                    },
                    {
                        "label": "三原县",
                        "value": "610422",
                        "cityCode": "610400",
                        "provinceCode": "610000",
                        "lon": 108.98069993821,
                        "lat": 34.703211629709
                    },
                    {
                        "label": "泾阳县",
                        "value": "610423",
                        "cityCode": "610400",
                        "provinceCode": "610000",
                        "lon": 108.78075311312,
                        "lat": 34.608867001852
                    },
                    {
                        "label": "乾县",
                        "value": "610424",
                        "cityCode": "610400",
                        "provinceCode": "610000",
                        "lon": 108.22948289516,
                        "lat": 34.527672579796
                    },
                    {
                        "label": "礼泉县",
                        "value": "610425",
                        "cityCode": "610400",
                        "provinceCode": "610000",
                        "lon": 108.48256879405,
                        "lat": 34.597853791406
                    },
                    {
                        "label": "永寿县",
                        "value": "610426",
                        "cityCode": "610400",
                        "provinceCode": "610000",
                        "lon": 108.13671381859,
                        "lat": 34.777655607134
                    },
                    {
                        "label": "长武县",
                        "value": "610428",
                        "cityCode": "610400",
                        "provinceCode": "610000",
                        "lon": 107.83479969951,
                        "lat": 35.170581688184
                    },
                    {
                        "label": "旬邑县",
                        "value": "610429",
                        "cityCode": "610400",
                        "provinceCode": "610000",
                        "lon": 108.49412543869,
                        "lat": 35.216832056498
                    },
                    {
                        "label": "淳化县",
                        "value": "610430",
                        "cityCode": "610400",
                        "provinceCode": "610000",
                        "lon": 108.57021884883,
                        "lat": 34.869115751197
                    },
                    {
                        "label": "武功县",
                        "value": "610431",
                        "cityCode": "610400",
                        "provinceCode": "610000",
                        "lon": 108.19099325441,
                        "lat": 34.316553316648
                    },
                    {
                        "label": "兴平市",
                        "value": "610481",
                        "cityCode": "610400",
                        "provinceCode": "610000",
                        "lon": 108.47576040598,
                        "lat": 34.307609399651
                    }
                ]
            },
            {
                "label": "渭南市",
                "value": "610500",
                "provinceCode": "610000",
                "lon": 109.48393269658,
                "lat": 34.502357975829,
                "children": [
                    {
                        "label": "临渭区",
                        "value": "610502",
                        "cityCode": "610500",
                        "provinceCode": "610000",
                        "lon": 109.56474625615,
                        "lat": 34.553520116268
                    },
                    {
                        "label": "华州区",
                        "value": "610503",
                        "cityCode": "610500",
                        "provinceCode": "610000",
                        "lon": 109.82852431434,
                        "lat": 34.420454032973
                    },
                    {
                        "label": "潼关县",
                        "value": "610522",
                        "cityCode": "610500",
                        "provinceCode": "610000",
                        "lon": 110.29554551613,
                        "lat": 34.507137056057
                    },
                    {
                        "label": "大荔县",
                        "value": "610523",
                        "cityCode": "610500",
                        "provinceCode": "610000",
                        "lon": 110.01194954265,
                        "lat": 34.796840374649
                    },
                    {
                        "label": "合阳县",
                        "value": "610524",
                        "cityCode": "610500",
                        "provinceCode": "610000",
                        "lon": 110.19110357566,
                        "lat": 35.208388187296
                    },
                    {
                        "label": "澄城县",
                        "value": "610525",
                        "cityCode": "610500",
                        "provinceCode": "610000",
                        "lon": 109.90160517601,
                        "lat": 35.222564490705
                    },
                    {
                        "label": "蒲城县",
                        "value": "610526",
                        "cityCode": "610500",
                        "provinceCode": "610000",
                        "lon": 109.62824611949,
                        "lat": 34.967696650545
                    },
                    {
                        "label": "白水县",
                        "value": "610527",
                        "cityCode": "610500",
                        "provinceCode": "610000",
                        "lon": 109.5701661435,
                        "lat": 35.271645917395
                    },
                    {
                        "label": "富平县",
                        "value": "610528",
                        "cityCode": "610500",
                        "provinceCode": "610000",
                        "lon": 109.23593971498,
                        "lat": 34.879423511794
                    },
                    {
                        "label": "韩城市",
                        "value": "610581",
                        "cityCode": "610500",
                        "provinceCode": "610000",
                        "lon": 110.39377368099,
                        "lat": 35.582782138309
                    },
                    {
                        "label": "华阴市",
                        "value": "610582",
                        "cityCode": "610500",
                        "provinceCode": "610000",
                        "lon": 110.05818818766,
                        "lat": 34.532717876993
                    }
                ]
            },
            {
                "label": "延安市",
                "value": "610600",
                "provinceCode": "610000",
                "lon": 109.50050975697,
                "lat": 36.60332035226,
                "children": [
                    {
                        "label": "宝塔区",
                        "value": "610602",
                        "cityCode": "610600",
                        "provinceCode": "610000",
                        "lon": 109.64860224516,
                        "lat": 36.575992490922
                    },
                    {
                        "label": "安塞区",
                        "value": "610603",
                        "cityCode": "610600",
                        "provinceCode": "610000",
                        "lon": 109.15556502968,
                        "lat": 36.926615808304
                    },
                    {
                        "label": "延长县",
                        "value": "610621",
                        "cityCode": "610600",
                        "provinceCode": "610000",
                        "lon": 110.13820395785,
                        "lat": 36.543668537707
                    },
                    {
                        "label": "延川县",
                        "value": "610622",
                        "cityCode": "610600",
                        "provinceCode": "610000",
                        "lon": 110.08409714122,
                        "lat": 36.88242672637
                    },
                    {
                        "label": "志丹县",
                        "value": "610625",
                        "cityCode": "610600",
                        "provinceCode": "610000",
                        "lon": 108.66244666802,
                        "lat": 36.753503067474
                    },
                    {
                        "label": "吴起县",
                        "value": "610626",
                        "cityCode": "610600",
                        "provinceCode": "610000",
                        "lon": 108.12948505986,
                        "lat": 36.985223505156
                    },
                    {
                        "label": "甘泉县",
                        "value": "610627",
                        "cityCode": "610600",
                        "provinceCode": "610000",
                        "lon": 109.18223909796,
                        "lat": 36.353544169394
                    },
                    {
                        "label": "富县",
                        "value": "610628",
                        "cityCode": "610600",
                        "provinceCode": "610000",
                        "lon": 109.04960350294,
                        "lat": 36.017427088571
                    },
                    {
                        "label": "洛川县",
                        "value": "610629",
                        "cityCode": "610600",
                        "provinceCode": "610000",
                        "lon": 109.56098175038,
                        "lat": 35.744158257757
                    },
                    {
                        "label": "宜川县",
                        "value": "610630",
                        "cityCode": "610600",
                        "provinceCode": "610000",
                        "lon": 110.19112656349,
                        "lat": 36.071139382475
                    },
                    {
                        "label": "黄龙县",
                        "value": "610631",
                        "cityCode": "610600",
                        "provinceCode": "610000",
                        "lon": 109.94510069451,
                        "lat": 35.702635706301
                    },
                    {
                        "label": "黄陵县",
                        "value": "610632",
                        "cityCode": "610600",
                        "provinceCode": "610000",
                        "lon": 108.95305831904,
                        "lat": 35.62841424749
                    }
                ]
            },
            {
                "label": "汉中市",
                "value": "610700",
                "provinceCode": "610000",
                "lon": 107.04547762873,
                "lat": 33.081568978158,
                "children": [
                    {
                        "label": "汉台区",
                        "value": "610702",
                        "cityCode": "610700",
                        "provinceCode": "610000",
                        "lon": 107.04616716185,
                        "lat": 33.187204162513
                    },
                    {
                        "label": "城固县",
                        "value": "610722",
                        "cityCode": "610700",
                        "provinceCode": "610000",
                        "lon": 107.26083703889,
                        "lat": 33.223582827388
                    },
                    {
                        "label": "洋县",
                        "value": "610723",
                        "cityCode": "610700",
                        "provinceCode": "610000",
                        "lon": 107.61609308741,
                        "lat": 33.371586660725
                    },
                    {
                        "label": "西乡县",
                        "value": "610724",
                        "cityCode": "610700",
                        "provinceCode": "610000",
                        "lon": 107.75371241439,
                        "lat": 32.894902801657
                    },
                    {
                        "label": "勉县",
                        "value": "610725",
                        "cityCode": "610700",
                        "provinceCode": "610000",
                        "lon": 106.66457828015,
                        "lat": 33.243885511916
                    },
                    {
                        "label": "宁强县",
                        "value": "610726",
                        "cityCode": "610700",
                        "provinceCode": "610000",
                        "lon": 106.14087102725,
                        "lat": 32.914183257269
                    },
                    {
                        "label": "略阳县",
                        "value": "610727",
                        "cityCode": "610700",
                        "provinceCode": "610000",
                        "lon": 106.16283351204,
                        "lat": 33.385373533804
                    },
                    {
                        "label": "镇巴县",
                        "value": "610728",
                        "cityCode": "610700",
                        "provinceCode": "610000",
                        "lon": 107.88277388136,
                        "lat": 32.517415574628
                    },
                    {
                        "label": "留坝县",
                        "value": "610729",
                        "cityCode": "610700",
                        "provinceCode": "610000",
                        "lon": 106.95962831346,
                        "lat": 33.612960467486
                    },
                    {
                        "label": "佛坪县",
                        "value": "610730",
                        "cityCode": "610700",
                        "provinceCode": "610000",
                        "lon": 107.92883622761,
                        "lat": 33.549939112272
                    }
                ]
            },
            {
                "label": "榆林市",
                "value": "610800",
                "provinceCode": "610000",
                "lon": 109.74592574433,
                "lat": 38.279439240071,
                "children": [
                    {
                        "label": "榆阳区",
                        "value": "610802",
                        "cityCode": "610800",
                        "provinceCode": "610000",
                        "lon": 109.64269245717,
                        "lat": 38.386406641165
                    },
                    {
                        "label": "横山区",
                        "value": "610803",
                        "cityCode": "610800",
                        "provinceCode": "610000",
                        "lon": 109.50067321533,
                        "lat": 37.80809785663
                    },
                    {
                        "label": "府谷县",
                        "value": "610822",
                        "cityCode": "610800",
                        "provinceCode": "610000",
                        "lon": 110.86693418362,
                        "lat": 39.187272466272
                    },
                    {
                        "label": "靖边县",
                        "value": "610824",
                        "cityCode": "610800",
                        "provinceCode": "610000",
                        "lon": 108.81325925462,
                        "lat": 37.484215805492
                    },
                    {
                        "label": "定边县",
                        "value": "610825",
                        "cityCode": "610800",
                        "provinceCode": "610000",
                        "lon": 107.7542930803,
                        "lat": 37.388791134452
                    },
                    {
                        "label": "绥德县",
                        "value": "610826",
                        "cityCode": "610800",
                        "provinceCode": "610000",
                        "lon": 110.39614377168,
                        "lat": 37.520861333414
                    },
                    {
                        "label": "米脂县",
                        "value": "610827",
                        "cityCode": "610800",
                        "provinceCode": "610000",
                        "lon": 110.18690099232,
                        "lat": 37.8285293893
                    },
                    {
                        "label": "佳县",
                        "value": "610828",
                        "cityCode": "610800",
                        "provinceCode": "610000",
                        "lon": 110.37373997088,
                        "lat": 38.078380449363
                    },
                    {
                        "label": "吴堡县",
                        "value": "610829",
                        "cityCode": "610800",
                        "provinceCode": "610000",
                        "lon": 110.69187682122,
                        "lat": 37.594879166095
                    },
                    {
                        "label": "清涧县",
                        "value": "610830",
                        "cityCode": "610800",
                        "provinceCode": "610000",
                        "lon": 110.28929412737,
                        "lat": 37.187443767355
                    },
                    {
                        "label": "子洲县",
                        "value": "610831",
                        "cityCode": "610800",
                        "provinceCode": "610000",
                        "lon": 109.8772926757,
                        "lat": 37.533672486299
                    }
                ]
            },
            {
                "label": "安康市",
                "value": "610900",
                "provinceCode": "610000",
                "lon": 109.03804456348,
                "lat": 32.704370449994,
                "children": [
                    {
                        "label": "汉滨区",
                        "value": "610902",
                        "cityCode": "610900",
                        "provinceCode": "610000",
                        "lon": 108.89624328129,
                        "lat": 32.814464034575
                    },
                    {
                        "label": "汉阴县",
                        "value": "610921",
                        "cityCode": "610900",
                        "provinceCode": "610000",
                        "lon": 108.49695491326,
                        "lat": 32.902520654164
                    },
                    {
                        "label": "石泉县",
                        "value": "610922",
                        "cityCode": "610900",
                        "provinceCode": "610000",
                        "lon": 108.25051841167,
                        "lat": 33.065316023116
                    },
                    {
                        "label": "宁陕县",
                        "value": "610923",
                        "cityCode": "610900",
                        "provinceCode": "610000",
                        "lon": 108.45179634269,
                        "lat": 33.536923574813
                    },
                    {
                        "label": "紫阳县",
                        "value": "610924",
                        "cityCode": "610900",
                        "provinceCode": "610000",
                        "lon": 108.44482568913,
                        "lat": 32.448942187958
                    },
                    {
                        "label": "岚皋县",
                        "value": "610925",
                        "cityCode": "610900",
                        "provinceCode": "610000",
                        "lon": 108.88718069832,
                        "lat": 32.242470474479
                    },
                    {
                        "label": "平利县",
                        "value": "610926",
                        "cityCode": "610900",
                        "provinceCode": "610000",
                        "lon": 109.2703969757,
                        "lat": 32.291256567392
                    },
                    {
                        "label": "镇坪县",
                        "value": "610927",
                        "cityCode": "610900",
                        "provinceCode": "610000",
                        "lon": 109.45671118087,
                        "lat": 31.939261564672
                    },
                    {
                        "label": "旬阳县",
                        "value": "610928",
                        "cityCode": "610900",
                        "provinceCode": "610000",
                        "lon": 109.42357994353,
                        "lat": 32.902076990198
                    },
                    {
                        "label": "白河县",
                        "value": "610929",
                        "cityCode": "610900",
                        "provinceCode": "610000",
                        "lon": 109.91837503137,
                        "lat": 32.729864671398
                    }
                ]
            },
            {
                "label": "商洛市",
                "value": "611000",
                "provinceCode": "610000",
                "lon": 109.9342081538,
                "lat": 33.873907395085,
                "children": [
                    {
                        "label": "商州区",
                        "value": "611002",
                        "cityCode": "611000",
                        "provinceCode": "610000",
                        "lon": 109.87327053686,
                        "lat": 33.895484903711
                    },
                    {
                        "label": "洛南县",
                        "value": "611021",
                        "cityCode": "611000",
                        "provinceCode": "610000",
                        "lon": 110.27264280953,
                        "lat": 34.16568436231
                    },
                    {
                        "label": "丹凤县",
                        "value": "611022",
                        "cityCode": "611000",
                        "provinceCode": "610000",
                        "lon": 110.44379951579,
                        "lat": 33.684553642613
                    },
                    {
                        "label": "商南县",
                        "value": "611023",
                        "cityCode": "611000",
                        "provinceCode": "610000",
                        "lon": 110.76653283748,
                        "lat": 33.411702755168
                    },
                    {
                        "label": "山阳县",
                        "value": "611024",
                        "cityCode": "611000",
                        "provinceCode": "610000",
                        "lon": 109.98131923576,
                        "lat": 33.427684397681
                    },
                    {
                        "label": "镇安县",
                        "value": "611025",
                        "cityCode": "611000",
                        "provinceCode": "610000",
                        "lon": 109.07737051732,
                        "lat": 33.380938764863
                    },
                    {
                        "label": "柞水县",
                        "value": "611026",
                        "cityCode": "611000",
                        "provinceCode": "610000",
                        "lon": 109.28054880136,
                        "lat": 33.695399655075
                    }
                ]
            }
        ],
        "label": "陕西省",
        "value": "610000"
    },
    {
        "country": "china",
        "lon": 102.45762459934,
        "lat": 38.103267343752,
        "children": [
            {
                "label": "兰州市",
                "value": "620100",
                "provinceCode": "620000",
                "lon": 103.82330544073,
                "lat": 36.064225525043,
                "children": [
                    {
                        "label": "城关区",
                        "value": "620102",
                        "cityCode": "620100",
                        "provinceCode": "620000",
                        "lon": 103.85157116258,
                        "lat": 36.054008131567
                    },
                    {
                        "label": "七里河区",
                        "value": "620103",
                        "cityCode": "620100",
                        "provinceCode": "620000",
                        "lon": 103.77199449949,
                        "lat": 35.992495346876
                    },
                    {
                        "label": "西固区",
                        "value": "620104",
                        "cityCode": "620100",
                        "provinceCode": "620000",
                        "lon": 103.56267979363,
                        "lat": 36.106471763711
                    },
                    {
                        "label": "安宁区",
                        "value": "620105",
                        "cityCode": "620100",
                        "provinceCode": "620000",
                        "lon": 103.7191558999,
                        "lat": 36.11552303805
                    },
                    {
                        "label": "红古区",
                        "value": "620111",
                        "cityCode": "620100",
                        "provinceCode": "620000",
                        "lon": 103.06027548801,
                        "lat": 36.303488391492
                    },
                    {
                        "label": "永登县",
                        "value": "620121",
                        "cityCode": "620100",
                        "provinceCode": "620000",
                        "lon": 103.25279353462,
                        "lat": 36.616923609035
                    },
                    {
                        "label": "皋兰县",
                        "value": "620122",
                        "cityCode": "620100",
                        "provinceCode": "620000",
                        "lon": 103.89046691011,
                        "lat": 36.394687882673
                    },
                    {
                        "label": "榆中县",
                        "value": "620123",
                        "cityCode": "620100",
                        "provinceCode": "620000",
                        "lon": 104.244289521,
                        "lat": 35.999785042711
                    }
                ]
            },
            {
                "label": "嘉峪关市",
                "value": "620200",
                "provinceCode": "620000",
                "lon": 98.281634585257,
                "lat": 39.802397326734,
                "children": [
                    {
                        "label": "嘉峪关市",
                        "value": "620201",
                        "cityCode": "620200",
                        "provinceCode": "620000",
                        "lon": 98.281634585257,
                        "lat": 39.802397326734
                    }
                ]
            },
            {
                "label": "金昌市",
                "value": "620300",
                "provinceCode": "620000",
                "lon": 102.20812626259,
                "lat": 38.516071799532,
                "children": [
                    {
                        "label": "金川区",
                        "value": "620302",
                        "cityCode": "620300",
                        "provinceCode": "620000",
                        "lon": 102.32867993808,
                        "lat": 38.492171668259
                    },
                    {
                        "label": "永昌县",
                        "value": "620321",
                        "cityCode": "620300",
                        "provinceCode": "620000",
                        "lon": 102.03431627622,
                        "lat": 38.433409665467
                    }
                ]
            },
            {
                "label": "白银市",
                "value": "620400",
                "provinceCode": "620000",
                "lon": 104.17124090374,
                "lat": 36.546681706163,
                "children": [
                    {
                        "label": "白银区",
                        "value": "620402",
                        "cityCode": "620400",
                        "provinceCode": "620000",
                        "lon": 104.2056493285,
                        "lat": 36.50182182871
                    },
                    {
                        "label": "平川区",
                        "value": "620403",
                        "cityCode": "620400",
                        "provinceCode": "620000",
                        "lon": 104.94560896536,
                        "lat": 36.690350490926
                    },
                    {
                        "label": "靖远县",
                        "value": "620421",
                        "cityCode": "620400",
                        "provinceCode": "620000",
                        "lon": 104.73232686762,
                        "lat": 36.749103432427
                    },
                    {
                        "label": "会宁县",
                        "value": "620422",
                        "cityCode": "620400",
                        "provinceCode": "620000",
                        "lon": 105.10186095322,
                        "lat": 35.963481743844
                    },
                    {
                        "label": "景泰县",
                        "value": "620423",
                        "cityCode": "620400",
                        "provinceCode": "620000",
                        "lon": 104.06166772084,
                        "lat": 37.14607896393
                    }
                ]
            },
            {
                "label": "天水市",
                "value": "620500",
                "provinceCode": "620000",
                "lon": 105.73693162286,
                "lat": 34.584319418869,
                "children": [
                    {
                        "label": "秦州区",
                        "value": "620502",
                        "cityCode": "620500",
                        "provinceCode": "620000",
                        "lon": 105.58117092709,
                        "lat": 34.344448280622
                    },
                    {
                        "label": "麦积区",
                        "value": "620503",
                        "cityCode": "620500",
                        "provinceCode": "620000",
                        "lon": 106.05204030761,
                        "lat": 34.520218471455
                    },
                    {
                        "label": "清水县",
                        "value": "620521",
                        "cityCode": "620500",
                        "provinceCode": "620000",
                        "lon": 106.14008000664,
                        "lat": 34.74252730496
                    },
                    {
                        "label": "秦安县",
                        "value": "620522",
                        "cityCode": "620500",
                        "provinceCode": "620000",
                        "lon": 105.69804091114,
                        "lat": 34.953499919918
                    },
                    {
                        "label": "甘谷县",
                        "value": "620523",
                        "cityCode": "620500",
                        "provinceCode": "620000",
                        "lon": 105.27453175252,
                        "lat": 34.809420550799
                    },
                    {
                        "label": "武山县",
                        "value": "620524",
                        "cityCode": "620500",
                        "provinceCode": "620000",
                        "lon": 104.88672977677,
                        "lat": 34.680181826047
                    },
                    {
                        "label": "张家川回族自治县",
                        "value": "620525",
                        "cityCode": "620500",
                        "provinceCode": "620000",
                        "lon": 106.28213682392,
                        "lat": 34.995955449082
                    }
                ]
            },
            {
                "label": "武威市",
                "value": "620600",
                "provinceCode": "620000",
                "lon": 102.64014734337,
                "lat": 37.933172142906,
                "children": [
                    {
                        "label": "凉州区",
                        "value": "620602",
                        "cityCode": "620600",
                        "provinceCode": "620000",
                        "lon": 102.75947740159,
                        "lat": 37.916272406996
                    },
                    {
                        "label": "民勤县",
                        "value": "620621",
                        "cityCode": "620600",
                        "provinceCode": "620000",
                        "lon": 103.20247261178,
                        "lat": 38.827727985281
                    },
                    {
                        "label": "古浪县",
                        "value": "620622",
                        "cityCode": "620600",
                        "provinceCode": "620000",
                        "lon": 103.34292346491,
                        "lat": 37.531271711364
                    },
                    {
                        "label": "天祝藏族自治县",
                        "value": "620623",
                        "cityCode": "620600",
                        "provinceCode": "620000",
                        "lon": 102.76116389471,
                        "lat": 37.280912201076
                    }
                ]
            },
            {
                "label": "张掖市",
                "value": "620700",
                "provinceCode": "620000",
                "lon": 100.45989186892,
                "lat": 38.939320296982,
                "children": [
                    {
                        "label": "甘州区",
                        "value": "620702",
                        "cityCode": "620700",
                        "provinceCode": "620000",
                        "lon": 100.52207864992,
                        "lat": 39.010620607403
                    },
                    {
                        "label": "肃南裕固族自治县",
                        "value": "620721",
                        "cityCode": "620700",
                        "provinceCode": "620000",
                        "lon": 99.32677151937,
                        "lat": 38.92057106606
                    },
                    {
                        "label": "民乐县",
                        "value": "620722",
                        "cityCode": "620700",
                        "provinceCode": "620000",
                        "lon": 100.7984292987,
                        "lat": 38.473163420728
                    },
                    {
                        "label": "临泽县",
                        "value": "620723",
                        "cityCode": "620700",
                        "provinceCode": "620000",
                        "lon": 100.19122429388,
                        "lat": 39.347031674446
                    },
                    {
                        "label": "高台县",
                        "value": "620724",
                        "cityCode": "620700",
                        "provinceCode": "620000",
                        "lon": 99.607521373805,
                        "lat": 39.54167477275
                    },
                    {
                        "label": "山丹县",
                        "value": "620725",
                        "cityCode": "620700",
                        "provinceCode": "620000",
                        "lon": 101.23164701727,
                        "lat": 38.530221367211
                    }
                ]
            },
            {
                "label": "平凉市",
                "value": "620800",
                "provinceCode": "620000",
                "lon": 106.68891115655,
                "lat": 35.550110190017,
                "children": [
                    {
                        "label": "崆峒区",
                        "value": "620802",
                        "cityCode": "620800",
                        "provinceCode": "620000",
                        "lon": 106.74888681637,
                        "lat": 35.515774315921
                    },
                    {
                        "label": "泾川县",
                        "value": "620821",
                        "cityCode": "620800",
                        "provinceCode": "620000",
                        "lon": 107.44140503868,
                        "lat": 35.354114511504
                    },
                    {
                        "label": "灵台县",
                        "value": "620822",
                        "cityCode": "620800",
                        "provinceCode": "620000",
                        "lon": 107.40960562376,
                        "lat": 35.074478179591
                    },
                    {
                        "label": "崇信县",
                        "value": "620823",
                        "cityCode": "620800",
                        "provinceCode": "620000",
                        "lon": 107.0037763949,
                        "lat": 35.249102891785
                    },
                    {
                        "label": "庄浪县",
                        "value": "620825",
                        "cityCode": "620800",
                        "provinceCode": "620000",
                        "lon": 106.06568568013,
                        "lat": 35.255968489859
                    },
                    {
                        "label": "静宁县",
                        "value": "620826",
                        "cityCode": "620800",
                        "provinceCode": "620000",
                        "lon": 105.67756247251,
                        "lat": 35.434011745999
                    }
                ]
            },
            {
                "label": "酒泉市",
                "value": "620900",
                "provinceCode": "620000",
                "lon": 98.508414506167,
                "lat": 39.741473768159,
                "children": [
                    {
                        "label": "肃州区",
                        "value": "620902",
                        "cityCode": "620900",
                        "provinceCode": "620000",
                        "lon": 98.802616462619,
                        "lat": 39.598374259485
                    },
                    {
                        "label": "金塔县",
                        "value": "620921",
                        "cityCode": "620900",
                        "provinceCode": "620000",
                        "lon": 99.186587021952,
                        "lat": 40.382579195507
                    },
                    {
                        "label": "瓜州县",
                        "value": "620922",
                        "cityCode": "620900",
                        "provinceCode": "620000",
                        "lon": 95.804712825239,
                        "lat": 40.734286870761
                    },
                    {
                        "label": "肃北蒙古族自治县",
                        "value": "620923",
                        "cityCode": "620900",
                        "provinceCode": "620000",
                        "lon": 96.532550627515,
                        "lat": 40.67651966541
                    },
                    {
                        "label": "阿克塞哈萨克族自治县",
                        "value": "620924",
                        "cityCode": "620900",
                        "provinceCode": "620000",
                        "lon": 94.452300569161,
                        "lat": 39.025889605786
                    },
                    {
                        "label": "玉门市",
                        "value": "620981",
                        "cityCode": "620900",
                        "provinceCode": "620000",
                        "lon": 97.461208851694,
                        "lat": 40.225551802072
                    },
                    {
                        "label": "敦煌市",
                        "value": "620982",
                        "cityCode": "620900",
                        "provinceCode": "620000",
                        "lon": 94.158041766451,
                        "lat": 40.388771499344
                    }
                ]
            },
            {
                "label": "庆阳市",
                "value": "621000",
                "provinceCode": "620000",
                "lon": 107.64422708673,
                "lat": 35.72680075453,
                "children": [
                    {
                        "label": "西峰区",
                        "value": "621002",
                        "cityCode": "621000",
                        "provinceCode": "620000",
                        "lon": 107.67367365978,
                        "lat": 35.677201418546
                    },
                    {
                        "label": "庆城县",
                        "value": "621021",
                        "cityCode": "621000",
                        "provinceCode": "620000",
                        "lon": 107.68254775923,
                        "lat": 36.046137555053
                    },
                    {
                        "label": "环县",
                        "value": "621022",
                        "cityCode": "621000",
                        "provinceCode": "620000",
                        "lon": 107.07217218514,
                        "lat": 36.616788638949
                    },
                    {
                        "label": "华池县",
                        "value": "621023",
                        "cityCode": "621000",
                        "provinceCode": "620000",
                        "lon": 108.03431226296,
                        "lat": 36.444471972715
                    },
                    {
                        "label": "合水县",
                        "value": "621024",
                        "cityCode": "621000",
                        "provinceCode": "620000",
                        "lon": 108.31734058051,
                        "lat": 36.014259860237
                    },
                    {
                        "label": "正宁县",
                        "value": "621025",
                        "cityCode": "621000",
                        "provinceCode": "620000",
                        "lon": 108.37808719083,
                        "lat": 35.414731657592
                    },
                    {
                        "label": "宁县",
                        "value": "621026",
                        "cityCode": "621000",
                        "provinceCode": "620000",
                        "lon": 108.11417335803,
                        "lat": 35.571366266826
                    },
                    {
                        "label": "镇原县",
                        "value": "621027",
                        "cityCode": "621000",
                        "provinceCode": "620000",
                        "lon": 107.17722652653,
                        "lat": 35.787953892327
                    }
                ]
            },
            {
                "label": "定西市",
                "value": "621100",
                "provinceCode": "620000",
                "lon": 104.62663760066,
                "lat": 35.586056241828,
                "children": [
                    {
                        "label": "安定区",
                        "value": "621102",
                        "cityCode": "621100",
                        "provinceCode": "620000",
                        "lon": 104.63762366893,
                        "lat": 35.644415174266
                    },
                    {
                        "label": "通渭县",
                        "value": "621121",
                        "cityCode": "621100",
                        "provinceCode": "620000",
                        "lon": 105.19397766216,
                        "lat": 35.213473762851
                    },
                    {
                        "label": "陇西县",
                        "value": "621122",
                        "cityCode": "621100",
                        "provinceCode": "620000",
                        "lon": 104.63291319296,
                        "lat": 35.111801691091
                    },
                    {
                        "label": "渭源县",
                        "value": "621123",
                        "cityCode": "621100",
                        "provinceCode": "620000",
                        "lon": 104.14632784195,
                        "lat": 35.139480681839
                    },
                    {
                        "label": "临洮县",
                        "value": "621124",
                        "cityCode": "621100",
                        "provinceCode": "620000",
                        "lon": 103.91201515484,
                        "lat": 35.531078701642
                    },
                    {
                        "label": "漳县",
                        "value": "621125",
                        "cityCode": "621100",
                        "provinceCode": "620000",
                        "lon": 104.36540253683,
                        "lat": 34.726750534701
                    },
                    {
                        "label": "岷县",
                        "value": "621126",
                        "cityCode": "621100",
                        "provinceCode": "620000",
                        "lon": 104.24672610097,
                        "lat": 34.429644403444
                    }
                ]
            },
            {
                "label": "陇南市",
                "value": "621200",
                "provinceCode": "620000",
                "lon": 104.93457340575,
                "lat": 33.394479972938,
                "children": [
                    {
                        "label": "武都区",
                        "value": "621202",
                        "cityCode": "621200",
                        "provinceCode": "620000",
                        "lon": 105.13455295643,
                        "lat": 33.293917195649
                    },
                    {
                        "label": "成县",
                        "value": "621221",
                        "cityCode": "621200",
                        "provinceCode": "620000",
                        "lon": 105.68828896242,
                        "lat": 33.747296636905
                    },
                    {
                        "label": "文县",
                        "value": "621222",
                        "cityCode": "621200",
                        "provinceCode": "620000",
                        "lon": 104.78420570271,
                        "lat": 32.947265418467
                    },
                    {
                        "label": "宕昌县",
                        "value": "621223",
                        "cityCode": "621200",
                        "provinceCode": "620000",
                        "lon": 104.45282709018,
                        "lat": 34.013488842529
                    },
                    {
                        "label": "康县",
                        "value": "621224",
                        "cityCode": "621200",
                        "provinceCode": "620000",
                        "lon": 105.63797390347,
                        "lat": 33.284990408681
                    },
                    {
                        "label": "西和县",
                        "value": "621225",
                        "cityCode": "621200",
                        "provinceCode": "620000",
                        "lon": 105.33853139264,
                        "lat": 33.919624520579
                    },
                    {
                        "label": "礼县",
                        "value": "621226",
                        "cityCode": "621200",
                        "provinceCode": "620000",
                        "lon": 105.06409130212,
                        "lat": 34.111636708139
                    },
                    {
                        "label": "徽县",
                        "value": "621227",
                        "cityCode": "621200",
                        "provinceCode": "620000",
                        "lon": 106.03331703965,
                        "lat": 33.892851204433
                    },
                    {
                        "label": "两当县",
                        "value": "621228",
                        "cityCode": "621200",
                        "provinceCode": "620000",
                        "lon": 106.40388517582,
                        "lat": 33.911378923592
                    }
                ]
            },
            {
                "label": "临夏回族自治州",
                "value": "622900",
                "provinceCode": "620000",
                "lon": 103.21524917832,
                "lat": 35.598514348802,
                "children": [
                    {
                        "label": "临夏市",
                        "value": "622901",
                        "cityCode": "622900",
                        "provinceCode": "620000",
                        "lon": 103.2005757611,
                        "lat": 35.585834814564
                    },
                    {
                        "label": "临夏县",
                        "value": "622921",
                        "cityCode": "622900",
                        "provinceCode": "620000",
                        "lon": 103.05079063073,
                        "lat": 35.51871940176
                    },
                    {
                        "label": "康乐县",
                        "value": "622922",
                        "cityCode": "622900",
                        "provinceCode": "620000",
                        "lon": 103.62902014045,
                        "lat": 35.258018266344
                    },
                    {
                        "label": "永靖县",
                        "value": "622923",
                        "cityCode": "622900",
                        "provinceCode": "620000",
                        "lon": 103.22504409432,
                        "lat": 36.007874959311
                    },
                    {
                        "label": "广河县",
                        "value": "622924",
                        "cityCode": "622900",
                        "provinceCode": "620000",
                        "lon": 103.63113999251,
                        "lat": 35.478027097747
                    },
                    {
                        "label": "和政县",
                        "value": "622925",
                        "cityCode": "622900",
                        "provinceCode": "620000",
                        "lon": 103.29856767173,
                        "lat": 35.345732331975
                    },
                    {
                        "label": "东乡族自治县",
                        "value": "622926",
                        "cityCode": "622900",
                        "provinceCode": "620000",
                        "lon": 103.45214513327,
                        "lat": 35.698472340993
                    },
                    {
                        "label": "积石山保安族东乡族撒拉族自治县",
                        "value": "622927",
                        "cityCode": "622900",
                        "provinceCode": "620000",
                        "lon": 102.86781858816,
                        "lat": 35.710873026896
                    }
                ]
            },
            {
                "label": "甘南藏族自治州",
                "value": "623000",
                "provinceCode": "620000",
                "lon": 102.9174424865,
                "lat": 34.992211178379,
                "children": [
                    {
                        "label": "合作市",
                        "value": "623001",
                        "cityCode": "623000",
                        "provinceCode": "620000",
                        "lon": 103.08564921659,
                        "lat": 34.997259505739
                    },
                    {
                        "label": "临潭县",
                        "value": "623021",
                        "cityCode": "623000",
                        "provinceCode": "620000",
                        "lon": 103.63190648409,
                        "lat": 34.742615145611
                    },
                    {
                        "label": "卓尼县",
                        "value": "623022",
                        "cityCode": "623000",
                        "provinceCode": "620000",
                        "lon": 103.39362024363,
                        "lat": 34.614457775996
                    },
                    {
                        "label": "舟曲县",
                        "value": "623023",
                        "cityCode": "623000",
                        "provinceCode": "620000",
                        "lon": 104.32632271288,
                        "lat": 33.634810419739
                    },
                    {
                        "label": "迭部县",
                        "value": "623024",
                        "cityCode": "623000",
                        "provinceCode": "620000",
                        "lon": 103.57044621531,
                        "lat": 34.005620769228
                    },
                    {
                        "label": "玛曲县",
                        "value": "623025",
                        "cityCode": "623000",
                        "provinceCode": "620000",
                        "lon": 101.66897741851,
                        "lat": 33.850721989423
                    },
                    {
                        "label": "碌曲县",
                        "value": "623026",
                        "cityCode": "623000",
                        "provinceCode": "620000",
                        "lon": 102.4775472855,
                        "lat": 34.392608970483
                    },
                    {
                        "label": "夏河县",
                        "value": "623027",
                        "cityCode": "623000",
                        "provinceCode": "620000",
                        "lon": 102.50657841215,
                        "lat": 35.023030857767
                    }
                ]
            }
        ],
        "label": "甘肃省",
        "value": "620000"
    },
    {
        "country": "china",
        "lon": 96.202543672261,
        "lat": 35.499761004275,
        "children": [
            {
                "label": "西宁市",
                "value": "630100",
                "provinceCode": "630000",
                "lon": 101.7679209898,
                "lat": 36.640738611958,
                "children": [
                    {
                        "label": "城东区",
                        "value": "630102",
                        "cityCode": "630100",
                        "provinceCode": "630000",
                        "lon": 101.8318647116,
                        "lat": 36.602116754388
                    },
                    {
                        "label": "城中区",
                        "value": "630103",
                        "cityCode": "630100",
                        "provinceCode": "630000",
                        "lon": 101.77736110275,
                        "lat": 36.606648708407
                    },
                    {
                        "label": "城西区",
                        "value": "630104",
                        "cityCode": "630100",
                        "provinceCode": "630000",
                        "lon": 101.72760342157,
                        "lat": 36.631635686769
                    },
                    {
                        "label": "城北区",
                        "value": "630105",
                        "cityCode": "630100",
                        "provinceCode": "630000",
                        "lon": 101.7126636128,
                        "lat": 36.686367847542
                    },
                    {
                        "label": "大通回族土族自治县",
                        "value": "630121",
                        "cityCode": "630100",
                        "provinceCode": "630000",
                        "lon": 101.49047766775,
                        "lat": 37.120688447453
                    },
                    {
                        "label": "湟中县",
                        "value": "630122",
                        "cityCode": "630100",
                        "provinceCode": "630000",
                        "lon": 101.54449443066,
                        "lat": 36.579759412822
                    },
                    {
                        "label": "湟源县",
                        "value": "630123",
                        "cityCode": "630100",
                        "provinceCode": "630000",
                        "lon": 101.16317752228,
                        "lat": 36.636354795068
                    }
                ]
            },
            {
                "label": "海东市",
                "value": "630200",
                "provinceCode": "630000",
                "lon": 102.37668874252,
                "lat": 36.312743354178,
                "children": [
                    {
                        "label": "乐都区",
                        "value": "630202",
                        "cityCode": "630200",
                        "provinceCode": "630000",
                        "lon": 102.45288779666,
                        "lat": 36.535266451079
                    },
                    {
                        "label": "平安区",
                        "value": "630203",
                        "cityCode": "630200",
                        "provinceCode": "630000",
                        "lon": 102.00299964296,
                        "lat": 36.410605515699
                    },
                    {
                        "label": "民和回族土族自治县",
                        "value": "630222",
                        "cityCode": "630200",
                        "provinceCode": "630000",
                        "lon": 102.37668874252,
                        "lat": 36.312743354178
                    },
                    {
                        "label": "互助土族自治县",
                        "value": "630223",
                        "cityCode": "630200",
                        "provinceCode": "630000",
                        "lon": 102.25718820705,
                        "lat": 36.83096012588
                    },
                    {
                        "label": "化隆回族自治县",
                        "value": "630224",
                        "cityCode": "630200",
                        "provinceCode": "630000",
                        "lon": 102.19192348838,
                        "lat": 36.063668678141
                    },
                    {
                        "label": "循化撒拉族自治县",
                        "value": "630225",
                        "cityCode": "630200",
                        "provinceCode": "630000",
                        "lon": 102.41213008567,
                        "lat": 35.70370031381
                    }
                ]
            },
            {
                "label": "海北藏族自治州",
                "value": "632200",
                "provinceCode": "630000",
                "lon": 100.87980217448,
                "lat": 36.960654101084,
                "children": [
                    {
                        "label": "门源回族自治县",
                        "value": "632221",
                        "cityCode": "632200",
                        "provinceCode": "630000",
                        "lon": 101.73134392349,
                        "lat": 37.45838446475
                    },
                    {
                        "label": "祁连县",
                        "value": "632222",
                        "cityCode": "632200",
                        "provinceCode": "630000",
                        "lon": 99.711262922683,
                        "lat": 38.327948935969
                    },
                    {
                        "label": "海晏县",
                        "value": "632223",
                        "cityCode": "632200",
                        "provinceCode": "630000",
                        "lon": 100.84335509134,
                        "lat": 37.114748322372
                    },
                    {
                        "label": "刚察县",
                        "value": "632224",
                        "cityCode": "632200",
                        "provinceCode": "630000",
                        "lon": 99.988382638435,
                        "lat": 37.556876866897
                    }
                ]
            },
            {
                "label": "黄南藏族自治州",
                "value": "632300",
                "provinceCode": "630000",
                "lon": 102.00760030834,
                "lat": 35.522851551728,
                "children": [
                    {
                        "label": "同仁县",
                        "value": "632321",
                        "cityCode": "632300",
                        "provinceCode": "630000",
                        "lon": 102.07844901848,
                        "lat": 35.426828765429
                    },
                    {
                        "label": "尖扎县",
                        "value": "632322",
                        "cityCode": "632300",
                        "provinceCode": "630000",
                        "lon": 101.8497538518,
                        "lat": 35.918696822502
                    },
                    {
                        "label": "泽库县",
                        "value": "632323",
                        "cityCode": "632300",
                        "provinceCode": "630000",
                        "lon": 101.43544631681,
                        "lat": 35.139216924404
                    },
                    {
                        "label": "河南蒙古族自治县",
                        "value": "632324",
                        "cityCode": "632300",
                        "provinceCode": "630000",
                        "lon": 101.55630729533,
                        "lat": 34.511389737869
                    }
                ]
            },
            {
                "label": "海南藏族自治州",
                "value": "632500",
                "provinceCode": "630000",
                "lon": 100.6240660941,
                "lat": 36.284363803805,
                "children": [
                    {
                        "label": "共和县",
                        "value": "632521",
                        "cityCode": "632500",
                        "provinceCode": "630000",
                        "lon": 100.06487566684,
                        "lat": 36.538342364813
                    },
                    {
                        "label": "同德县",
                        "value": "632522",
                        "cityCode": "632500",
                        "provinceCode": "630000",
                        "lon": 100.60173869992,
                        "lat": 35.068401149266
                    },
                    {
                        "label": "贵德县",
                        "value": "632523",
                        "cityCode": "632500",
                        "provinceCode": "630000",
                        "lon": 101.41576189108,
                        "lat": 36.010503374887
                    },
                    {
                        "label": "兴海县",
                        "value": "632524",
                        "cityCode": "632500",
                        "provinceCode": "630000",
                        "lon": 99.733309029,
                        "lat": 35.54029982537
                    },
                    {
                        "label": "贵南县",
                        "value": "632525",
                        "cityCode": "632500",
                        "provinceCode": "630000",
                        "lon": 100.8846104318,
                        "lat": 35.698086207737
                    }
                ]
            },
            {
                "label": "果洛藏族自治州",
                "value": "632600",
                "provinceCode": "630000",
                "lon": 100.22372276899,
                "lat": 34.48048458461,
                "children": [
                    {
                        "label": "玛沁县",
                        "value": "632621",
                        "cityCode": "632600",
                        "provinceCode": "630000",
                        "lon": 99.794261606919,
                        "lat": 34.504017087053
                    },
                    {
                        "label": "班玛县",
                        "value": "632622",
                        "cityCode": "632600",
                        "provinceCode": "630000",
                        "lon": 100.55042865772,
                        "lat": 32.909735756429
                    },
                    {
                        "label": "甘德县",
                        "value": "632623",
                        "cityCode": "632600",
                        "provinceCode": "630000",
                        "lon": 100.1478423084,
                        "lat": 34.021807573602
                    },
                    {
                        "label": "达日县",
                        "value": "632624",
                        "cityCode": "632600",
                        "provinceCode": "630000",
                        "lon": 99.410809497102,
                        "lat": 33.482696864248
                    },
                    {
                        "label": "久治县",
                        "value": "632625",
                        "cityCode": "632600",
                        "provinceCode": "630000",
                        "lon": 101.00550828784,
                        "lat": 33.473902951608
                    },
                    {
                        "label": "玛多县",
                        "value": "632626",
                        "cityCode": "632600",
                        "provinceCode": "630000",
                        "lon": 98.244476788626,
                        "lat": 34.79757019551
                    }
                ]
            },
            {
                "label": "玉树藏族自治州",
                "value": "632700",
                "provinceCode": "630000",
                "lon": 97.013316137414,
                "lat": 33.006239909722,
                "children": [
                    {
                        "label": "玉树市",
                        "value": "632701",
                        "cityCode": "632700",
                        "provinceCode": "630000",
                        "lon": 96.712350119487,
                        "lat": 32.906574629922
                    },
                    {
                        "label": "杂多县",
                        "value": "632722",
                        "cityCode": "632700",
                        "provinceCode": "630000",
                        "lon": 94.30131455019,
                        "lat": 33.065763568805
                    },
                    {
                        "label": "称多县",
                        "value": "632723",
                        "cityCode": "632700",
                        "provinceCode": "630000",
                        "lon": 97.001973841494,
                        "lat": 33.935171842212
                    },
                    {
                        "label": "治多县",
                        "value": "632724",
                        "cityCode": "632700",
                        "provinceCode": "630000",
                        "lon": 92.608641864013,
                        "lat": 34.884438571607
                    },
                    {
                        "label": "囊谦县",
                        "value": "632725",
                        "cityCode": "632700",
                        "provinceCode": "630000",
                        "lon": 96.137026010488,
                        "lat": 32.178288570852
                    },
                    {
                        "label": "曲麻莱县",
                        "value": "632726",
                        "cityCode": "632700",
                        "provinceCode": "630000",
                        "lon": 95.140845875343,
                        "lat": 34.876865391833
                    }
                ]
            },
            {
                "label": "海西蒙古族藏族自治州",
                "value": "632800",
                "provinceCode": "630000",
                "lon": 97.342625415333,
                "lat": 37.37379907059,
                "children": [
                    {
                        "label": "格尔木市",
                        "value": "632801",
                        "cityCode": "632800",
                        "provinceCode": "630000",
                        "lon": 96.202543672261,
                        "lat": 35.499761004275
                    },
                    {
                        "label": "德令哈市",
                        "value": "632802",
                        "cityCode": "632800",
                        "provinceCode": "630000",
                        "lon": 96.202543672261,
                        "lat": 35.499761004275
                    },
                    {
                        "label": "乌兰县",
                        "value": "632821",
                        "cityCode": "632800",
                        "provinceCode": "630000",
                        "lon": 98.672630599729,
                        "lat": 36.902366896364
                    },
                    {
                        "label": "都兰县",
                        "value": "632822",
                        "cityCode": "632800",
                        "provinceCode": "630000",
                        "lon": 97.154434686537,
                        "lat": 36.160067040805
                    },
                    {
                        "label": "天峻县",
                        "value": "632823",
                        "cityCode": "632800",
                        "provinceCode": "630000",
                        "lon": 98.496512304144,
                        "lat": 38.051753388375
                    }
                ]
            }
        ],
        "label": "青海省",
        "value": "630000"
    },
    {
        "country": "china",
        "lon": 106.15548126505,
        "lat": 37.321323112295,
        "children": [
            {
                "label": "银川市",
                "value": "640100",
                "provinceCode": "640000",
                "lon": 106.20647860784,
                "lat": 38.502621011876,
                "children": [
                    {
                        "label": "兴庆区",
                        "value": "640104",
                        "cityCode": "640100",
                        "provinceCode": "640000",
                        "lon": 106.38212078081,
                        "lat": 38.464266316255
                    },
                    {
                        "label": "西夏区",
                        "value": "640105",
                        "cityCode": "640100",
                        "provinceCode": "640000",
                        "lon": 106.05555591606,
                        "lat": 38.55328059311
                    },
                    {
                        "label": "金凤区",
                        "value": "640106",
                        "cityCode": "640100",
                        "provinceCode": "640000",
                        "lon": 106.24264950801,
                        "lat": 38.47859072607
                    },
                    {
                        "label": "永宁县",
                        "value": "640121",
                        "cityCode": "640100",
                        "provinceCode": "640000",
                        "lon": 106.10904802497,
                        "lat": 38.295049444356
                    },
                    {
                        "label": "贺兰县",
                        "value": "640122",
                        "cityCode": "640100",
                        "provinceCode": "640000",
                        "lon": 106.26651804243,
                        "lat": 38.687106885054
                    },
                    {
                        "label": "灵武市",
                        "value": "640181",
                        "cityCode": "640100",
                        "provinceCode": "640000",
                        "lon": 106.53199999229,
                        "lat": 37.935174812169
                    }
                ]
            },
            {
                "label": "石嘴山市",
                "value": "640200",
                "provinceCode": "640000",
                "lon": 106.37933720153,
                "lat": 39.020223283603,
                "children": [
                    {
                        "label": "大武口区",
                        "value": "640202",
                        "cityCode": "640200",
                        "provinceCode": "640000",
                        "lon": 106.38721561034,
                        "lat": 38.967534270672
                    },
                    {
                        "label": "惠农区",
                        "value": "640205",
                        "cityCode": "640200",
                        "provinceCode": "640000",
                        "lon": 106.61377347013,
                        "lat": 39.108073765064
                    },
                    {
                        "label": "平罗县",
                        "value": "640221",
                        "cityCode": "640200",
                        "provinceCode": "640000",
                        "lon": 106.54437947509,
                        "lat": 38.891511355897
                    }
                ]
            },
            {
                "label": "吴忠市",
                "value": "640300",
                "provinceCode": "640000",
                "lon": 106.20825419851,
                "lat": 37.993561002936,
                "children": [
                    {
                        "label": "利通区",
                        "value": "640302",
                        "cityCode": "640300",
                        "provinceCode": "640000",
                        "lon": 106.21901163377,
                        "lat": 37.76788189318
                    },
                    {
                        "label": "红寺堡区",
                        "value": "640303",
                        "cityCode": "640300",
                        "provinceCode": "640000",
                        "lon": 106.16687896986,
                        "lat": 37.374136412893
                    },
                    {
                        "label": "盐池县",
                        "value": "640323",
                        "cityCode": "640300",
                        "provinceCode": "640000",
                        "lon": 107.04976116152,
                        "lat": 37.625336523188
                    },
                    {
                        "label": "同心县",
                        "value": "640324",
                        "cityCode": "640300",
                        "provinceCode": "640000",
                        "lon": 106.24738743176,
                        "lat": 37.098456634364
                    },
                    {
                        "label": "青铜峡市",
                        "value": "640381",
                        "cityCode": "640300",
                        "provinceCode": "640000",
                        "lon": 105.96146159918,
                        "lat": 37.942124742884
                    }
                ]
            },
            {
                "label": "固原市",
                "value": "640400",
                "provinceCode": "640000",
                "lon": 106.28526799598,
                "lat": 36.021523480709,
                "children": [
                    {
                        "label": "原州区",
                        "value": "640402",
                        "cityCode": "640400",
                        "provinceCode": "640000",
                        "lon": 106.25401126905,
                        "lat": 36.206829483476
                    },
                    {
                        "label": "西吉县",
                        "value": "640422",
                        "cityCode": "640400",
                        "provinceCode": "640000",
                        "lon": 105.72674858688,
                        "lat": 35.939934380868
                    },
                    {
                        "label": "隆德县",
                        "value": "640423",
                        "cityCode": "640400",
                        "provinceCode": "640000",
                        "lon": 106.07361128455,
                        "lat": 35.589137720123
                    },
                    {
                        "label": "泾源县",
                        "value": "640424",
                        "cityCode": "640400",
                        "provinceCode": "640000",
                        "lon": 106.35402263843,
                        "lat": 35.529746376118
                    },
                    {
                        "label": "彭阳县",
                        "value": "640425",
                        "cityCode": "640400",
                        "provinceCode": "640000",
                        "lon": 106.66247325572,
                        "lat": 35.972546262958
                    }
                ]
            },
            {
                "label": "中卫市",
                "value": "640500",
                "provinceCode": "640000",
                "lon": 105.19675419936,
                "lat": 37.521124191595,
                "children": [
                    {
                        "label": "沙坡头区",
                        "value": "640502",
                        "cityCode": "640500",
                        "provinceCode": "640000",
                        "lon": 105.11127776143,
                        "lat": 37.360638517868
                    },
                    {
                        "label": "中宁县",
                        "value": "640521",
                        "cityCode": "640500",
                        "provinceCode": "640000",
                        "lon": 105.69186958245,
                        "lat": 37.360097375108
                    },
                    {
                        "label": "海原县",
                        "value": "640522",
                        "cityCode": "640500",
                        "provinceCode": "640000",
                        "lon": 105.67964899633,
                        "lat": 36.603124838712
                    }
                ]
            }
        ],
        "label": "宁夏回族自治区",
        "value": "640000"
    },
    {
        "country": "china",
        "lon": 85.614899338339,
        "lat": 42.127000957642,
        "children": [
            {
                "label": "乌鲁木齐市",
                "value": "650100",
                "provinceCode": "650000",
                "lon": 87.564987741116,
                "lat": 43.840380347218,
                "children": [
                    {
                        "label": "天山区",
                        "value": "650102",
                        "cityCode": "650100",
                        "provinceCode": "650000",
                        "lon": 87.632902512248,
                        "lat": 43.783860225571
                    },
                    {
                        "label": "沙依巴克区",
                        "value": "650103",
                        "cityCode": "650100",
                        "provinceCode": "650000",
                        "lon": 87.545631053987,
                        "lat": 43.807885738392
                    },
                    {
                        "label": "新市区",
                        "value": "650104",
                        "cityCode": "650100",
                        "provinceCode": "650000",
                        "lon": 87.549218796363,
                        "lat": 43.898324290635
                    },
                    {
                        "label": "水磨沟区",
                        "value": "650105",
                        "cityCode": "650100",
                        "provinceCode": "650000",
                        "lon": 87.668013771241,
                        "lat": 43.843907230143
                    },
                    {
                        "label": "头屯河区",
                        "value": "650106",
                        "cityCode": "650100",
                        "provinceCode": "650000",
                        "lon": 87.425048810466,
                        "lat": 43.925789450498
                    },
                    {
                        "label": "达坂城区",
                        "value": "650107",
                        "cityCode": "650100",
                        "provinceCode": "650000",
                        "lon": 87.895407243798,
                        "lat": 42.840608943765
                    },
                    {
                        "label": "米东区",
                        "value": "650109",
                        "cityCode": "650100",
                        "provinceCode": "650000",
                        "lon": 87.691186460177,
                        "lat": 44.070554173621
                    },
                    {
                        "label": "乌鲁木齐县",
                        "value": "650121",
                        "cityCode": "650100",
                        "provinceCode": "650000",
                        "lon": 87.360244284205,
                        "lat": 43.419107804291
                    }
                ]
            },
            {
                "label": "克拉玛依市",
                "value": "650200",
                "provinceCode": "650000",
                "lon": 84.881180186144,
                "lat": 45.594331066706,
                "children": [
                    {
                        "label": "独山子区",
                        "value": "650202",
                        "cityCode": "650200",
                        "provinceCode": "650000",
                        "lon": 84.899916988861,
                        "lat": 44.302338209135
                    },
                    {
                        "label": "克拉玛依区",
                        "value": "650203",
                        "cityCode": "650200",
                        "provinceCode": "650000",
                        "lon": 84.926989634948,
                        "lat": 45.203919246039
                    },
                    {
                        "label": "白碱滩区",
                        "value": "650204",
                        "cityCode": "650200",
                        "provinceCode": "650000",
                        "lon": 85.177828513011,
                        "lat": 45.633602431504
                    },
                    {
                        "label": "乌尔禾区",
                        "value": "650205",
                        "cityCode": "650200",
                        "provinceCode": "650000",
                        "lon": 85.511149264018,
                        "lat": 46.006575616849
                    }
                ]
            },
            {
                "label": "吐鲁番市",
                "value": "650400",
                "provinceCode": "650000",
                "lon": 89.266025488642,
                "lat": 42.678924820794,
                "children": [
                    {
                        "label": "高昌区",
                        "value": "650402",
                        "cityCode": "650400",
                        "provinceCode": "650000",
                        "lon": 89.227738842032,
                        "lat": 42.508199556726
                    },
                    {
                        "label": "鄯善县",
                        "value": "650421",
                        "cityCode": "650400",
                        "provinceCode": "650000",
                        "lon": 89.266025488642,
                        "lat": 42.678924820794
                    },
                    {
                        "label": "托克逊县",
                        "value": "650422",
                        "cityCode": "650400",
                        "provinceCode": "650000",
                        "lon": 89.266025488642,
                        "lat": 42.678924820794
                    }
                ]
            },
            {
                "label": "哈密市",
                "value": "650500",
                "provinceCode": "650000",
                "lon": 93.529373012389,
                "lat": 42.344467104552,
                "children": [
                    {
                        "label": "伊州区",
                        "value": "650502",
                        "cityCode": "650500",
                        "provinceCode": "650000",
                        "lon": 93.529373012389,
                        "lat": 42.344467104552
                    },
                    {
                        "label": "巴里坤哈萨克自治县",
                        "value": "650521",
                        "cityCode": "650500",
                        "provinceCode": "650000",
                        "lon": 85.614899338339,
                        "lat": 42.127000957642
                    },
                    {
                        "label": "伊吾县",
                        "value": "650522",
                        "cityCode": "650500",
                        "provinceCode": "650000",
                        "lon": 85.614899338339,
                        "lat": 42.127000957642
                    }
                ]
            },
            {
                "label": "昌吉回族自治州",
                "value": "652300",
                "provinceCode": "650000",
                "lon": 87.296038125667,
                "lat": 44.007057898533,
                "children": [
                    {
                        "label": "昌吉市",
                        "value": "652301",
                        "cityCode": "652300",
                        "provinceCode": "650000",
                        "lon": 87.073618053225,
                        "lat": 44.175083447891
                    },
                    {
                        "label": "阜康市",
                        "value": "652302",
                        "cityCode": "652300",
                        "provinceCode": "650000",
                        "lon": 88.305949271281,
                        "lat": 44.424103693512
                    },
                    {
                        "label": "呼图壁县",
                        "value": "652323",
                        "cityCode": "652300",
                        "provinceCode": "650000",
                        "lon": 86.693166111969,
                        "lat": 44.380955717336
                    },
                    {
                        "label": "玛纳斯县",
                        "value": "652324",
                        "cityCode": "652300",
                        "provinceCode": "650000",
                        "lon": 86.137668859258,
                        "lat": 44.503551752404
                    },
                    {
                        "label": "奇台县",
                        "value": "652325",
                        "cityCode": "652300",
                        "provinceCode": "650000",
                        "lon": 90.11026866784,
                        "lat": 44.527652368056
                    },
                    {
                        "label": "吉木萨尔县",
                        "value": "652327",
                        "cityCode": "652300",
                        "provinceCode": "650000",
                        "lon": 89.053073195064,
                        "lat": 44.352913670744
                    },
                    {
                        "label": "木垒哈萨克自治县",
                        "value": "652328",
                        "cityCode": "652300",
                        "provinceCode": "650000",
                        "lon": 90.823487793346,
                        "lat": 44.106618870761
                    }
                ]
            },
            {
                "label": "博尔塔拉蒙古自治州",
                "value": "652700",
                "provinceCode": "650000",
                "lon": 82.052436267224,
                "lat": 44.913651374298,
                "children": [
                    {
                        "label": "博乐市",
                        "value": "652701",
                        "cityCode": "652700",
                        "provinceCode": "650000",
                        "lon": 81.874284679178,
                        "lat": 44.844209020588
                    },
                    {
                        "label": "阿拉山口市",
                        "value": "652702",
                        "cityCode": "652700",
                        "provinceCode": "650000",
                        "lon": 82.895221509025,
                        "lat": 45.061386641726
                    },
                    {
                        "label": "精河县",
                        "value": "652722",
                        "cityCode": "652700",
                        "provinceCode": "650000",
                        "lon": 82.922361700992,
                        "lat": 44.557568454509
                    },
                    {
                        "label": "温泉县",
                        "value": "652723",
                        "cityCode": "652700",
                        "provinceCode": "650000",
                        "lon": 80.952155808353,
                        "lat": 44.9688196179
                    }
                ]
            },
            {
                "label": "巴音郭楞蒙古自治州",
                "value": "652800",
                "provinceCode": "650000",
                "lon": 86.121688362984,
                "lat": 41.771362202569,
                "children": [
                    {
                        "label": "库尔勒市",
                        "value": "652801",
                        "cityCode": "652800",
                        "provinceCode": "650000",
                        "lon": 85.709417601735,
                        "lat": 41.705499905674
                    },
                    {
                        "label": "轮台县",
                        "value": "652822",
                        "cityCode": "652800",
                        "provinceCode": "650000",
                        "lon": 84.57895946698,
                        "lat": 41.819287515207
                    },
                    {
                        "label": "尉犁县",
                        "value": "652823",
                        "cityCode": "652800",
                        "provinceCode": "650000",
                        "lon": 86.866990811172,
                        "lat": 40.858795810656
                    },
                    {
                        "label": "若羌县",
                        "value": "652824",
                        "cityCode": "652800",
                        "provinceCode": "650000",
                        "lon": 89.762772308375,
                        "lat": 38.973844089966
                    },
                    {
                        "label": "且末县",
                        "value": "652825",
                        "cityCode": "652800",
                        "provinceCode": "650000",
                        "lon": 85.506365638195,
                        "lat": 38.100709422823
                    },
                    {
                        "label": "焉耆回族自治县",
                        "value": "652826",
                        "cityCode": "652800",
                        "provinceCode": "650000",
                        "lon": 86.07606847595,
                        "lat": 42.096103707937
                    },
                    {
                        "label": "和静县",
                        "value": "652827",
                        "cityCode": "652800",
                        "provinceCode": "650000",
                        "lon": 85.200093433149,
                        "lat": 42.828681293853
                    },
                    {
                        "label": "和硕县",
                        "value": "652828",
                        "cityCode": "652800",
                        "provinceCode": "650000",
                        "lon": 87.588716477325,
                        "lat": 42.141076067327
                    },
                    {
                        "label": "博湖县",
                        "value": "652829",
                        "cityCode": "652800",
                        "provinceCode": "650000",
                        "lon": 86.88537877372,
                        "lat": 41.857897990299
                    }
                ]
            },
            {
                "label": "阿克苏地区",
                "value": "652900",
                "provinceCode": "650000",
                "lon": 80.269846179329,
                "lat": 41.171730901452,
                "children": [
                    {
                        "label": "阿克苏市",
                        "value": "652901",
                        "cityCode": "652900",
                        "provinceCode": "650000",
                        "lon": 81.156013147807,
                        "lat": 40.349444301113
                    },
                    {
                        "label": "温宿县",
                        "value": "652922",
                        "cityCode": "652900",
                        "provinceCode": "650000",
                        "lon": 80.461878185727,
                        "lat": 41.582084613402
                    },
                    {
                        "label": "库车县",
                        "value": "652923",
                        "cityCode": "652900",
                        "provinceCode": "650000",
                        "lon": 83.459806782673,
                        "lat": 41.781932892776
                    },
                    {
                        "label": "沙雅县",
                        "value": "652924",
                        "cityCode": "652900",
                        "provinceCode": "650000",
                        "lon": 82.925515505452,
                        "lat": 40.406065186743
                    },
                    {
                        "label": "新和县",
                        "value": "652925",
                        "cityCode": "652900",
                        "provinceCode": "650000",
                        "lon": 81.985216276674,
                        "lat": 41.365699703636
                    },
                    {
                        "label": "拜城县",
                        "value": "652926",
                        "cityCode": "652900",
                        "provinceCode": "650000",
                        "lon": 81.90123535088,
                        "lat": 42.04528513577
                    },
                    {
                        "label": "乌什县",
                        "value": "652927",
                        "cityCode": "652900",
                        "provinceCode": "650000",
                        "lon": 79.281638850531,
                        "lat": 41.26184731177
                    },
                    {
                        "label": "阿瓦提县",
                        "value": "652928",
                        "cityCode": "652900",
                        "provinceCode": "650000",
                        "lon": 80.439931783004,
                        "lat": 40.060787890713
                    },
                    {
                        "label": "柯坪县",
                        "value": "652929",
                        "cityCode": "652900",
                        "provinceCode": "650000",
                        "lon": 78.994696137796,
                        "lat": 40.456665812896
                    }
                ]
            },
            {
                "label": "克孜勒苏柯尔克孜自治州",
                "value": "653000",
                "provinceCode": "650000",
                "lon": 76.137564477462,
                "lat": 39.750345577845,
                "children": [
                    {
                        "label": "阿图什市",
                        "value": "653001",
                        "cityCode": "653000",
                        "provinceCode": "650000",
                        "lon": 85.614899338339,
                        "lat": 42.127000957642
                    },
                    {
                        "label": "阿克陶县",
                        "value": "653022",
                        "cityCode": "653000",
                        "provinceCode": "650000",
                        "lon": 75.814939311182,
                        "lat": 39.12880375818
                    },
                    {
                        "label": "阿合奇县",
                        "value": "653023",
                        "cityCode": "653000",
                        "provinceCode": "650000",
                        "lon": 85.614899338339,
                        "lat": 42.127000957642
                    },
                    {
                        "label": "乌恰县",
                        "value": "653024",
                        "cityCode": "653000",
                        "provinceCode": "650000",
                        "lon": 75.146818569489,
                        "lat": 39.971830894544
                    }
                ]
            },
            {
                "label": "喀什地区",
                "value": "653100",
                "provinceCode": "650000",
                "lon": 75.992973267492,
                "lat": 39.470627188746,
                "children": [
                    {
                        "label": "喀什市",
                        "value": "653101",
                        "cityCode": "653100",
                        "provinceCode": "650000",
                        "lon": 76.014342798943,
                        "lat": 39.513110585312
                    },
                    {
                        "label": "疏附县",
                        "value": "653121",
                        "cityCode": "653100",
                        "provinceCode": "650000",
                        "lon": 75.754898212901,
                        "lat": 39.409740997776
                    },
                    {
                        "label": "疏勒县",
                        "value": "653122",
                        "cityCode": "653100",
                        "provinceCode": "650000",
                        "lon": 76.369990308095,
                        "lat": 39.187644733788
                    },
                    {
                        "label": "英吉沙县",
                        "value": "653123",
                        "cityCode": "653100",
                        "provinceCode": "650000",
                        "lon": 76.368708511974,
                        "lat": 38.800015263145
                    },
                    {
                        "label": "泽普县",
                        "value": "653124",
                        "cityCode": "653100",
                        "provinceCode": "650000",
                        "lon": 77.226408238901,
                        "lat": 38.122552699106
                    },
                    {
                        "label": "莎车县",
                        "value": "653125",
                        "cityCode": "653100",
                        "provinceCode": "650000",
                        "lon": 77.014833164072,
                        "lat": 38.322587836687
                    },
                    {
                        "label": "叶城县",
                        "value": "653126",
                        "cityCode": "653100",
                        "provinceCode": "650000",
                        "lon": 77.223630915245,
                        "lat": 36.993013961904
                    },
                    {
                        "label": "麦盖提县",
                        "value": "653127",
                        "cityCode": "653100",
                        "provinceCode": "650000",
                        "lon": 78.242310158759,
                        "lat": 38.848362710463
                    },
                    {
                        "label": "岳普湖县",
                        "value": "653128",
                        "cityCode": "653100",
                        "provinceCode": "650000",
                        "lon": 76.989631103308,
                        "lat": 39.116644959661
                    },
                    {
                        "label": "伽师县",
                        "value": "653129",
                        "cityCode": "653100",
                        "provinceCode": "650000",
                        "lon": 77.231563046663,
                        "lat": 39.599103145624
                    },
                    {
                        "label": "巴楚县",
                        "value": "653130",
                        "cityCode": "653100",
                        "provinceCode": "650000",
                        "lon": 78.907138995454,
                        "lat": 39.618107499846
                    },
                    {
                        "label": "塔什库尔干塔吉克自治县",
                        "value": "653131",
                        "cityCode": "653100",
                        "provinceCode": "650000",
                        "lon": 75.843222371735,
                        "lat": 37.019583155993
                    }
                ]
            },
            {
                "label": "和田地区",
                "value": "653200",
                "provinceCode": "650000",
                "lon": 79.930238637213,
                "lat": 37.116774492678,
                "children": [
                    {
                        "label": "和田市",
                        "value": "653201",
                        "cityCode": "653200",
                        "provinceCode": "650000",
                        "lon": 79.915813731039,
                        "lat": 37.153349739681
                    },
                    {
                        "label": "和田县",
                        "value": "653221",
                        "cityCode": "653200",
                        "provinceCode": "650000",
                        "lon": 79.354993072983,
                        "lat": 35.68343240637
                    },
                    {
                        "label": "墨玉县",
                        "value": "653222",
                        "cityCode": "653200",
                        "provinceCode": "650000",
                        "lon": 80.047148111072,
                        "lat": 38.384224145853
                    },
                    {
                        "label": "皮山县",
                        "value": "653223",
                        "cityCode": "653200",
                        "provinceCode": "650000",
                        "lon": 78.521850388972,
                        "lat": 37.228318546135
                    },
                    {
                        "label": "洛浦县",
                        "value": "653224",
                        "cityCode": "653200",
                        "provinceCode": "650000",
                        "lon": 80.741311117244,
                        "lat": 38.02421985339
                    },
                    {
                        "label": "策勒县",
                        "value": "653225",
                        "cityCode": "653200",
                        "provinceCode": "650000",
                        "lon": 81.097995717517,
                        "lat": 37.084313855547
                    },
                    {
                        "label": "于田县",
                        "value": "653226",
                        "cityCode": "653200",
                        "provinceCode": "650000",
                        "lon": 81.995462903271,
                        "lat": 37.169130186737
                    },
                    {
                        "label": "民丰县",
                        "value": "653227",
                        "cityCode": "653200",
                        "provinceCode": "650000",
                        "lon": 83.352763187,
                        "lat": 37.173146693576
                    }
                ]
            },
            {
                "label": "伊犁哈萨克自治州",
                "value": "654000",
                "provinceCode": "650000",
                "lon": 81.297853530366,
                "lat": 43.922248096341,
                "children": [
                    {
                        "label": "伊宁市",
                        "value": "654002",
                        "cityCode": "654000",
                        "provinceCode": "650000",
                        "lon": 81.289048071493,
                        "lat": 44.020355819309
                    },
                    {
                        "label": "奎屯市",
                        "value": "654003",
                        "cityCode": "654000",
                        "provinceCode": "650000",
                        "lon": 85.013934401512,
                        "lat": 44.559556778997
                    },
                    {
                        "label": "霍尔果斯市",
                        "value": "654004",
                        "cityCode": "654000",
                        "provinceCode": "650000",
                        "lon": 80.472151391129,
                        "lat": 44.452519773233
                    },
                    {
                        "label": "伊宁县",
                        "value": "654021",
                        "cityCode": "654000",
                        "provinceCode": "650000",
                        "lon": 81.756940142999,
                        "lat": 44.008116880627
                    },
                    {
                        "label": "察布查尔锡伯自治县",
                        "value": "654022",
                        "cityCode": "654000",
                        "provinceCode": "650000",
                        "lon": 81.098298342118,
                        "lat": 43.63837704253
                    },
                    {
                        "label": "霍城县",
                        "value": "654023",
                        "cityCode": "654000",
                        "provinceCode": "650000",
                        "lon": 80.781158528097,
                        "lat": 44.309120433611
                    },
                    {
                        "label": "巩留县",
                        "value": "654024",
                        "cityCode": "654000",
                        "provinceCode": "650000",
                        "lon": 82.445700944329,
                        "lat": 43.302460015973
                    },
                    {
                        "label": "新源县",
                        "value": "654025",
                        "cityCode": "654000",
                        "provinceCode": "650000",
                        "lon": 83.558150188258,
                        "lat": 43.376951418093
                    },
                    {
                        "label": "昭苏县",
                        "value": "654026",
                        "cityCode": "654000",
                        "provinceCode": "650000",
                        "lon": 80.984257123681,
                        "lat": 42.776878220953
                    },
                    {
                        "label": "特克斯县",
                        "value": "654027",
                        "cityCode": "654000",
                        "provinceCode": "650000",
                        "lon": 82.006852355503,
                        "lat": 42.925563515093
                    },
                    {
                        "label": "尼勒克县",
                        "value": "654028",
                        "cityCode": "654000",
                        "provinceCode": "650000",
                        "lon": 83.23110039646,
                        "lat": 43.816730949065
                    }
                ]
            },
            {
                "label": "塔城地区",
                "value": "654200",
                "provinceCode": "650000",
                "lon": 82.974880583744,
                "lat": 46.75868362968,
                "children": [
                    {
                        "label": "塔城市",
                        "value": "654201",
                        "cityCode": "654200",
                        "provinceCode": "650000",
                        "lon": 82.974880583744,
                        "lat": 46.75868362968
                    },
                    {
                        "label": "乌苏市",
                        "value": "654202",
                        "cityCode": "654200",
                        "provinceCode": "650000",
                        "lon": 84.277878264967,
                        "lat": 44.40768749824
                    },
                    {
                        "label": "额敏县",
                        "value": "654221",
                        "cityCode": "654200",
                        "provinceCode": "650000",
                        "lon": 84.20931964579,
                        "lat": 46.590663664844
                    },
                    {
                        "label": "沙湾县",
                        "value": "654223",
                        "cityCode": "654200",
                        "provinceCode": "650000",
                        "lon": 85.474874072005,
                        "lat": 44.353744632126
                    },
                    {
                        "label": "托里县",
                        "value": "654224",
                        "cityCode": "654200",
                        "provinceCode": "650000",
                        "lon": 83.895484795593,
                        "lat": 45.656986383852
                    },
                    {
                        "label": "裕民县",
                        "value": "654225",
                        "cityCode": "654200",
                        "provinceCode": "650000",
                        "lon": 82.814799479048,
                        "lat": 46.004456478157
                    },
                    {
                        "label": "和布克赛尔蒙古自治县",
                        "value": "654226",
                        "cityCode": "654200",
                        "provinceCode": "650000",
                        "lon": 86.217435804622,
                        "lat": 46.256702546595
                    }
                ]
            },
            {
                "label": "阿勒泰地区",
                "value": "654300",
                "provinceCode": "650000",
                "lon": 88.137915487132,
                "lat": 47.839744486198,
                "children": [
                    {
                        "label": "阿勒泰市",
                        "value": "654301",
                        "cityCode": "654300",
                        "provinceCode": "650000",
                        "lon": 87.926214360189,
                        "lat": 47.890135725749
                    },
                    {
                        "label": "布尔津县",
                        "value": "654321",
                        "cityCode": "654300",
                        "provinceCode": "650000",
                        "lon": 87.235518096505,
                        "lat": 48.31600661463
                    },
                    {
                        "label": "富蕴县",
                        "value": "654322",
                        "cityCode": "654300",
                        "provinceCode": "650000",
                        "lon": 89.393483612342,
                        "lat": 46.536156506123
                    },
                    {
                        "label": "福海县",
                        "value": "654323",
                        "cityCode": "654300",
                        "provinceCode": "650000",
                        "lon": 88.050870553487,
                        "lat": 46.391693535493
                    },
                    {
                        "label": "哈巴河县",
                        "value": "654324",
                        "cityCode": "654300",
                        "provinceCode": "650000",
                        "lon": 86.409672960245,
                        "lat": 48.316559027363
                    },
                    {
                        "label": "青河县",
                        "value": "654325",
                        "cityCode": "654300",
                        "provinceCode": "650000",
                        "lon": 90.403028447838,
                        "lat": 46.26815068272
                    },
                    {
                        "label": "吉木乃县",
                        "value": "654326",
                        "cityCode": "654300",
                        "provinceCode": "650000",
                        "lon": 86.208104287811,
                        "lat": 47.40631111494
                    }
                ]
            },
            {
                "label": "自治区直辖县级行政区划",
                "value": "659000",
                "provinceCode": "650000",
                "lon": 85.614899338339,
                "lat": 42.127000957642,
                "children": [
                    {
                        "label": "石河子市",
                        "value": "659001",
                        "cityCode": "659000",
                        "provinceCode": "650000",
                        "lon": 85.614899338339,
                        "lat": 42.127000957642
                    },
                    {
                        "label": "阿拉尔市",
                        "value": "659002",
                        "cityCode": "659000",
                        "provinceCode": "650000",
                        "lon": 81.291736550158,
                        "lat": 40.615680005185
                    },
                    {
                        "label": "图木舒克市",
                        "value": "659003",
                        "cityCode": "659000",
                        "provinceCode": "650000",
                        "lon": 79.198155107904,
                        "lat": 39.889222881804
                    },
                    {
                        "label": "五家渠市",
                        "value": "659004",
                        "cityCode": "659000",
                        "provinceCode": "650000",
                        "lon": 87.565448980181,
                        "lat": 44.368899479018
                    },
                    {
                        "label": "铁门关市",
                        "value": "659006",
                        "cityCode": "659000",
                        "provinceCode": "650000",
                        "lon": 85.726306886394,
                        "lat": 41.806667022365
                    }
                ]
            }
        ],
        "label": "新疆维吾尔自治区",
        "value": "650000"
    },
    {
        "country": "china",
        "lon": 121.97387097872,
        "lat": 24.086956718805,
        "label": "台湾省",
        "value": "710000"
    },
    {
        "country": "china",
        "lon": 114.18612410257,
        "lat": 22.29358599328,
        "label": "香港特别行政区",
        "value": "810000"
    },
    {
        "country": "china",
        "lon": 113.55751910182,
        "lat": 22.204117988443,
        "label": "澳门特别行政区",
        "value": "820000"
    }
]